{
  "url": "https://wiki.smartsimple.com/wiki/Branding",
  "title": "Branding",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguration - Essentials\n2.1\n \nLogo\n2.1.1\n \nLogo Specifications\n2.1.2\n \nHow to upload the logo\n2.2\n \nFavicon\n2.2.1\n \nFavicon specifications\n2.2.2\n \nHow to upload the Favicon\n2.3\n \nLogo Text\n2.4\n \nHeader\n2.5\n \nColors and Styles\n2.5.1\n \nHow to modify the Colors and Styles\n2.5.2\n \nColor and Styles settings explained\n2.5.2.1\n \nGlobal Settings\n2.5.2.2\n \nMain Heading Settings\n2.5.2.3\n \nNavigation Settings\n2.5.2.4\n \nTitle Settings\n2.5.2.5\n \nSub-Title Settings\n2.5.2.6\n \nList Settings\n3\n \nConfiguration - Advanced\n3.1\n \nImporting/Exporting Colors and Styles\n3.1.1\n \nHow to export and import colors and styles between systems\n3.1.2\n \nSample colors and styles file\n3.2\n \nTip: Uploading images\n3.3\n \nTip: Sourcing imagery\nOverview\nAs part of the implementation process, SmartSimple or its partners typically configure the look and feel of your system. If you have \nGlobal Administrator\n privileges, you can change the look and feel of your system at any time. This article explains how to upload logos and change the system colors to align your system with your brand.\nThe branding settings affect multiple areas of the system.\n \nList View page as seen by Administrator\n \nObject View page as seen by Administrator\n \nSettings page as seen by Administrator\n \nPortal home page as seen by an applicant\nConfiguration - Essentials\nYou must have \nGlobal Administrator\n access to modify the systems logo and colors.\nLogo\nYou can upload a logo that will appear in the header for all users. This logo appears at the top left of all screens. Typically, people upload their organization’s logo, unless they have created a special logo for their system. If you don’t have a logo, you can enter text.\nNote:\n Logos will appear in a container that is 40 pixels high x 200 pixels wide and as such fine text, details, taglines or longer wordmarks may be hard to read. We suggest using your organization's logo that is best suited for smaller spaces.\n \nLogo appears in the top left in the header of all pages.\n \nExample of organization logos suitable for large and small spaces. Note how elements are removed from logos intended for small spaces.\nLogo Specifications\nDimensions\n112px high and 560px wide are the recommended dimensions. Logos will be sized down to appear at 56 pixels high or lower within the system.\nFormat\nPNG on a transparent background recommended. JPG and GIF are also accepted.\nFile Size\n10 – 20 KB is recommended.\nHow to upload the logo\n Click on the \nSystem Administration\n icon which looks like a gear in the top right of the header.\n Select \nGlobal Settings\n.\n Click on the \nBranding\n tab.\n For \nLogo\n click on the \nBrowse…\n button, which looks like an open folder and select the desired file you want to upload.\n Click the \nUpload\n button to upload your submission.\n Force a cache refresh on your browser (CTRL + F5 on PC, Cmd + R on Mac) to view your changes.\nFavicon\nThe favicon is short for Favorite Icon. Depending on your browser and operating system, this icon may appear on your tabs, in your bookmarks, and on the user’s desktop.\n \nFavicon in browser tab\nFavicon specifications\nDimensions\n48 pixels high by 48 pixels wide.\nFormat\nPNG or ICO is recommended.\nFile Size\n5 – 10 KB is recommended.\nHow to upload the Favicon\n Click on the \nSystem Administration\n icon which looks like a gear in the top right of the header.\n Select \nGlobal Settings\n.\n Click on the \nBranding\n tab.\n For \nFavicon\n click on the \nBrowse…\n button which looks like an open folder and select the desired file.\n Click the \nUpload\n button.\n Force a cache refresh on your browser (CTRL + F5 on PC, Cmd + R on Mac) to view your changes.\nLogo Text\nThe \nLogo Text\n setting is used to set the \nAlt\n text on the logo. The \nAlt\n text will appear if there is no image or if the image fails to load. This text is also used by assistive technology such as screen readers.\n \nLogo Text\nHeader\nAll clients were transitioned to the header below in the June 2025 upgrade.\n \nMain Heading area\nColors and Styles\nBeyond uploading image files, you can adjust the colors and some styles. If you choose to change the colors in your system, make sure you maintain a contrast ratio between fonts and backgrounds of 4.5 or greater to ensure you meet with accessibility standards (Section 508 and WCAG 2.0). The following tool may be used to check your contrast ratio \ncontrast checker by webaim\n.\nNote:\n color settings affect multiple areas in the system, and all color settings affect all users. For example, the colors an administrator sees are the same as the colors an applicant sees.\nHow to modify the Colors and Styles\n Click on the \nSystem Administration\n icon which looks like a gear in the top right of the header.\n Select \nGlobal Settings\n.\n Click on the \nBranding\n tab.\n Click the \nColors & Styles\n link.\n Click on the desired color picker to choose a new color or enter a Hexadecimal value (example: #000000) or choose a style.\n Click \nSave\n.\n Force a cache refresh on your browser (CTRL + F5 on PC, Cmd + R on Mac) to view your change\nColor and Styles settings explained\nGlobal Settings\nMandatory Field Font\nThe color of all fields set as mandatory. Typically, the mandatory field color is set to #D81A01 which is a shade of red. This red has enough contrast to meet with Accessibility guidelines.\nMandatory Field Style\nAny question that is set as mandatory will be by default prefixed with an asterisk \n*\n and must be left like this for accessibility. You may change the caption color to the mandatory field color, instead of showing an asterisk but it is not recommended.\nLink\nThe color of all text links.\nLink Hover\nThe color displayed on text links when you mouse hovers over the link.\nLink Underline\nAny text links will be underlined by default and must be left like this for accessibility. You do have the option to turn off the underlines but it is not recommended.\nButton Font\nThe color used by text and icons inside buttons. This should be set to white or a light color.\nButton Background\nButtons will be this color. This should be set to a dark color for contrast. Popular colors are blue, grey or purple. Red and green are generally avoided as they are associated with error and success messaging.\nButton Hover\nMay be used to change the button color on hover (mouse over).\nHighlight\nWhen the user clicks into an input or tabs to an input the focus will move to that input. When an input is in focus that input background will change from white to the color chosen in this setting. This setting gives an extra layer of visibility and differentiation for the currently selected input. This must be set to a light tint, example yellow such as #F7F4DA. Do not set this color to a grey as the \"X\" used to clear inputs will not show up.\nSave Button Color\nChoose the desired style for Save buttons on record pages.\nDelete Button Color\nChoose the desired style for Delete buttons on record pages.\nMain Heading Settings\n \nMain Heading\nFont\nFont color for main menu links located in the header.\nBackground\nThe header background under the links and logo uses this color. The logo will appear over this color, as will the other text in the header. Typically, a dark color looks best for the header. Make sure there is a contrast ratio of 4.5 or greater between the background color and the font setting to ensure accessibility.\nAccent Font\nFont color for the icons located in the header.\nAccent Background\nThe header background under the icons uses this color. Typically, a dark color looks best for the header accent. Make sure there is a contrast ratio of 4.5 or greater between the accent background color and the accent font setting to ensure accessibility.\nNavigation Settings\n \nLeft Navigation\nFont\nText color on the user menu and on the left navigation.\nBackground\nColor behind the text on the left navigation.\nTitle Settings\nThis section controls the display of the title areas found in areas like the personal dashboard and on portal sections using the traditional theme.\n \nTitle Settings Area appears on portal sections set to the default theme\nFont\nTitle text color. Typically set to a dark color or #000000.\nBackground\nThe background color of the title area. Typically set to a light color or #EEEEEE.\nBottom Border\nIf you want a line under the title bar of a portal section of the theme Traditional to give more separation, use this setting. Typically, it is the same color as the background to give a flat look but sometimes a slightly darker shade of the same color is used here such as #CCCCCC.\nSub-Title Settings\n \nLayout - Title Bar custom field as seen on object pages\n \nHeading as seen by administrators seen on setting pages\nFont\nText color for title bars and headings in the system. Typically set to a dark grey or #000000.\nBottom Border\nUnderline color for title bars and headings in the system. Typically set to a color or light shade of grey.\nList Settings\n \nList Settings Area\nHeading Font\nText color for table headers. Typically a dark color such as the button color background is used here. Do not use white as column headers and tables will not show up in some areas of the system.\nHeading Background\nTable Header background color. Typically a version of the header color at around 15% opacity. Note the header font and background color inverse when the header of a column is clicked. The sorting icons for list views are an opacity of the Heading Font, so be mindful of accessibility standards for color contrast.\nTop Border\nDisplay options for the line at the top of each row in the table to give differentiation between rows. Typically set to a 1px solid FFFFFF (which is white).\nBottom Border\nDisplay options for the line at the bottom of each row in the table to give differentiation between rows. Typically set to a 1px solid CCCCCC (which is a light grey).\nConfiguration - Advanced\nImporting/Exporting Colors and Styles\nYou can import and export your colors and styles settings from one environment to another, or save a copy of your colors and styles for archival purposes. For example, you can make changes and test them on your backup environment and when you are happy, apply all your changes at once to your production environment system.\nHow to export and import colors and styles between systems\n Click on the \nSystem Administration\n icon which looks like a gear in the top right of the header. \n Select \nGlobal Settings\n.\n Click on the \nBranding\n tab.\n Click the \nColors & Styles\n link.\n In the action bar located near the header click on the \nExport Styles\n button.\n A modal window will open. Copy the code in the modal window.\n Go to the system where you want to apply these styles.\n Follow steps 1 to 4 above.\n In the action bar located near the header, click on the \nImport Styles\n button.\n Paste the styles you copied into the modal window of the desired system.\n Click the \nImport Styles\n button on the bottom of the modal window.\n Click \nOK\n on the alert.\n Close the modal window.\n Click \nSave\n.\n Force a cache refresh on your browser (CTRL + F5 on the PC, Cmd + R on Mac) to view your changes.\nSample colors and styles file\nHere is a sample color and styles file you can download and import into your system. It will give you a blue header like the screenshots in this wiki.\nFile:Sample-colors-styles.txt\nTip: Uploading images\nWhen you upload images to your system, always size the images to the desired dimensions and save to the desired file format with compression. Image optimization is typically done in photo editing software such as Adobe Photoshop. Take the time to ensure your image files are 1 MB or less. Larger images can take several seconds to download and may cause a noticeable delay while pages load.\nNote an image saved a 72 pixels per inch (ppi), 240 ppi and 500 ppi will all look the same if viewed at 200 pixels by 200 pixels. The quality of each version of image is exactly the same when viewed on screen. The higher ppi versions have a much higher file size which means your users may have to wait unnecessarily and use more data, but the higher ppi makes no difference to image quality on screen.\nSo, if the image you are uploading is intended to be printed in a PDF, then a higher resolution is ok such as 150 or 300 dpi (dots per inch), but if the image is going to be used as a background in a portal or the login page a smaller resolution such as 72 ppi is recommended.\nIn regards to file formats JPG and PNG are the best options for your system.\nJPG/JPEG\n Joint Photographic Experts Group is a lossy format best for images of people, landscapes, and realistic photography.\nPNG\n Portable Network Graphics is a lossless format that supports transparency and is best suited for logos, graphics, and icons.\nTip: Sourcing imagery\nDon’t have photos to use in your system? Here are some websites that offer copyright-free stock photos for commercial use. Find the images you want, crop and size the images then upload them into your system.\n \nUnsplash\n \nGratisography\n \nMorguefile\n \nPixabay\n \nStockvault\n \nPexels\n \nPicjumbo\n \nRaw Pixel\n \nReshot\nYou may also want to check out the following paid stock photo sites.\n \niStock Photo\n \nShutterstock\nFor free icons\n \nFlaticon\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Branding&oldid=43857\n’ \nCategory\n: \nInterface",
  "links": [],
  "images": [
    "https://wiki.smartsimple.com/images/b/b7/Branding-listview-2025.png",
    "https://wiki.smartsimple.com/images/e/e4/Branding-object-2025.png",
    "https://wiki.smartsimple.com/images/2/2a/Branding-settings-2025.png",
    "https://wiki.smartsimple.com/images/a/a9/Branding-portal-2025.png",
    "https://wiki.smartsimple.com/images/b/b3/Branding-object-logo-2025.png",
    "https://wiki.smartsimple.com/images/c/c6/Wiki-logos.jpg",
    "https://wiki.smartsimple.com/images/8/86/System_Admin_Icon_2025.png",
    "https://wiki.smartsimple.com/images/8/86/Branding-favicon-2025.png",
    "https://wiki.smartsimple.com/images/8/86/System_Admin_Icon_2025.png",
    "https://wiki.smartsimple.com/images/4/43/Branding-logo-text.png",
    "https://wiki.smartsimple.com/images/c/c9/Standard-header-2025.png",
    "https://wiki.smartsimple.com/images/8/86/System_Admin_Icon_2025.png",
    "https://wiki.smartsimple.com/images/2/2b/Branding-main-heading-2025.png",
    "https://wiki.smartsimple.com/images/a/a6/Branding-left-nav-2022.png",
    "https://wiki.smartsimple.com/images/5/5c/Branding-title-2025.png",
    "https://wiki.smartsimple.com/images/7/75/Branding-titlebar-2020.png",
    "https://wiki.smartsimple.com/images/1/14/Branding-title-settings-2020.png",
    "https://wiki.smartsimple.com/images/1/16/Branding-listview-2025-highlight.png",
    "https://wiki.smartsimple.com/images/8/86/System_Admin_Icon_2025.png"
  ]
}