{
  "url": "https://wiki.smartsimple.com/wiki/Content_management",
  "title": "Content management",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nContent Management application\n2\n \nWebsites\n3\n \nVariables\n4\n \nLogin Page - Alternate tab\nContent Management application\nCreate content based portals.\n[#ssupdate @session.expire@#] - expire a session, usually embedded in a logout page\nWebsites\nAllows the creation of custom login pages. This allows you to create multiple custom login pages for various groups of users within the same system.\nVirtual Alias\nWithin Websites you have the option to configure a Virtual Alias. This virtual alias allows your to mask the instance URL and will only function when used in combination with the virtual folder.\nEx. grants.smartsimple.com/welcome/MyFolder/\n = \ngms.smartsimple.com/welcome/MyFolder/\nWhen using a virtual alias, you must append \n?u=1\n to the end of the URL:\nEx. gms.smartsimple.com/welcome/MyFolder/?u=1\nVirtual Alias for a Custom Login Page\nIf you are using Content Management for a separate login page using virtual alias, you will need add the origin URL on the page to ensure users who login from this page get redirected back to the same page after logging out.\nThis must be added within the <form> tags, preferrably after <form method=\"POST\">:\n<input type=\"hidden\" name=\"origin\" value=\"\nurl\n\" />\nEx. \n<form method=\"POST\">\n<input type=\"hidden\" name=\"origin\" value=\"/welcome/MyFolder/?u=1\" />\nVariables\nuse \"<!--VP-->\" directive for content required to be processed by variable processor.\nTo reference the Content Management page the user logged into the instance with:\n@cmpageid@\n - returns the unique ID\nCan be used to control what content is displayed to user (such as logo) by numbering the content to match the unique ID.\nExample: logo@cmpageid@.jpg\nLogin Page - Alternate tab\nContent Management is also now possible from the overall \nLogin Screen Config page\n.\nThe Alternate tab is used to view and create multiple custom login pages for various groups of users within the same system. It uses virtual alias to mask the instance URL.\nLogin Page Name\n: name of the virtual alias login page\nDescription\n: description of the virtual alias login page\nScope Organization\n: Lookup that allows the virtual alias login page to be restricted to users in the selected organization \nVirtual Folder Name\n: user adds a name such as “grants” and then you can direct different users to appropriate logins. Example: \nhttps://smart.smartsimple.com/welcome/grants/\nWeb Alias\n: user enters the alias they want such as “gms” instead of the instances defined alias\nPersistent Cookies\n: enable or disable persistent cookies\nAttach User Identified\n:\nEncrypt URL\n: enable or disable encryption of the URL\nRedirect URL\n: enter URL if users should be redirected on successful login. \nPrimary Role\n: pick what the role is when someone logs in. It is used to force the user to see the correct portal.\nLogin Properties - Login Type\n: drop-down with 3 options (All Users; Activated Users only; No Access)\nLogin Properties - User Field\n: field on login page used to identify user when they login. Usually set to Email. \nLogin Properties - Password Field\n: field on login page used to capture user password when they login. \nLogin Properties - Login Error Message\n: message to appear on login page after failed login attempt \nLogin Properties - Login Page Content\n: how virtual alias login page will look. Use the Sample Template button to populate the content of the Rich Editor field, and then modify as necessary\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Content_management&oldid=31439\n’ \nCategory\n: \nAuthentication",
  "links": [
    "https://wiki.smartsimple.com/wiki/Login_Screen_Content#Alternate_Login_Pages"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/a/a9/Websites.PNG"
  ]
}