{
  "url": "https://wiki.smartsimple.com/wiki/Custom_Field_Language_Settings",
  "title": "Custom Field Language Settings",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nThe \nLanguage Setting\n on \nCustom Fields\n enables display of Custom Field content in different languages, based on the \nlanguage preference\n of the logged in user.\nNote: If a custom field does not have an entry for the selected language of the current user, the English language custom field settings will be applied.\nTo access the Custom Field Languages Setting page, edit any custom field and click on the \nLanguage Settings\n button, found next to the Caption option.\nThe Language Settings screen has a \nLanguage\n drop-down, with existing translations listed separated from those languages without a translation. Select the language from the drop-down to add a new translation or edit an existing translation. \nThe settings that can be translated using the \nLanguage Settings\n vary depending on the type of Custom Field being translated. \nThese can include:\n \nCaption\n: The leading question or prologue before the field \n \nTab Name\n: For fields to be displayed on a different \"Navigation\" tab. (See \nTabs (Disambiguation)\n)\n \nDefault Text\n: (\nSingle Line\n or \nMultiple Lines\n text box field types) The default text that will be displayed in the text box \n \nValues\n: (\nCombo Box\n and \nCheck Boxes\n field types) The values to be used within the combo box or check boxes, delimited by a semi-colon with no spaces.\nNote:\n It is normally vital that the \nStoreValue=DisplayValue\n syntax is used for these values. See below.\n \nValidation Message\n: The message that the user will see if the data in the field fails a validation check \n \nMaximum Message\n: (\nSingle Line\n or \nMultiple Lines\n text box field types) Message the user will see when they reach the maximum length \n \nNumber Format\n: The format in which numbers will be displayed.\n \nTool Tip\n: Help text to be shown on mouse-over\nOnce one language setting has been defined, the Language Settings screen will include it as one of the \nExisting Translations\n. \nThis facilitates the implementation of language settings for all custom fields.\nLanguage settings can also be exported from and imported to SmartSimple in \nXML\n format.\nValues\nWhen translating \nCombo Box\n or \nCheck Boxes\n custom fields it is important to use the \nStoreValue=DisplayValue\n technique to ensure that the value stored to the database is the same, regardless of what language is being displayed to the user entering the values. If this technique is not used the values stored in one language will not be correlated to other languages. This will lead to loss of data or inconsistent data.\nIf you want the value stored in a \nDropdown List field\n to be different from what is displayed in the combo box, you can use the following syntax in the \nValues\n section of the custom field settings:\nStoreValue1=DisplayValue1;StoreValue2=DisplayValue2;StoreValue3=DisplayValue3;\n The value before the equals sign, known as the \nstored value\n, will be stored.\n The value after the equals sign, known as the \ndisplay value\n, is what will be displayed in the combo box (or check boxes), but does not get saved.\nBy default, the stored value is shown when fields are referenced in \nList Views\n. Selecting the \nShow Display Value in List Views\n option in the custom field settings will display the display value.\nWhen using this technique for translating custom field values there are 2 possible approaches:\nApproach 1: Use the English value as the stored value\nValues on main custom field (English):\n--Please Select--;Yes;No\nValues in French Translation:\n--Please Select--=--Sélectionner--;Yes=Oui;No=Non\nWith this approach the stored value will always be the English text. This is normally the preferred approach.\nApproach 2: Use a different value as the stored value\nThis approach can be used to store values as a code. (Note: this approach is sometimes used even if the custom field is not being translated)\nValues on main custom field (English):\n-=--Please Select--;1=Yes;2=No\nValues in French Translation:\n-=--Sélectionner--;1=Oui;2=Non\nThis approach can also be used to store an abbreviated version of the options:\nValues on main custom field (English):\nHigh=Excellent (exceeds expectations);Medium=Okay (sufficient, but not great);Low=Poor (unacceptable)\nThe stored values in this case would be High, Medium or Low, but the combo box options displayed to the user would be the descriptive version after the \"=\".\nXML Builder Translations\nIt's important to note for an XML field how the section builder is configured. In the builder, a section separate for each language should be configured.\nUnder the Language Settings reference the section for the correlating language.\nSee Also\n \nStandard Field Language Settings\n \nLanguage Library\n \nStored value\n \nTranslation Import/Export\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Custom_Field_Language_Settings&oldid=32100\n’ \nCategories\n: \nCustom Fields\nTranslation",
  "links": [
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Personal_Settings#Additional_Personal_Settings",
    "https://wiki.smartsimple.com/wiki/Tabs_(Disambiguation)",
    "https://wiki.smartsimple.com/wiki/Combo_Box",
    "https://wiki.smartsimple.com/wiki/Check_Boxes",
    "https://wiki.smartsimple.com/wiki/Validation_Message",
    "https://wiki.smartsimple.com/wiki/Number_Format",
    "https://wiki.smartsimple.com/wiki/Tool_Tip",
    "https://wiki.smartsimple.com/wiki/Translation_Import/Export",
    "https://wiki.smartsimple.com/wiki/Combo_Box",
    "https://wiki.smartsimple.com/wiki/Check_Boxes",
    "https://wiki.smartsimple.com/wiki/List_View",
    "https://wiki.smartsimple.com/wiki/Standard_Field_Language_Settings",
    "https://wiki.smartsimple.com/wiki/Language_Library",
    "https://wiki.smartsimple.com/wiki/Stored_value",
    "https://wiki.smartsimple.com/wiki/Translation_Import/Export"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/c/cf/LanguageSettingButtonInArcadia2018.png",
    "https://wiki.smartsimple.com/images/e/e4/LanguageSettingArcadia22018.png",
    "https://wiki.smartsimple.com/images/e/e9/LanguageSettingArcadia1.png"
  ]
}