{
  "url": "https://wiki.smartsimple.com/wiki/Group_Email",
  "title": "Group Email",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nThis article will explain \nhow\n you can implement this feature for use on your SmartSimple system.\nSmartSimple provides Group Email functionality within all levels of the \nUTA\n to permit the mailing of multiple individuals associated with an entity. You can use variables to display information pertinent to the user, organization or UTA level 1, 2 or 3 in the emails. For example, display the first name of the recipient in each email. See \nVariable List\n to learn more about variables. \nEnabling Group Email\nYou must enable group email before you can use this feature. To enable group email:\n Navigate to the desired UTA.\n Click \nConfiguration Settings\n.\n Click the \nSecurity\n tab.\n Click \nVisibility Permissions\n.\n Scroll down to \nEnable Group Email\n.\n Use the \nLookup\n to choose the roles you would like to permission. \n If desired enter \nLogic\n, see \nVisibility_Condition\n to learn about constructing conditions for the Logic input.\nUsing Group Email from within individual UTA record\nTo send a group email to any contacts associated with a level one from a level one record: \n Navigate into the desired record in the UTA.\n Click the \nEdit\n button in the action bar (the record must be in edit mode to use group email).\n Click the \nContacts\n tab.\n Check one or more contacts that you would like to email.\n Click the \nGroup Email\n button (will open a modal window to guide you through the process).\n You will see the list of contacts to be emailed, click \nNext\n.\n Choose a \nTemplate\n from the dropdown.\n Add a \nSubject\n.\n If you want to save the email as an activity check \nSave as Event\n (see note below).\n Modify the body of your email as desired. \n Click \nNext\n.\n See preview of how the email will look, as well as options to add CC recipients and attachments.\n Click \nSend Message\n.\n You will get a notification that the Email was sent successfully and you may close the modal window.\nNOTE:\n When checking off \nSave As Event\n, if an Email activity has been configured in the UTA the Email will be stored against the record. If no Email activity is configured the Email activity will be saved against the contact profile of all recipients.\nUsing Group Email from UTA list view\nSend an email to contacts in a specific role, associated with a specific UTA level 1, 2 or 3 record:\n Go to the desire UTA and select the desired list view (you can use the search panel to narrow down the list of records).\n Check the desired records.\n Click the \nGroup Email\n button in the action bar (you must check a record to see the button).\n Check the Roles you want to send the email to (note if the number of users selected is 0 no one will receive an email).\n Click \nNext\n. \n Choose a \nTemplate\n.\n Enter a \nSubject\n.\n Modify the email body as desired.\n Click \nNext\n.\n See preview as well as options to add CC recipients and attachments.C\n Click \nNext\n.\n The email is sent, you can close the modal window.\nNote: Group Email from a UTA list has an option for \nUnique Recipients\n. If checked this option will only send one email to each recipient even if they are attached to multiple records. Additionally UTA level 1, 2 and 3 variables will not be processed when this option is checked.\nClick \nhere\n to learn why this feature is a benefit to your organization.\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Group_Email&oldid=31182\n’ \nCategories\n: \nEmail\nEmail Broadcast\nHow",
  "links": [
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/Variable_List",
    "https://wiki.smartsimple.com/wiki/Visibility_Condition"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/5/54/How.png",
    "https://wiki.smartsimple.com/images/4/4c/Why.jpeg"
  ]
}