{
  "url": "https://wiki.smartsimple.com/wiki/Message_Queue",
  "title": "Message Queue",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguration - Essentials\n2.1\n \nAccessing the Message Queue\n2.2\n \nUnderstanding the Message Queue\n2.3\n \nSearching the Message Queue\n2.4\n \nViewing a Message\n2.5\n \nDeleting a Message\n2.6\n \nRe-sending a Failed Message\n3\n \nConfiguration - Advanced\n3.1\n \nEnabling Permissions for the Message Queue\n3.2\n \nEnabling Failed Message Alerts\n4\n \nSee Also\nOverview\nThe \nMessage Queue \nfeature in SmartSimple allows you to view a list of system-generated emails. These emails could have been sent from a variety of sources within the system, including from \nWorkflows\n and password activations. \nThe Message Queue is particularly useful for ensuring that emails have properly been sent, for record-keeping, and for allowing you some leeway to delete messages should they have been sent in error. \nConfiguration - Essentials\nAccessing the Message Queue\n1. Click on the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nConfiguration, \nselect \nGlobal Settings\n. \n3. Scroll down on the first tab to the subheading \nSystem Log and Summary.\n4. Click on the hyperlink \nMessage Queue. \n \nEmails that have been generated from the system for a maximum of one year previous will appear in the Message Queue.\n \nNote: \nThe Message Queue may need some time to load depending on the amount of emails that will be listed. \nUnderstanding the Message Queue\nThe message queue has several tabs that provide different functions.\n \nOn the top, right underneath the \nMessage Queue \ntitle, are a number of options to determine what types of messages you can access. \nIn Queue\nAny message that is in the queue means that though it has left our SmartSimple server, it has not yet reached the inbox of the receiver. Although this limbo time is variable, it usually approximates 5 minutes or so. Messages in the queue can be deleted to ensure that they won't reach the receiver; a use case would be for a message that has been sent in error, such as an \"Application Accepted\" message. \nNote: \nAlthough the Message Queue is useful for this function, it is not best practice to rely on the Message Queue to void your mistakes. Be careful with activating or sending system-generated emails to ensure that wrongful notifications are not sent to users.\nSent\nAny message in \nSent \nhas successfully reached the \nserver \nof the receiver. Sent messages cannot be modified or deleted. \nNote: \nThe Sent list cannot confirm that it has necessarily reached an \ninbox, \nbut it can confirm that it has been sent to the server.\nThe \nSent \narea is a good section to check if you have a complaint about not receiving emails properly; the Sent list can confirm that an email was indeed sent, and in that case, the receiver should be directed to check the Spam mail in their inbox or the double-check their incoming mail. \nFailed\nThe \nFailed \nsection will list all of the system-generated emails that did not go through into another server.\nThe primary reasons for failed messages include an incorrectly typed email address, or an absentee email address. \nArchived\nThe \nArchived \nsection lists all emails that were sent \nover \na year ago from the time that you check. \nTip: \nBest practice is to check the Message Queue at least every 6 months or a year. You can ensure that emails are being properly sent out and upkeep records of email lists that IT or auditing departments may require. \nSearching the Message Queue\nThe \nMessage Queue \nuses search functionality that allows you to filter the results.\n \nThe search bar will appear on the top right above the list of messages regardless of which tab you are in. \nYou can search selectively by the available \nStandard Fields\n displayed in the Message Queue list view: \n \nFrom\n \nCC\n \nTo\n \nSubject\n \nCreated\n \nAction\nThe default is to \nSearch All Columns. \nNote: \nRemember to clear your search when you begin or if the results are not appearing as you expected - our system is sticky, meaning that the search filters from your previous session will save when you log in again. \nYou can also toggle \nSort Order\n by clicking on the label of each column. It will allow you to sort the results by ascending or descending order.\nViewing a Message\nThe Message Queue contains columns including \nSubject \nand \nBody \noptions. The \nBody \nwill display the content of the email; if it is too large to be fully exposed in the column, then it appears with an ellipsis. \nClicking into the ellipsis opens a modal window of the full email contents. \nDeleting a Message\nTo delete a message in any of the tabs, add a check mark to the desired messages to be deleted. Once one or more of the messages have been selected, a \ntrashcan icon \nwill appear at the top of the list view. Clicking on this icon will open a modal window asking you to confirm your deletion, and upon acceptance, allow you to delete the selected messages. \nRe-sending a Failed Message\nMessages that were not successfully sent will be listed in the \nFailed tab. \nTo resend a failed message, simply add a check mark to one or more of the messages while you are in the tab. This action will activate the \nRe-send button \nto appear. Clicking on the \nRe-send button \nand accepting the confirmation message that pops up will allow you to resend those previously failed messages.\nConfiguration - Advanced\nEnabling Permissions for the Message Queue\nTo enable specific permissions for the Message Queue, you - as a \nSystem Administrator\n - can select which roles in your copy of SmartSimple should have access and use of the Message Queue function. \n1. Click on the 9-square menu icon on the top right of your page.\n \n2. Under the heading \nConfiguration, \nselect \nGlobal Settings.\n3. Click onto the tab labelled \nSecurity. \n4. Under the first subheading, \nBusiness Security, \nselect the hyperlink \nSystem Feature Permissions\n. \n \n5. Under the last tab, \nFeature Permissions, \nscroll down until you find \nEnable Message Queue. \n \nClicking into the text will allow you to select from a drop-down of \nroles\n available in the system. \nClick the \nSave \nbutton when you are done permissioning the Message Queue functionality.\nEnabling Failed Message Alerts\nTo enable failed message alerts that will automatically send and periodically check the \nFailed \ntab from the Message Queue, go to \nEmail & Email Broadcast Security\n.\nSee Also\n \nAttaching a File to a Workflow Email\n \nEmail & Email Broadcast Security\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Message_Queue&oldid=36274\n’ \nCategories\n: \nCommunications\nEmail",
  "links": [
    "https://wiki.smartsimple.com/wiki/Workflows",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Sort_by",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/System_Feature_Permissions",
    "https://wiki.smartsimple.com/wiki/Email_%26_Email_Broadcast_Security",
    "https://wiki.smartsimple.com/wiki/Email_%26_Email_Broadcast_Security"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/a/af/Message_queue.png",
    "https://wiki.smartsimple.com/images/b/b9/Message_queue_1.png",
    "https://wiki.smartsimple.com/images/b/b8/Message_queue_searchj.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/5/51/Sys_feature_permissions1.png",
    "https://wiki.smartsimple.com/images/e/ee/Enable_message_queue.png"
  ]
}