{
  "url": "https://wiki.smartsimple.com/wiki/Organization_hierarchy",
  "title": "Organization hierarchy",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n1.1\n \nInter-organization Collaboration\n2\n \nConfiguration—Essentials\n2.1\n \nExample of an Organization Hierarchy\n2.2\n \nOrganization Terminology\n2.3\n \nHow to Access the Organization Hierarchy\n2.4\n \nHow To Create A New Internal Branch In The Organization Hierarchy\n2.5\n \nStandard Organization Fields\n2.6\n \nOrganization Menu Items\n2.7\n \nOrganization Ownership\n2.7.1\n \nHow to Associate Users\n3\n \nConfiguration—Advanced\n3.1\n \nMoving Users to Another Organization\n3.2\n \nMoving Organizations on the Hierarchy\n3.3\n \nSystem Summary\n3.4\n \nOrganization and User Security Matrix\n3.5\n \nOrganization Based Security\n4\n \nSee Also\nOverview\nOrganizations are hierarchically organized; each organization has a link to a single parent organization. An organization hierarchy will have an \ninternal\n hierarchy (often referred to as branches, for internal staff and affiliates) and an \nexternal\n hierarchy (for external contacts and organizations). The \nroot organization\n, which is the organization at the root of that specific SmartSimple copy, will appear on both the \ninternal\n and \nexternal\n hierarchies.\n All contacts, regardless of whether they are able to log into the system (\nusers\n), are associated with a single, specific level in either the \ninternal\n or the \nexternal\n hierarchy.\n An unlimited number of levels can be created in both the \ninternal\n or \nexternal\n hierarchies.\n \nInter-organization Collaboration\nSmartSimple is designed to support multiple organizations and their communities to collaborate together for a common goal. The system is used in markets that require high levels of inter-organization collaborations such as the following:\nVertical Market\nCollaboration\nGrants Management and Philanthropy\nCollaboration by grant makers, grant seekers, and external reviewers\nResearch Management\nCollaboration by individual researchers, research institutes, universities, and funding agencies/partners\nMedical Claims Management\nCollaboration by insurance companies, service providers, and medical specialists\nThe organization hierarchy is a helpful method to categorize, list, and display the individual actors involved in inter-organization collaboration.\nInter-organization collaboration is supported by SmartSimple in two different ways: \n Organizations share a single copy of SmartSimple. \n Organizations share information from individual, organization-specific copies of SmartSimple.\nFor more information on these techniques, see the articles on \nsecurity\n, \nrole-based access\n, \nportals\n, \ndata exchange\n and \nobject synchronization\n features. \nBut first, let's learn about the most fundamental part of any SmartSimple copy: the organization hierarchy.\nConfiguration—Essentials\n \nNote\n: You will have varying levels of access to modify or add to the organization hierarchy depending on your \nRole\n within a copy of SmartSimple. While the \nSystem Administrator\n will be able to add, delete, and edit organizations, and the respective \nowners\n of an organization may modify their own organization, a typical user role such as an \nEmployee\n or \nExternal Applicant\n might only be able to view the organization hierarchy.\nExample of an Organization Hierarchy\nOrganizations may represent a variety of entities from physical locations to organizational units. For example, you might have an \nOffice Location\n organization underneath a \nDepartment\n organization underneath a \nUniversity\n organization underneath an umbrella \nResearch Institutions\n organization. From this example, you can see how flexible organization types can be, as well as the hierarchical structure in organizing them.\n \n \nIn the above image, you can see the organization hierarchy structured as described. The \nuser\n, \nJane Doe, \nis at the bottom of the hierarchy as her job role falls within the larger organizations, with the \nWashington Office \nbeing the most specific level under which she falls. \nOrganizations and contacts are the most basic objects in SmartSimple. Organizations may store information about internal office branches as well as external clients or vendors. There are billing implications based on whether an organization is internal or external in the hierarchy - please contact your Account Manager for more information.\nNo matter which organization you are referring to, every organization is stored in the same format with certain permanent attributes that will be tracked for every organization, regardless of type. These standard attributes are referred to as \nStandard Fields\n: examples of standard fields might include the organization's name, address, and parent organization (whether it is a subsidiary of another organization) - this information is available to all organizations.\nOrganization Terminology\nThe nomenclature used to describe the \ninternal\n and \nexternal\n organizational units and people will differ depending on your \ninstance\n. For example, \nInternal \nusers can be designated as employees, while \nExternal \nusers might be applicants. The nomenclature settings are controlled by following these steps: \n1. Click the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nConfiguration, \nselect \nGlobal Settings.\n3. Go the second tab labelled \nBranding.\n4. Scroll down to the bottom of the \nBranding \nsection labelled \nGeneral Terminology.\n \nHere, you can set the terminology that you will see when you \naccess your organization hierarchy\n and more. You can set the singular and plural terms that will be used for \ninternal\n vs \nexternal\n \nUnits \n(companies/organizations using the system) and \nUsers \n(individuals that use the system). \nTranslation options for your organization terminology are also available: see \nEnable Translation Service\n. \nHow to Access the Organization Hierarchy\nTo access the organization hierarchy, click the 9-square \nmenu\n icon on the top right of your page.\n \nUnder the \nOrganizations\n category, select \nOrganization Hierarchy.\n \nThe organization hierarchy associated with the \nSmartSimple\n \ninstance\n will appear.\n \nThe first tab of your organization hierarchy lists \ninternal\n contacts, while the second tab lists \nexternal\n contacts. In the below example, the internal hierarchy is titled \nBranch\n and the external hierarchy is titled \nOrganization\n. The \norganization terminology\n is variable depending on the SmartSimple instance; however, the \nroot organization\n will always appear first on both the internal and external lists. \nHow To Create A New Internal Branch In The Organization Hierarchy\nWith every instance of SmartSimple, the root organization will already be listed underneath the internal and external hierarchies of the organization hierarchy. To add to the organization hierarchy, the same technique is always used when creating a new internal organization:\n1. Click the 9-square menu icon on the top right of your page..\n \n2. Under the \nOrganizations \nheading, select \nOrganization Hierarchy.\n3. Click the organization that you wish to be the \nparent \norganization of the organization you are creating. This organization will be \"one level up\" from your new organization. If there are no other organizations yet on your hierarchy, the \nroot organization \nwould be the parent organization. \n4. Click the \nNew \nbutton, then select \nOrganization. \n* Note: \nThe \nnomenclature\n for your SmartSimple \ninstance\n may be different. For example, \nOrganization \nmay instead be labelled Institution\n. \n5. The \nQuick Entry for Duplicate Check \nwindow is displayed. \n \nEnter a new \nOrganization Name\n. If the inputted information for your new organization matches one that exists in the SmartSimple system already, you will be prompted to either use the existing record, create a new record, merge the records, or delete the extra records.\n6. Click the \nSubmit\n button.\n7. If there are no duplicates, you will be prompted to select the \ncategory\n or categories that your new organization falls under. Click \nNext\n when you are done.\n \n \nTip: \nThe \nSystem Object \ncategory is suggested for holding entities so as to exclude it from searches and reporting. For example, it is helpful to group the \nSystem Administrators\n in your system together into one organization on the hierarchy, as they have high-levels of accessibility and functionality within the system. This \"organization\" of System Administrators would be best categorized under System Object. \n8. You will be prompted to fill in further information (\nStandard Fields\n) for your new organization. Any field with an asterisk (*) is a mandatory field; if no information is inputted into those mandatory fields, you will not be able to proceed.\n \n9. Select the \nSave\n button to add your new company.\nYou may return to your organization hierarchy in order to confirm that your new organization has been added appropriately - that it is correctly placed either on the internal or external hierarchy, and that it correctly falls under its parent organization.\n \nTip: \nExternal\n organizations can be created as structural placeholders, rather than functional organizations. For example, an external organization called \nIndividual Applicants \nwould allow individual users to register if they are working independently, or are not directly affiliated with an organization.\nStandard Organization Fields\nAs mentioned previously, each organization will have relevant information no matter where that specific organization falls in the hierarchy. This information falls under \nStandard Fields.\nThe standard fields used to describe an organization are as follows: \nStandard Organization Field\nDescription\nName\nName of account\nAddress\nStreet address for this account\nAddress 2\nIf required, second line of address (ex: apartment or suite number)\nCity\nCity address\nState/Province\nState or province address\nCountry\nCountry portion of address. You select the country from within the combo box; the default country will be the same as the user's country\nZip/Postal Code\nZip or postal code portion of address\nPhone\nAccount's primary phone number\nFax\nAccount's primary fax number\nWebsite\nIf applicable, organization's website \nURL\nNAIC Codes\nThe North American Industry Classification System (NAICS) - this field only shows up if enabled\nParent Organization\nIf this account is in an organization hierarchy, then use the name of the higher-level account\nCreated Date\nThe date that the account information was created\nCreated By\nThe owner/creator of the account\nLast Updated By\nThe name of the person that last updated the account information\nLast Modified Date\nThe date and time that the account information was last modified\nOrganization Menu Items\nA user with higher levels of access to an organization (such as an \nowner\n or a \nSystem Administrator\n) will see the following additional items on the organization's \nprofile\n page. Giving someone ownership of an organization will enable these menu items. The main menu is accessible at the top of the profile, right below the header.\nClicking each button on the main menu will open a drop-down of associated functions. Each of these functions is explained in the table below. \n Note: The \nnomenclature\n for these functions may vary in your copy of SmartSimple, as organization terminology is configurable.\n \n \nMenu Item\nOptions\nNew\nStaff \n— add a new contact to this organization\nBranch \n— add a new organization as a subsidiary of the current organization\nActivity \n— add an \nactivity\n such as a phone call, event, or meeting with this organization, without reference to the specific contact who creates the activity\nImport Branch \n— launch the Import Wizard to begin the process of \nimporting\n multiple subsidiary organization to this current organization \nImport Staff \n— launch the Import Wizard to begin the process of \nimporting\n multiple users to this current organization \nImport Activities \n— launch the Import Wizard to begin the process of importing multiple activities for this current organization\nView/Edit\nClicking on this button will change the accessibility to this current organization's details from a \nView mode \ninto an \nEdit mode\n, or vice versa. \nEdit mode \nwill then allow those with access to modify the organization's details such as their \nStandard Fields\n; the \nView mode \nonly allows a read-only viewing of the details. \nOptions\nHistory - Reader Log \n— The reader log opens up a modal window displaying all the recent users who have accessed this organization's profile. It will provide the name of the user, their start and end time on the profile, as well as whether they were accessing the profile from \nView \nor \nEdit mode. \nProperties - Categories \n— This allows an owner or System Administrator to modify the category that the organization falls under. Pressing \nSave \nwill enforce these category changes. \nSettings - \nPassword Policy\n \n— This opens up a modal window that allows an owner or System Administrator to modify the rules and restrictions for their users' passwords. For example, some password settings include the length of characters, the complexity of passwords (alphanumerical combinations, capitalization enforced etc), a set time for password expiration, and more. \nYou are also able to\n disable inactive accounts \n change Activation Settings including the life-span for an activation link, a default security code, and security challenge questions \n set a password reset message\nSettings - Regional Settings \n— This allows you to alter regional settings including the following: \n Language\n Input Date Format\n Display Short Date Format\n Display Long Date Format\n Display Time Format\n Time Zone\n Home Currency\n Numeric Decimal Separator\n Numeric Thousands Separator\nTo enforce the change in regional settings, toggle on the \nEnforce Settings \nbutton next to each setting and press \nSave \nwhen you are done. \nTools - Duplicate Check \n— The duplicate check allows you to see if there are any duplicates already in the system for this organization. \nTools - Pinboard \n— This feature is deprecated, but please see \nUsing the Pin Board\n if your SmartSimple copy still uses this function.\nOn the left side of the organization profile, you will see an additional menu that will allow you to display other details related to the organization. \n \n \n \nNote: \nThe tabs on this menu will vary depending on the organization. In this example, the tabs such as \nUS Census, Calls, \nand \nEligibility \nwill display the records of \napplications\n that have been configured specifically for the organization's needs. The other tabs will remain constant no matter what the organization is. \nMenu Item\nDescription\nMain\nThis will display the main profile details of the organization, including its main address and contact information.\nNotes\nThis will allow you to annotate records with comments, instructions, and other notes. Notes are available both in View and Edit mode. They are timestamped and associated with the user who created them. They can be edited, expanded, or hidden. \nActivity List\nThis will display all activity records for the current organization. \nSub-Branch\nThis will display a list of all sub-branches (subsidiary organizations) for the current organization. This means that the current organization is the parent company of all the sub-branch organizations, and will appear one level above them in the organization hierarchy. \nOrganizations\nAs this is the side menu of \na root organization\n, this tab appears to display all the \nExternal\n organizations related to the current organization. \nContacts\nThis will display all the contacts that fall under the current organization.\nAssociates\nThis will display all the associated contacts to this current organization. You can learn \nhow to associate users\n with an organization. \nOrganization Ownership\nIf you intend to assign specific \ninternal\n staff to manage an organization, you will need to assign the appropriate owner to each organization.\nEach sub-account (division, branch, business unit, etc) in the same organization can have a different owner.\n \nNote: \nThe owner standard field may appear labelled \nPrimary Contact. \nIf you need to assign multiple \ninternal\n staff to work with an organization, you can use the \nassociations\n feature to associate multiple internal contacts with a single account. \nHow to Associate Users\nAssociations must be enabled through \nGlobal Settings\n before you can associate multiple internal contacts with a single organization account. \n1. Click the 9-square menu icon on the top right of your screen.\n \n \n2. Under the \nConfiguration \nheading, select \nGlobal Settings. \n3. Under the \nAssociations \ntab, toggle on \nEnable Associations - \nEnable Associations feature between companies and users. \nAfter Associations have been enabled, return to the main menu and under the \nOrganizations \nheading, select \nOrganization Hierarchy.\n1. Select the organization that you want to associate a contact with. \nThe organization's details will be displayed.\n2. The side menu will have a tab called \nAssociates. \nSelect that tab. \n \n \n3. If any contacts are already associated with that organization, they will be listed on this page. To add a new contact as an association, ensure that you are in \nEdit \nmode. The top menu will say \nEdit \n(between \nNew \nand \nOptions\n) if you are correctly in Edit mode. \n4. In the \nLookup bar, \nselect the contact that you would like to associate. You can press the \nBinoculars icon \nto open up a list of all available users. \n5. Next, select the \nRole \nof the associated contact.\n \n \nIn this example, the associated contact, Adrienne, is a \nDonor \nfor this organization. When the associated contact is added, their information - such as email and address - will be displayed. They will also have their \nmain \norganization listed under the Organization heading. Adrienne's main organization is \nExternal Reviewers. \nRepeat this process if you would like to add more associated contacts.\nConfiguration—Advanced\nMoving Users to Another Organization\nIn order to move users to another organization so that they fall at a different level in the organization hierarchy (or to simply have them in the resources of another equal-level company), you must enable the \nParent Organization \nStandard Field\n and update the field to the new organization. \n1. Click on the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nConfiguration, \nselect \nGlobal Settings.\n3. Under the \nUser \ntab, select the hyperlink \nStandard Fields.\n4. Make sure that the \nParent Organization \nstandard field is enabled. \nAfter enabling the Parent Organization standard field, when you are in \nEdit Mode\n \non a user's profile, you can update their parent organization to move them to another organization.\nMoving Organizations on the Hierarchy\nTo move \norganizations \nunder a different \nParent Organization, \nthe same process is repeated as the above section, but using the \nOrganization \ntab > \nStandard Fields \nunder \nGlobal Settings. \nSystem Summary\nThe system provides a number of ways of accessing information on the configuration details for an [wiki/Instance instance] of [wiki/SmartSimple SmartSimple]. For more information, see our \nSystem Summary\n page.\nOrganization and User Security Matrix\nUsing the SmartSimple security matrix, you are able to permission features to ensure that your system has the security you need. You can also permission \nroles\n to access certain functionalities, or deny them use of parts of the system. To learn how to configure and use the security matrix as a \nSystem Administrator\n, see our \nCompany and User Security Matrix\n page.\n You are also able to enable the security matrix for individual s - see \nUTA Settings - Security\n for more information.\nOrganization Based Security\nOrganization security is based on the user's organization in the overall hierarchy.\n You permission an organization to access a resource, and everyone in that organization will be able to access that resource.\n When you add new people to that organization, they will also automatically gain access to the resource.\nAdvantages\n:\n When you create a user in an organization, you will not have to take the extra step to set any specific permission for the user to access a resource. The user will instead have \"inherited\" access by being associated with that organization.\nNote\n:\n Organization security does not allow you to give individual users from different organization access to the resource.\n You must associate each organization with the resource; giving multiple organizations access must mean repeating the process.\n If you \"move\" the user to another organization, they will automatically lose access to resources associated with their previous organization.\nSee Also\n \nCompany and User Security Matrix\n \nSystem Summary\n \nUser\n \nFilter Owner Based on Branch\n \nStandard Fields\n \nCustom Fields\n \nUniversal Tracking Application\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Organization_hierarchy&oldid=39288\n’ \nCategories\n: \nSystem Management\nGlossary",
  "links": [
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/The_Root_Company",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Getting_Started_with_the_Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Portals",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Organization_hierarchy#Organization_Ownership",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Organization_hierarchy#How_to_Access_the_Organization_Hierarchy",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Enable_Translation_Service",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Organization_Terminology",
    "https://wiki.smartsimple.com/wiki/The_Root_Company",
    "https://wiki.smartsimple.com/wiki/Organization_Terminology",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Client_Categories",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/URL",
    "https://wiki.smartsimple.com/wiki/Organization_hierarchy#Organization_Ownership",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/Organization_Terminology",
    "https://wiki.smartsimple.com/wiki/Event_Types",
    "https://wiki.smartsimple.com/wiki/Importing_Organisation_Records#Importing_Organization_Records",
    "https://wiki.smartsimple.com/wiki/Importing_Organisation_Records#Importing_User_Data",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Password_Policy",
    "https://wiki.smartsimple.com/wiki/Using_the_Pin_Board",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Notes_Overview",
    "https://wiki.smartsimple.com/wiki/The_Root_Company",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Association_Settings",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/Associations",
    "https://wiki.smartsimple.com/wiki/Standard_Field",
    "https://wiki.smartsimple.com/wiki/Edit_Mode",
    "https://wiki.smartsimple.com/wiki/System_Summary",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Company_and_User_Security_Matrix",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_-_Security",
    "https://wiki.smartsimple.com/wiki/Company_and_User_Security_Matrix",
    "https://wiki.smartsimple.com/wiki/System_Summary",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Filter_Owner_Based_on_Branch",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/d/db/Uta-diagram-800w-Organization.jpg",
    "https://wiki.smartsimple.com/images/2/28/ExampleofOrgHierarchy.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/a/a9/General_terminology.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/e/e6/052919_EF_OrgHierarchy.png",
    "https://wiki.smartsimple.com/images/0/06/052919_EF_Root.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/b/b9/Organization_duplicate_check.png",
    "https://wiki.smartsimple.com/images/3/34/Step_2_of_org.png",
    "https://wiki.smartsimple.com/images/3/34/Step_3_of_org.png",
    "https://wiki.smartsimple.com/images/b/b6/Organization_menu.png",
    "https://wiki.smartsimple.com/images/1/1d/Organization_side_menu.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/6/6d/Associatestab.png",
    "https://wiki.smartsimple.com/images/8/8c/Associated_contact.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png"
  ]
}