{
  "url": "https://wiki.smartsimple.com/wiki/Portals#Shortcuts",
  "title": "Portals",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n1.1\n \nExample of a Portal\n2\n \nPortal Building – Essentials\n2.1\n \nUser Roles\n2.2\n \nThe Plan\n2.3\n \nCommon Aggregated Portal vs Single Role Portals\n2.3.1\n \nCommon Aggregated Portal\n2.3.2\n \nSingle Role Portal\n2.4\n \nStructure of the Portal\n2.4.1\n \nLogo\n2.4.2\n \nUser Menu\n2.4.3\n \nMain Menu\n2.4.4\n \nThe Body of the Portal\n2.4.5\n \nChoosing a layout\n2.5\n \nCreating a Page\n2.6\n \nCreating a Section\n2.6.1\n \nCreating Sections From Layout\n2.6.2\n \nCreating Sections From Template\n2.6.3\n \nPreviewing a Section Theme\n2.6.3.1\n \nTraditional Theme\n2.6.3.2\n \nWhitepaper Theme\n2.6.3.3\n \nWebsite Theme\n2.6.3.4\n \nOverlook Theme\n2.6.3.5\n \nPortfolio Theme\n2.6.3.6\n \nManagement Theme\n2.6.4\n \nSection Settings\n2.6.4.1\n \nGeneral tab\n2.6.4.2\n \nDisplay tab\n2.6.4.3\n \nPermission Tab\n2.6.4.4\n \nSection Order\n2.6.4.5\n \nMoving a Section\n2.6.5\n \nPortal Page Section Types\n2.6.5.1\n \nChart\n2.6.5.2\n \nCustom Link\n2.6.5.3\n \nList View\n2.6.5.4\n \nList View - Mixed Record Type\n2.6.5.5\n \nMedia Files\n2.6.5.6\n \nSection Container\n2.6.5.7\n \nSection in Tabs\n2.6.5.8\n \nShortcuts\n2.6.5.9\n \nText Template\n3\n \nPortal Building – Advanced\n3.1\n \nPreviewing a portal\n3.2\n \nTesting a portal\n3.3\n \nMaking changes to a live system\nOverview\nA \nPortal \nis the SmartSimple terminology for the graphical user interface that a \nuser\n sees upon login. The \nPortal \ninterface for each user is dependent on the \nuser role\n and how that role has been configured by the \nGlobal Administrator\n. This article will give you an overview of how to configure your portals for your users with the portal builder. We will explore what options are available when creating a portal and provide guidance on how best to utilize these options. \nExample of a Portal\nOnce a user has been \nactivated\n, they will be able to log into your SmartSimple instance. \n \n \nAll the elements of a user's portal - such as the Main Menu links are displayed on the top header, what graphics or texts are displayed on each page, the user's personal menu items and more - are all highly configurable.\nPortal Building – Essentials\nUser Roles\nUser roles\n organize or group similar users together and, in conjunction with permissions and other logic, control what people can see and do in SmartSimple.\n User Roles\n group like people together and are additive, meaning that a user may possess multiple roles, so roles need not be mutually exclusive. Typically, we group users on what they will be doing. Example: applicants, reviewers, and approvers, and by department: accounting, sales, partners.\nBefore you can build a portal, you need to define user roles in your system. You can define new user roles by going to the \nMenu Icon\n > \nRoles and Security\n > \nUser Roles\n.\nPlease note we take a most restrictive approach when it comes to permissions, so if you set one role to deny something, it will supersede all other permissions. This means if a user has 3 roles, and 2 roles have permission to do something but the third role does not, the user will not be able to do that action. So as a general practice it is better to add permission then to deny permission on a role. This way, the more roles you have, the more you can see and do in the system.\nThe Plan\nBefore you start building a portal, plan out what each user will need to see and do in their portal.\nLet’s use a grant applicant as an example. The grant applicant will likely need to be able to:\n See what funding programs are available and apply to those.\n See the status of their applications in progress and modify them.\n Update their profile and/or their organization's profile.\n See a list of items that require their immediate attention, such as submitting a report or revising an application.\nWe can use the above to generate simple use cases for our sample grant applicant portal.\nNow that we have \nUser Roles\n and we know what our users are going to do in the system, we can decide where we are going to create the portal.\nCommon Aggregated Portal vs Single Role Portals\nThere are two ways in which you can create a portal. You can create the portal on the Common role which is aggregated, meaning assets are shared across multiple roles, or you can create a portal on a single role. If you take this path, assets will not be shared and users will need to flip between roles.\nCommon Aggregated Portal\nCreating a portal on the common aggregate role is recommended. This role is not the same as all other roles, as you did not need to create it. The common role is a construct that automatically appears in all SmartSimple system. Anything you add to the common role can be permissioned to be seen by all or some of the roles you have created in your system.\nTo use this option, build your portal on the common role. When you create an asset such as a section inside the common role portal, you can permission that asset to be viewable by specific roles. This way you can build an asset like a help link and share it amongst all user roles. If you need to change the help link, you change it in one place and all users will see that change. If a user has multiple roles, they will be able to see and do whatever all their roles have permission to do. Lastly, creating assets on the common role means users do not need to switch between portals using a drop down in the header, as they can always see whatever they have permission to see and do.\nSingle Role Portal\nThis portal configuration is generally not recommended. With this option, you create a portal on each role. So, the applicant portal is built on the applicant role and the reviewer portal is built on the reviewer role. The drawback to this approach is that if you need to create a help link, you need to build it on each role. If you want to change the link you must go into each role to change it. If users have multiple roles, there is a drop down in the header that allows the user to switch between applicant and reviewer portals, but you only see one portal at a time and don’t have access to all the functionality that has been permissioned for you at one time. Although it is easy to understand and configure one portal per role, it is generally harder to maintain and provides a worse user experience, given people may have multiple roles (example I am an employee and grant manager).\nStructure of the Portal\nThe portal header consists of 3 elements: the Logo, the user menu and the main menu.\n \nElements of the header\nLogo\nBy default, your system logo will appear in the top left of the header. This logo should be 112 pixels high by approximately 250 pixels wide in PNG format. The width of the logo can vary but the height is constant. Transparent background is recommended for your logo in case you want to have a colored background on your header. Optionally, you can choose to display an alternate logo by uploading a different logo into a SmartFolder and then choose the SmartFolder option. You can also specify a different logo from a SmartFolder for each language you support. For example, users who speak Spanish can see a different logo than users who speak English.\nUser Menu\nThe user menu appears on the far right and will display your initials, name or photo. The user menu is intended to hold links that pertain to the user, such as updating the user’s profile, the user’s organization, and possibly switching the user’s language.\nIf you create a link here, try to keep the caption to a word or two, like “Edit Profile” or “My Profile”.\nLink Type\nDescription\nOrganization Profile\nThis link type takes the user to their organization profile. By default, if you have permission to edit the profile you will be taken directly into edit mode. You can toggle off this setting if you want to bring everyone to the profile in view mode.\nCustom\nThis link type can take the user to any page within your system, for example, to go to the dashboards, enter “/iface/dashboard.jsp”. Note, always use relative URLs to ensure links work across servers and to ensure your system functions as expected.\nDrop Down\nNot recommended. This legacy setting was used with the default header and it enabled you to add a drop-down menu in the user menu.\nLanguage\nUse this link type to surface a language drop down on your portal. The user will be able to switch their portal into any language you have enabled. Note, if you choose to support multiple languages, you must also enter translations for your content into the system. For example, you will need to specify the translation for every menu link and section you have added to your portal. You can do this via a language drop down where you configured those assets. In other areas of the system, such as on custom field configuration pages, you will also need to provide a translation for every caption.\nChange Password\nThis link type takes the user to the change password screen.\nSmartFolder\nThis link type is used to surface a SmartFolder in your portal. For example, if you had resources in a SmartFolder such as help documentation, you could add this link to your user menu and the user could go direct to that SmartFolder and open it in the current window, a modal window or a new window.\nUser Profile\nThis link type takes the user to their personal profile. By default, if you have permission to edit the profile you will be taken directly into edit mode. You can toggle off this setting if you want to bring everyone to their profile in view mode.\nMain Menu\nThe main menu will appear in line with the user menu. You can have three types of content in the main menu. A single page, sections, and subtabs, which are a drop-down menu of links. Essentially you will have a combination of links and drop-down links. Each link will take the user to a location. The main menu is intended to hold links to UTAs or other specific areas of the system.\nNote: keep in mind the only links that should be in the main menu are the most important links that need to be present all the time. If something does not need to be always visible you may want to make it a shortcut instead. If you do create main menu links, keep the amount of links around 5 or less for usability. More links increase cognitive strain on users so always try to keep portals simple. Also, try to keep the captions of these links to 1 or 2 words.\n \nTwo types of main menu links the page and section or the sub tab\nThe Body of the Portal\nInside the body of the portal, a page will be displayed. The user clicks a link in the main menu or user menu to change which page is displayed in the body of the portal. The user can also navigate to other pages from inside the page. Inside that page, you will likely have sections. Think of each section as a box or container. Inside each section, you will add content such as a list view, chart, text or shortcuts.\n \nBody of portal and a sample text section\nChoosing a layout\nIf your main menu or user menu link does not take you to an existing page in the system, then you can create a page by selecting the content type called sections.\nYou can add a section with the plus button or use the “Add layout” button to create a layout which is an arrangement of sections.\nWe recommend creating sections in single column as they will render best on all screen sizes and this provides a better experience for people using assistive technology.\nCreating a Page\nEvery portal is a collection of pages. To create a page for your portal, follow these steps:\n Navigate to \nGlobal Settings\n > \nUsers\n tab > \nPortals\n and edit the desired portal. Alternatively, you can also reach edit a portal by going to \nMenu Icon\n > \nRoles and Security\n > \nUser Roles\n and editing a role with an activated portal. \n Under the \nPortal Page\n title bar, click the plus button to add a portal page. Give your page a \nName\n and \nCaption\n.\n If you don't want to display this new page in the top header, toggle off the setting \nDisplay As Header Link\n. You can still reference this page in a shortcut link, but it will no longer appear in the header.\n \nPortal pages can be displayed or hidden in the header with the \nDisplay As Header Link\n toggle\nCreating a Section\nTo add sections to the page, set the \nContent Type\n to \nSections. \nThis will reveal theming options. Themes can be used to specify a certain look and feel for the portal page. Certain classic themes (such as \nTraditional\n or \nWhitepaper\n) do not come with pre-made section templates. However, newer themes (such as \nWebsite, Overlook, Portfolio\n, and \nManagement\n) come with additional pre-made section templates that make it easy to customize a page to be a landing page, dashboard, profile, or event page.\n \nList of available page themes\nOnce a theme has been chosen, you can continue to add sections to your page in one of three ways:\n Manually add sections to your page\n Add sections from a layout picker\n Add sections from a template picker\nCreating Sections From Layout\nA layout picker allows you to designate certain areas of the page for different purposes. To create sections from the layout picker:\n Click on the button pictured below labelled \nCreate Sections from Layout\n. \n \nButton for \nCreate Sections from Layout\n This will surface the layout picker where you can choose how to arrange the various sections on the page. Click the desired layout.\n \nVisual layout picker\n Follow the prompts for each new subsection until you have completed all sections.\nCreating Sections From Template\nYou can also create sections from templates that already have the section types defined.\nNote:\n The \nTraditional\n and \nWhitepaper\n themes do not come with pre-defined templates.\n Click on the button pictured below labelled \nCreate Sections from Template\n. \n \nButton for \nCreate Sections from Template\n This will surface the template picker where you can choose what kind of sections you want on the page. Click the desired template.\n The page will refresh and you will see the predefined sections under the \nSections\n title bar. Click each section to customize them to your needs.\nPreviewing a Section Theme\nTo change the theme for a section or simply preview a theme:\n Go to the \nMain Menu\n or \nUser Menu\n link with the content type set to \nSections\n.\n Choose the desired theme from the drop-down.\n Click \nSave\n.\n Go to the root of the portal using the hierarchical navigation.\n Click the \nPreview\n button.\nYou can try out different themes for each page this way.\nNote:\n the functionality and configuration options differ for each theme. For example, in the \nTraditional\n theme you can render a section in split screen whereas that is not available in the \nWhitepaper\n or \nWebsite\n themes.\nTraditional Theme\nThe \nTraditional\n theme has boxes around each section. This theme enables you to fit more content inside a smaller area. Typically, this theme is used for people who are managing many tasks and who need to see a lot of information.\n \nSample home page in the \nTraditional\n theme\nNote:\n in the shortcut section I have toggled off margin and shadow for the shortcut section. This setting is found on the display tab of that section.\nWhitepaper Theme\nThe \nWhitepaper\n theme has no boxes. Everything is clean and white with extra padding, content is bigger for better visibility and text is aligned center. Typically, this theme is used for people who are doing a few simple tasks or by those who like a more modern look.\n \nSample home page in the \nWhitepaper\n theme\nWebsite Theme\nThe \nWebsite\n theme was designed with imagery in mind. This theme looks more like a website with graphical banners and image shortcuts. Typically, this theme is used for people like applicants or volunteers, and when you want to convey a brand feeling or tone. Learn \nhow to create a website themed portal page\n \nSample home page in the \nWebsite\n theme\nNote:\n to create the top banner, I used a section container and uploaded a background image and set the background opacity to Low and changed the font color to white. These controls are found on the display tab of this section. Inside the sub section I created a text template and set its width to 65% so the text does not cover the image at most resolutions.\nOverlook Theme\nThe \nOverlook\n theme displays a layout well-suited for dashboards and multiple columns that span the whole width of the page.\n \nSample home page with the \nOverlook\n theme\nPortfolio Theme\nThe \nPortfolio\n theme displays a user-centric layout with a constrained width that includes a new banner.\n \nSample home page with the \nPortfolio\n theme\nManagement Theme\nThe \nManagement\n theme comes with a constrained width and is suited for multiple column layouts with rounded corners and no drop shadows.\n \nSample home page with the \nManagement\n theme\nSection Settings\nGeneral tab\nSetting\nDescription\nName\nused for reference not displayed to end user\nType\ndefine what kind of section this is \nTitle\nwill display in the section\nIcon\nwill display beside the title\nDescription\nused for reference not displayed to end user\nInstruction\nused for adding text under the title\nDisplay tab\nSetting\nDescription\nWidth\nUsed to control the width of a section. Generally, avoid using this setting as single column is preferred for usability and accessibility reasons. Keep in mind if you set a width it may look good on your screen but it will look poor for users with different screen sizes. We recommend you leave this setting empty so the section will render full screen. If you must add a width then use percentage so it will scale.\nHeight\nUsed to control the height of a section. Generally, avoid using this setting as well. Different users will have different screen resolutions so what looks good for you won’t necessarily look good for them. By default, the height of a section will be large enough to hold whatever content is inside. If you use this setting your content may cut off and you may get a scroll bar inside your section. If you must use this setting then enter a pixel value but generally leave it empty.\nShadow\nTurn off the shadow\nMargin\nTurn off the margin\nBackground color\nControl the background color of the section.\nPermission Tab\nIf you are creating a section on the common role (recommended) you will see the permission tab. On this tab you specify which roles will see this section.\nSection Order\nThe order in which menu items appear is from left to right. You can reorder the sections by clicking the enable reorder button. Then, drag and drop rows to order your items as you desire.\nMoving a Section\nAfter you have created a section you can move it to another location within your portal by using the move button in the submit bar.\nPortal Page Section Types\nOnce you have created a main menu link and set it to sections, you have a number of section options. Below is an overview of each section option.\nChart\nCreate interactive charts directly from a list view with this section type. This section type gives you the ability to see charts and data tables and it enables the user to drill down into the data for a more granular view. For example, you could see grants aggregated by status and then flip the chart into table view to go directly to a specific grant. The user can also download charts in PNG, JPG, PDF, and SVG format.\n \nList view chart Bar style in a section\n \nList view chart Horizontal bar style in a section\n \nList view chart Pie style in a section\n \nList view chart Table style in a section\nTo set up a chart section:\n Create a list view with the information you want to chart. If you are only going to use this list view with charts, check configuration only on the list view and it will not show up in the regular list view drop down to users.\n In the desired section, choose the type called “Chart”.\n Choose the desired list view and/or filter.\n If you want the user to be able to switch between the chart and the underlying table, enable view options. If you have enabled view options, you can also enable the search panel when in the table view.\n Pick the chart type; for example pie or bar.\n Pick the fields you want to map to the X and Y axis and enter desired captions.\n Choose the aggregation type; for example sum or count.\n Save\nCustom Link\nThe custom link enables you to create a link to any area within the system. Use the lookup button to choose an area in the system you want to link to and it will populate the URL field. You can also manually enter a URL to other areas of the system, but if you do so make sure you use a relative path. For security reasons, we don’t allow linking to pages outside your system.\nList View\nThe list view section type enables you to surface a list view from another area of the system. For example, show a list of applications in progress or a list of open calls to which the applicant can apply from a UTA. You could also show a list or organizations or users. To setup, select the desired list view and optionally select the desired filter and save.\nShow New Button\n: this option enables the user to create a new record from your list view. For example, if I am looking at a list of level 1 applications, you can allow the user to create a new level 1 application from this section.\nShow Search Panel\n: this option allows you to surface search functionality on your list view within the portal.\n \nList view with new button and search\nList View - Mixed Record Type\nThe list view mixed record section type enables you to create a list view composed of different record types. Generally used to create a single task list of all your to-dos, without the clutter and effort of creating each individual list as its own section in your portal. To setup:\n Select a list view and click the + button.\n Repeat for each list view you want in your mixed record type section (example UTA, User, Organization) note: list views must have a filter.\n Select the number of columns desired (if you have enabled default buttons they will appear in the first column) .\n Give your columns a caption for each header.\n Choose a column to sort by.\n Click Save.\nNote: the intent of this section type is to display a list of records from multiple areas and give users an easy way to go to a record so they can edit it. You are also expected to make sure the list views you choose have the same number of columns with the same type of information in the same columns. For example, if I combine 3 list views the first column in all of them should hold something like the name or title of the object.\nRow Clickable\n: this option enables the user to be able to open the record by clicking anywhere on the row. If this option is toggled on you do not have to surface an open button on the row.\nShow Search Panel\n: this option surfaces a search input so the user can refine what appears in their list view.\n \nMixed record type section showing a list of users organizations and grants in the same section\nMedia Files\nThe media files section type enables you to surface media uploaded to applications inside a portal section. For example, you could display all the artwork submitted as part of the application process for applications that were approved.\nOptionally, you can filter media that is displayed by media type (video, audio, images) and by status of the record and type of the record.\n \nMedia section type\nSection Container\nThe section container type is different than the other section types as it is used to control the layout of sections. Typically, the section container is used to hold another section. For example, in the website theme, you might use a section container to display a background image across the full width of the page. Then you might place a text section inside this container and restrict its width to 70% of the page. This would give you a banner with an image background and text overlaying that image, but the text would be constrained, so the user could see more of the background image.\n \nSection container with a text type section inside\nSection in Tabs\nThis section type is used to display multiple sections within a single section. For example, you could have a section called applications and then within that section, you could have a number of tabs such as Applications in progress, applications in review and applications funded. The user can click on any tab to see the corresponding list view. Optionally you can choose to show the record count for each tab as well as choose to have a new button and a search panel.\n \nSection in tabs\nShortcuts\nIf you have configured shortcuts on the shortcuts tab of the common (or your desired) role, this section type enables you to surface those shortcuts in a section. Shortcuts come in 4 styles (Icon, aggregate, Image and text) and they generally link to an area of the system such as a list view.\nYou can select which shortcuts you want to appear in which section via a lookup. This way you can have multiple shortcut sections with differing shortcuts in each. If you do not select any shortcuts, all shortcuts you have permission to see will display.\nWe recommend only putting one style of shortcut in each section, example have a section of only image shortcuts or only icon shortcuts. Mixing and matching of shortcut styles should generally be avoided.\n \nIcon, aggregate and text style shortcuts as they appear in the Default theme. Mixing and matching of shortcut styles in a single section should generally be avoided.\n \nIcon, aggregate and text style shortcuts as they appear in the White Paper theme. Mixing and matching of shortcut styles in a single section should generally be avoided.\n \nIcon, aggregate and text style shortcuts as they appear in the Website theme. Mixing and matching of shortcut styles in a single section should generally be avoided.\n \nImage style shortcut as it appears in the three themes. Mixing and matching of shortcut styles in a single section should generally be avoided.\nText Template\nThe text template section is used to display text-based information such as a notice, instructions or a welcome message.\nPortal Building – Advanced\nPreviewing a portal\nWhile building a portal you can preview your work from inside the portal builder. To do so:\n Click on the root of the portal in the hierarchical navigation\n Scroll down and click the preview button\n If you are in the common role (recommended) you can choose with which user roles you want to preview the portal.\n Click the refresh button to see the portal using the roles you checked.\nTesting a portal\nAlthough preview is a good and quick way to see how your changes are affecting your portal, you still need to test with an actual user. Always setup an actual test user the same way you will set up real users and test the portal using that user as well. When testing you may want to use the Chrome browser with incognito mode to ensure you don’t get any session bleed from your administrator account. If anything seems to behave in an unexpected way, close your browser, and clear your browser cache and then try again. You can clear your browser cache by CTRL + SHFT + Delete.\nMaking changes to a live system\nWhenever you make a change in the portal builder, it is instantly pushed live to all the users of your system. If your system is already live, you are going to want to configure and test without pushing those changes live. To do this, enable draft mode. In draft mode, you can make a copy of your existing portal, change it as you see fit, test it and then promote the draft version to live when you are ready.\nTo enable draft mode and deploy to live:\n Go to Menu icon > Roles and Security > user Roles > and edit the desired role (preferable the common role)\n If you do not see draft portal in the left navigation, click the Arcadia Portal Draft Mode button in the action bar\n Click refresh button; this replaces anything in your draft portal with a copy of whatever is currently configured in the live portal\n Save and make any changes you desire.\n Preview like you normally do. When you are ready to make the draft portal live, click deploy in the submit bar.\n The draft portal is now active and the active portal is now draft\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Portals&oldid=40656\n’ \nCategory\n: \nInterface",
  "links": [
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/User#Activating_a_User",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/How_to_create_a_website_themed_portal_page"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/f/fe/My_CSR_portal.png",
    "https://wiki.smartsimple.com/images/e/e0/Portal-compact.png",
    "https://wiki.smartsimple.com/images/0/0b/Portal-link-subtab.png",
    "https://wiki.smartsimple.com/images/b/ba/Portal-section.png",
    "https://wiki.smartsimple.com/images/3/32/2021-07-ticket-125978-2.png",
    "https://wiki.smartsimple.com/images/5/5c/Portal-themes.png",
    "https://wiki.smartsimple.com/images/5/5c/Sections-from-layout.png",
    "https://wiki.smartsimple.com/images/a/ad/Layout_Picker_3_lightbox.png",
    "https://wiki.smartsimple.com/images/e/ef/Portal-sections-from-template.png",
    "https://wiki.smartsimple.com/images/3/32/Portal-default-theme-home.png",
    "https://wiki.smartsimple.com/images/a/a1/Portal-default-white-paper-home.png",
    "https://wiki.smartsimple.com/images/5/57/Portal-website-home.png",
    "https://wiki.smartsimple.com/images/2/22/Portal-overlook-theme-home.jpg",
    "https://wiki.smartsimple.com/images/a/ac/Portal-portfolio-theme-home.jpg",
    "https://wiki.smartsimple.com/images/0/0b/Portal-management-theme-home.jpg",
    "https://wiki.smartsimple.com/images/a/a9/Portal-chart-options-bar.png",
    "https://wiki.smartsimple.com/images/1/1f/Portal-chart-options-bar-hor.png",
    "https://wiki.smartsimple.com/images/4/49/Portal-chart-options-pie.png",
    "https://wiki.smartsimple.com/images/f/f0/Portal-chart-options-table.png",
    "https://wiki.smartsimple.com/images/b/b7/Portal-new-and-search.png",
    "https://wiki.smartsimple.com/images/d/d4/Portal-mixed-record.png",
    "https://wiki.smartsimple.com/images/3/38/Portal-media.png",
    "https://wiki.smartsimple.com/images/a/aa/Portal-section-contain.png",
    "https://wiki.smartsimple.com/images/9/99/Portal-section-tabs.png",
    "https://wiki.smartsimple.com/images/f/fd/Portal-shortcuts-default.png",
    "https://wiki.smartsimple.com/images/2/2c/Poral-shortcuts-whitepaper.png",
    "https://wiki.smartsimple.com/images/9/95/Portal-shortcuts-website.png",
    "https://wiki.smartsimple.com/images/a/ae/Portal-image-shortcuts.png"
  ]
}