{
  "url": "https://wiki.smartsimple.com/wiki/Authenticated_Servers",
  "title": "Primary Authentication Controller",
  "content": "From SmartWiki\n(Redirected from \nAuthenticated Servers\n)\n Jump to: \nnavigation\n, \nsearch\nThe \nPrimary Authentication Controller\n feature allows one instance of \nSmartSimple\n to authenticate users to gain access to a separate instance without having to log in separately (Single Sign-On).\nNote:\n this is only relevant to clients that use multiple instances of \nSmartSimple\n.\n The instances can reside on the same server, or on separate servers.\n This access can be granted to all users, or limited to a subset of users.\nContents\n1\n \nConfiguration\n1.1\n \nAuthentication Member\n1.2\n \nPrimary Authentication Controller\n2\n \nEnabled Users Options\n2.1\n \nAll Users to All Users\n2.2\n \nNamed User to Named User\n2.3\n \nAll Users to One User\n3\n \nAuditing\n4\n \nAccessing the Member Servers\n5\n \nNotes\nConfiguration\nAuthentication Member\nBefore configuring the \nPrimary Authentication Controller\n (PAC) instance you must enable \nAuthentication Member\n on the target instance and generate the key that will be used by the \nPrimary Authentication\n instance to gain access.\n On \nGlobal Settings\n within the \nIntegrations\n tab select the check box to enable the instance as an \nAuthentication Member\n.\n Save the page and the \nAuthentication Member Configurations\n link will appear.\n Within the \nAuthentication Member Configurations\n page click New. Complete the details as required:\nSetting\nDescription\nName\nEnter any name you wish.\nDescription\nEnter desired description.\nAlias\nThe \nAlias\n of the instance that will act as the \nPrimary Authentication Controller\n.\nSecurity key\nThis will be populated once the settings are saved. This key must be entered in the configuration of the \nPrimary Authentication Controller\n instance.\nAllow all users\nEnable this setting if all login-enabled accounts within this \nAuthentication Member\n instance should be allowed authenticate and connect via the Primary Authentication Controller.\nEnabled Users\nIf \nAllow all users\n is not enabled this allows you to select individual user(s) that can use the Primary Authentication Controller to authenticate for this instance.\nCreate users - if not found create them automatically\nEnable this setting to enable automatic creation of a new account within this instance if someone with an account on the Primary Authentication Controller attempts to connect.\nNote:\n this settings attempts to match the e-mail address to uses that are \nalready\n login enabled only. If an account with the same e-mail address already exists on the Member instance, but is NOT login enabled a new user will be created when they attempt to connect. This is to avoid accidentally activating an existing contact with inappropriate pre-existing Role(s). The new user will be created with the branch and role defined in the following 2 settings.\nDefault Branch For New User\nIf \nCreate users - if not found create them automatically\n is enabled you can select which internal branch/company they will be created within.\nDefault Role For New User\nIf \nCreate users - if not found create them automatically\n is enabled you can select which role newly created users will be given.\nPrimary Authentication Controller\nTo configure the instance that will act as the \nPrimary Authentication Controller\n (PAC), to authenticate logins for the \nAuthentication Member\n instance:\n On \nGlobal Settings\n within the \nIntegrations\n tab select the check box to enable the instance as a \nPrimary Authentication Controller\n.\n Save the page and the \nPrimary Authentication Configurations Configurations\n link will appear.\n Within the \nPrimary Authentication Controller Configurations\n page click New. Complete the details as required:\nSetting\nDescription\nName\nEnter any name you wish.\nDescription\nEnter desired description.\nAlias\nThe \nAlias\n of the \nAuthentication Member\n instance.\nURL\nThe \nURL\n of the \nAuthentication Member\n instance (ie: \nhttps://alias2.smartsimple.com\n).\nSecurity key\nThis key provided by the \nAuthentication Member\n instance.\nEnable Reason Log\nIf selected it will prompt users to enter a reason for accessing the instance prior to being logged into the instance\nOnce you have entered the above details and saved the configuration it will appear on the list of Authentication Members with a button that allows you to select which users within the Primary Authentication Controller instance are permitted to access the member instance.\nEnabled Users Options\nOne or more of the following \nEnabled Users\n options can be set, depending on which settings are applied within the PAC and Member Authentication Controllers.\n To delete one or more configured options select the check box next to the relevant option(s) in the lower pane and click \nDelete\n.\n They cannot be edited. If a mistake is made you must delete the User Option and create it again.\nAll Users to All Users\nIf \nAllow All Users\n is enabled on the \nAuthentication Member\n instance you can set up an All Users to All Users setting. This configuration will look for an enabled user account on the Authentication Member instance that matches the e-mail address of the person logged into the PAC.\n \n This is the most common setting, as there is a one-to-one relationship between accounts in each instance.\n If a user on the PAC does not exist or is not enabled on the Authentication Member the user will either be denied access or a new account created, depending on the \nCreate Users if not found\n setting in the Member Controller as described above.\nNamed User to Named User\nIf only a select number of users on the PAC are permitted to connect to the Authentication Member instance you must define each permitted user individually.\n \n \nIf All Users is enabled on the Member server you can select the individual user in the PAC User field and select the specific user in the Authentication Member User field, or set the Member User to \nAll Users\n. The result will be the same as the PAC will try to match the PAC selected user's e-mail address with an enabled user with the same e-mail address on the Member Server.\n If the User isn't listed in the Member server field, but Create users if not found is enabled on the member you can select All Users as the Member user and the account will be created on the member the first time the named user on the PAC attempts to connect to the Member instance.\n Named User to Named User can also be used to connect accounts with different e-mail addresses on each instance\n \n You can configure multiple accounts on the PAC to connect to the same account on the member\n \n \nNote: each account within an instance of \nSmartSimple\n is permitted to be logged in at only one workstation. Thus if one account is connected to the member using the shared account, if/when a second person logs in to the member with the same account (whether via the PAC or by logging in directly via the Login Page) they will disconnect the first user. Accordingly caution should be used when using this configuration of sharing an account on the member server.\nAll Users to One User\nSimilar to configuring multiple named accounts in the PAC to connect to the same account on the member, you can enable All Users on the PAC to connect to one named account on the member.\n \n \nAs above, each account within an instance of \nSmartSimple\n is permitted to be logged in at only one workstation. Thus if one account is connected to the member using the shared account, if/when a second person logs in to the member with the same account (whether via the PAC or by logging in directly via the Login Page they will disconnect the first user. Accordingly caution should be used when using this configuration of sharing an account on the member server.\nAuditing\nBoth the Primary Authentication Controller and Authentication Member record the identity of the authenticated account on the PAC instance, the system authenticated account on the Member instance, and the date and time of connection.\nIf the Enable Reason Flag is set then the text in the Reason field will also be recorded.\nThese can all be access via reporting using the \nPrimary Authentication Log\n table in \nReport Builder (Neo)\n.\nAccessing the Member Servers\n When an instance is enabled as a \nPrimary Authentication Controller\n a new menu item called \nAuthenticated Servers\n will appear in the \nTools\n section of the left-side menu.\n Visibility of the \nAuthenticated Servers\n menu is also controlled by the \nView Authenticated Servers\n Manager Permission.\nNotes\n If both instances are on the most recent upgrade then Users will be presented with an alert if there is currently another user logged in using the \nPrimary Authentication Controller\n feature They will have the option to login regardless.\n If the PAC for a given member instance doesn't have a Primary Authentication Controller User enabled for \nAll Users\n, and your account is not specifically listed you will NOT see the server listed on the \nAuthenticated Servers\n and you will NOT have access to the instance via the Authentication Controller.\n If more than one \nEnabled Users Options\n applies to a user account the \nAll Users\n setting (if configured) will take precedence.\n To create a link within the PAC instance that both authenticates the user to the Authentication Member and \ndirects them to a specific page\n use the following syntax:\n/pacforward/\nmemberalias\n/id/\nurl_of_page_in_member_instance.jsp\nExample\n:\n/pacforward/smart/80/Apps/WFE2/wf_viewworkflows.jsp\nWill connect directly to the \nWorkflow\n Request page on the Member \ninstance\n.\nTo open the link in a new tab/window append\n' target='_blank\nExample\n:\n/pacforward/smart/80/Apps/WFE2/wf_viewworkflows.jsp' target='_blank\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Primary_Authentication_Controller&oldid=32702\n’ \nCategories\n: \nGlobal Settings\nSecurity\nTools",
  "links": [
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Authentication_Member",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Alias",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Alias",
    "https://wiki.smartsimple.com/wiki/URL",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Report_Builder_(Neo)",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/Instance"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/a/a7/PACallusers.png",
    "https://wiki.smartsimple.com/images/d/d5/PAConeTOone.png",
    "https://wiki.smartsimple.com/images/b/b3/PACmismatch.png",
    "https://wiki.smartsimple.com/images/9/98/PACmanytoone.png",
    "https://wiki.smartsimple.com/images/0/06/PACalltoone.png"
  ]
}