{
  "url": "https://wiki.smartsimple.com/wiki/SmartFolders_Overview",
  "title": "SmartFolders Overview",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\n Please note that this page is currently under construction. There is more information to come.\nContents\n1\n \nOverview\n1.1\n \nSmartFolders Features\n2\n \nConfiguration — Essentials\n2.1\n \nSetting Up SmartFolders\n2.2\n \nFolder Settings\n2.3\n \nFolder Content and Properties\n2.4\n \nFolder Security\n2.5\n \nCreating a Sub-Folder\n2.6\n \nTesting External Access to a Shared Folder\n2.7\n \nUploading Files to a Folder\n2.7.1\n \nUploading a File — Step by Step\n2.7.2\n \nFile Options\n2.7.3\n \nFile Check Out/Check In\n2.7.3.1\n \nChecking Out a File\n2.7.3.2\n \nChecking In a File\n2.7.4\n \nDownloading Files\n2.8\n \nOnline Editing\n2.9\n \nDeleting Files\n3\n \nConfiguration - Advanced\n3.1\n \nIncreasing SmartFolder Storage Limits\n4\n \nConfiguration Folders\n5\n \nSee Also\nOverview\nSmartFolders\n provide online storage for files, in a secure central location, that is accessible from any computer with Internet access.\nSmartFolders Features\nFeature\nFunctions\nPermissioned Access\n \nUser\n access to each SmartFolder can be limited to any company or \nrole\n on a \nread only \nor \nread/write \nbasis.\n You can create secure folders that are shared with their clients, providing for collaboration on specific projects or for secure file transfer.\nFile Check Out/Check In\n You can check out a file and the file will be \nread only \nuntil you check it back into the system.\n If you share a folder with another company, the check in/check out process can ensure that two people are not working on the file at the same time. \nWorkflow Driven\n Each folder can have a \nworkflow\n attached. This workflow will trigger when a file is added to the folder.\n Attaching a workflow to a SmartFolder is very useful if you want to get an alert whenever a file is added or changed.\n For more information, see \nAutoloaders\n.\nInternet Enabled\n Folders can be flagged as Internet enabled to allow for global access \nexternal\n to the folder contents without the need to log into SmartSimple.\n You can also use this feature to publish documents such as \nPDF \nfiles to the Internet.\nExternal Notes\n Folders and files can have notes attached, independent of the content of the file itself.\n This feature allows for annotation of files that could not be annotated otherwise, such as images.\nEmail File\n You can email any file to any contact from the SmartFolder.\nFolder Size Limitation\n Any number of folders can be created and any number of files uploaded to these folders, subject to the limitation of your Smartfolder subscription. \n If you need more space, use the \nGlobal Settings\n page to increase available space.\nConfiguration — Essentials\nSetting Up SmartFolders\nTo access your SmartFolders, click the 9-square \nmenu\n icon on the top right of your page.\n \nUnder the heading \nTools, \nselect \nSmartFolders \nto display your SmartFolders window. \n Initially, there will be no folders or files available. \nWithin your \nSmartFolders \nwindow, select \nNew \nto set up a new SmartFolder.\n \nThe \nNew Folder \nwindow is displayed. \n \nFolder Settings\nThere are two views to a folder: \n \nFolder Setting View: \nThis view displays the security and other settings for the folder. This is the view you see when you first create a folder.\n \nFolder Content View: \nThis view displays the files you have uploaded to the folder. When you open an existing folder, the content view is used. If you need to see or alter the folder setting, select the \nFolder Settings \nbutton.\n \nFolder Content and Properties\nEach folder has the following properties:\nProperty\nDescription\nInternet enabled\nDisplays a web address or \nURL\n that can be used to navigate the folder on the Internet. Anyone can navigate to this URL to see the folder contents. If you use this feature, the folder must be permissioned for \nEveryone\n access.\nName\nThe name you wish to give the folder.\nDescription\nA longer description as to the purpose of the folder.\nFull Text Search\nOption to index all of the folder contents, including any sub-folders.\nLocation\nThe position in the folder \nhierarchy\n where the folder should be displayed. You can change the parent folder and move the folder to a new location in the hierarchy.\nWorkflow\nAssociate this folder with a \nworkflow\n process that will automatically start whenever a new file is added to the folder.\nCompany\n \nPermission Settings - View Folder\nList of organizations that are allowed to read the contents of this folder.\nCompany Permission Settings - Modify Folder\nList of organizations that are allowed to modify folder settings.\nRole Permission Settings - \nView Folder\nList of \nroles\n that are allowed to read the contents of the folder.\nRole Permission Settings - Modify Folder\nList of roles that are allowed to modify folder settings.\nRole Permission Settings - Upload Files\nList of roles that are allowed to upload files into the folder.\nRole Permission Settings - Create Sub-folder\nList of roles that are allowed to create sub-folders under the current folder. \n The \nroles\n available to any user are dependent on the \npermissions\n associated with their role. \n If you do not set permission to a folder at the root, then as the owner you will be the only person who can access the folder. \nFolder Security\nFolders created within an existing folder \"inherit\" the security of the higher-level (parent) folder. If you can change the security of the parent folder at any level, it will also be changed for associated lower-level folders. \nIn this example, you will explore the \nGeneral Settings\n and Security Permissions of\n \nof SmartFolders by enabling \nEveryone \nwith access to view a folder. \n1. Select an existing folder to open its contents and details.\n2. Go to the \nFolder Settings\n by selecting the gear icon.\n3. Under \nCompany Permission Settings - View Folder\n, select the binoculars icon.\n4. A window of the organizations list will appear. \n5. Check \nEveryone.\n \n6. Click the \nSave\n button.\nYou may repeat this process for other Security Settings under \nCompany Permission Settings \nor \nRole Permission Settings. \nYou may alter the Security of a folder at any time by going back and selecting different permission accessibilities. \nNote: \nThe recommended security is to only provide the \nSystem Administrator\n role with access to SmartFolders through System Features, then Internet-enabling or linking the SmartFolders on the \nportal\n. \nTo provide SysAdmins with managerial access of SmartFolders, go to \nGlobal Settings > Security > System Feature Permissions. \n \nOnce you have opened System Feature Permissions, go to the tab labelled \nAction Permission \nand scroll down till you find the \nSmartFolders - Manager\n box. \nClick into the box to select the \nrole(s)\n. \n \nClick \nSave \nwhen you are done. \nCreating a Sub-Folder\nFollowing the previous example, we will next add a sub-folder but restrict access to a specific \nexternal\n company while allowing everyone internally to access the folder by referencing the \ninternal\n Employee \nrole\n. \n1. By selecting the \n+ \nicon on a folder page, we can create a sub-folder.\n2. A new folder window is displayed. In this example, the parent folder (\nLocation\n) is set to \"Autoloader.\" \n \n3. Under \nCompany Permissions Settings - View Folder, \nselect the binocular icon. \n4. In the pop-up list of organizations, check the external company you want to allow viewing access to. In this example, it is \"Amnesty International USA.\" \n \n Be sure to click the \nAdd \nbutton so that the selected company will show up at the bottom, under \nSelected Companies.\n Be sure to deselect the other bottom choices of \nInherit From Parent, Deny Company Access, \nand\n Everyone.\n5. Repeat steps 3 and 4 for \nCompany Permissions Settings - Modify Folder.\n6. Under \nRole Permissions Settings, \ncomplete the following details:\n \n7. Click the \nSave \nbutton.\nNow the access for the sub-folder you have created is as follows: \n The company access to \nview \nand \nmodify \nthe folder is set to one external company. Anyone from this company can see the contents and add files to this folder.\n The role access is set to the \nEmployee \nrole\n. Anyone in any branch of the \ninternal\n \nroot organization\n can see the contents, modify, and add files to this folder. \n The role access is set to \nDeny Role Access \nfor \nCreate Sub-Folder. \nThis means no one but the \nGlobal User Administrator\n is able to create a sub-folder from this folder. \nDepending on the \ninstance\n, it may make sense to use company restrictions to establish security; in other situations, \nroles\n might be more effective.\nTesting External Access to a Shared Folder\nWhenever you add a new item for \nexternal\n access, it is a good idea to test the functionality.\n1. Log in as on one of the contacts in the \nContacts \nrole\n. \n Remember that people outside of your domain will need to enter their full e-mail address.\nThe customer \nmenu\n displayed.\n2. Go to the 9-square menu icon on the top right of the header. Under \nTools, \nselect \nSmartFolders.\n3. The \nSmartFolders \nare displayed. \n Any folders that are indicated with a \nNew \nicon means that this is the first time you (in the \nContacts \nrole) are seeing these folders. \n If you have created other folders with different permissions, they would not be visible. \n4. Log out from \nSmartSimple\n. \n5. Log in as the \nGlobal User Administrator\n. \n6. Follow Step 2 to go back to the \nSmartFolders \nwindow. Your new folders will be displayed without the \nNew \nicon. \nSmartSimple will remember the last view of the folders, and re-display this view when you next use the application. \nUploading Files to a Folder\nOnce you have created a folder, you can upload files into that folder.\nRemember:\n Clicking on the folder name will display the folder contents, as well as the \nBrowse\n and \nUpload\n buttons, \nCreate Folder\n and \nFolder Properties\n button.\n If the folder contains sub-folders, then the names and creation date/time of these sub-folders are displayed.\n Clicking on a sub-folder name will display the contents for that sub-folder.\n Clicking the \nFolder Properties\n button will display the folder settings.\nUploading a File — Step by Step\nUse the following steps to upload a file, or multiple files, to a SmartFolder.\n1. Click on the 9-square menu icon on the top right of your page.\n \n2. Under the \nTools\n heading, select \nSmartFolders\n.\n3. Click on the SmartFolder to which you would like to upload a document. The contents of the selected folder will be displayed.\n4. If the file should be uploaded to a sub-folder of the current SmartFolder, click into a sub-folder by clicking its name.\n5. When you have navigated to the destination folder, click on the \nFolder\n icon to browse for the file you want to upload.\n \n In the File Upload screen, navigate to the file you want to upload, select it, and click the \nOpen\n button. You may also upload multiple files.\n6. Once you have uploaded your file(s), they will appear on the bottom list.\nFile Options\nOnce your file is uploaded, you can change the options related to that file. On the far right of the file list, the following options are available:\n \n \nEmail\n: Send the file to any contact with a valid email address in SmartSimple.\n \nView URL\n: Displays a short link that can be used to embed a link to the file in an email.\n \nRename\n: Change the name of the file.\n \nDescription\n: Change the description of the file.\n \nMove\n: Move the file to a new folder.\n \nNotes\n: Add notes to the file.\nFile Check Out/Check In\nChecking Out a File\nNext to the \nFile Options\n is the \nCheck Out\n icon.\n \nClicking on this icon will allow you to check out that specific file. Fill in the Check Out Note and then select \nCheck Out\n.\nTips\n:\n Once a file is checked out, it cannot be altered or deleted until the person who checked it out (or a user with the role of \nSystem Permission - SmartFolders - Manager\n originally checks it back in. If the file has not been checked in, the check box displayed next to the file name will be greyed out.\n If you have the software application installed on your computer that is associated with a specific file type, then the file will be displayed in the appropriate application icon.\nChecking In a File\nChecking a file back in will once again allow changes to the file to be made. To check in a file to the appropriate folder, return to that folder and select the \nExclamation \nicon on the far right of the file list.\n \nLocate the file you previously checked out and downloaded, and select the \nCheck In \nbutton at the bottom of the page. This will check the file back into the Folder. \n \n \nThe \nUndo Check Out \nbutton will revert the file back to the version it was prior to being checked out. \nDownloading Files\nTo download a file onto your computer, select the \nDownload \nicon next to the file you would like to download. \n \n \nYou must repeat this downloading process for each file that you want to download in a SmartFolder.\nIf you want to keep sets of folders in synchronization with local folders, download a copy of the \nSmartSync Utility\n to keep your desktop files in sync with your SmartSimple copies. \nOnline Editing\nMicrosoft Word, Excel, and PowerPoint documents uploaded to SmartSimple can be edited directly from the system rather than having to download, edit, and re-upload each document. When you save the file from within the application that you are using, it will be uploaded to SmartSimple automatically.\nWhile you are editing the file, it will be marked as \nChecked Out \nso that no one else can edit the file at the same time.\nWhen enabled, clicking on the \nEdit \nbutton next to the uploaded file will launch the file in the Microsoft application. All versions of Word, Excel, and PowerPoint are supported. When the edits have been made and the file is saved, the edits will be appropriately reflected in the document saved to the \nSmartFolder\n or \ncustom field\n. \nTo follow and learn more about the process for online editing of files from SmartFolders, see our \nOnline Editing\n page. \nDeleting Files\nYou can delete a file from a SmartFolder by checking the box next to the file name. \nOnce you check the box for a file or multiple files, the \nTrashcan \nicon will appear that allows you to delete. \n \nIf you want to delete an entire folder, display the folder properties and click the \nDelete \nbutton. \nConfiguration - Advanced\nIncreasing SmartFolder Storage Limits\nEach company is provided with a fixed amount of file storage space for SmartFolders. You can see the current storage used in the Storage Summary window in your copy of SmartSimple's \nGlobal Settings\n. \n1. Click the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nConfiguration, \nselect \nGlobal Settings.\n3. On the first tab of \nGlobal Settings, \nscroll down to the subheading \nSystem Log and Summary. \n4. Click on the hyperlink \nStorage Summary \nto generate a summary of system storage information.\n \nIn order to increase storage limitations, please contact your Account Manager.\nConfiguration Folders\nThe \nConfiguration Folders\n feature is within SmartFolders.\n \nWhile the files within SmartFolders are stored as files within the SmartSimple application system, Configuration Folders will store files within the SmartSimple database. Configuration Folders are particularly useful for branding or styling use-cases. \nAdvantages: \n Improved ability to transfer files across environments during your change management process via tools such as the Test2Production change promotion tool \n Future enhancements can be built around these files to store more meta-data related to that file, such as tracking changes and file versioning \nPlease note there is a 16MB size limitation on files stored within Configuration Folders. \nSee Also\n \nAuto Loader\n \n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=SmartFolders_Overview&oldid=37260\n’ \nCategories\n: \nSystem Management\nSmartFolders\nApplications",
  "links": [
    "https://wiki.smartsimple.com/wiki/Smart_Folder",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Workflows",
    "https://wiki.smartsimple.com/wiki/Auto_Loader",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/URL",
    "https://wiki.smartsimple.com/wiki/Everyone",
    "https://wiki.smartsimple.com/wiki/Hierarchy",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/Roles",
    "https://wiki.smartsimple.com/wiki/Roles",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Portals",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/The_Root_Company",
    "https://wiki.smartsimple.com/wiki/User#Global_Administrator",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Roles",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/User#Global_Administrator",
    "https://wiki.smartsimple.com/wiki/Manager_Permissions_-_System_Permissions",
    "https://wiki.smartsimple.com/wiki/SmartSync_for_Folder_Synchronization",
    "https://wiki.smartsimple.com/wiki/Online_Editing",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Auto_Loader"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/3/37/Construction_warning.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/c/c6/SmartFolder2.png",
    "https://wiki.smartsimple.com/images/5/5b/SmartFolder3.png",
    "https://wiki.smartsimple.com/images/1/1d/052919_EF_SmartFoldersSettings.png",
    "https://wiki.smartsimple.com/images/e/ec/052919_EF_SmartFoldersEveryonePermissions.png",
    "https://wiki.smartsimple.com/images/5/51/Sys_feature_permissions1.png",
    "https://wiki.smartsimple.com/images/5/5f/Smartfolders_manager.png",
    "https://wiki.smartsimple.com/images/4/42/052919_EF_SmartFoldersSub-Folder.png",
    "https://wiki.smartsimple.com/images/3/30/052919_EF_SFPermissions.png",
    "https://wiki.smartsimple.com/images/9/96/052919_EF_SmartFoldersRolePermissions.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/2/27/053019_EF_SmartFoldersUploadFile.png",
    "https://wiki.smartsimple.com/images/e/e0/053019_EF_FileOptions.png",
    "https://wiki.smartsimple.com/images/9/99/053019_EF_CheckOut.png",
    "https://wiki.smartsimple.com/images/4/4e/053019_EF_CheckIn.png",
    "https://wiki.smartsimple.com/images/2/2d/053019_EF_CheckInButton.png",
    "https://wiki.smartsimple.com/images/f/f1/053119_EF_DownloadSmartFoldersFile.png",
    "https://wiki.smartsimple.com/images/5/56/053119_EF_DeleteFilesSmartFolders.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/0/09/Storage_summary.png",
    "https://wiki.smartsimple.com/images/e/ec/Config_folders.png"
  ]
}