{
  "url": "https://wiki.smartsimple.com/wiki/SmartCard",
  "title": "SmartCard",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguring SmartCards\n2.1\n \nPermissions\n2.2\n \nDisplay Options\n3\n \nCreating SmartCards\n3.1\n \nSelecting individual Object Record\n3.2\n \nSelecting objects from List View\n3.3\n \nAdding to New SmartCard\n3.4\n \nAdding to / Removing from Existing SmartCard\n3.5\n \nSharing SmartCard\n4\n \nUsing SmartCards\n4.1\n \nAccessing SmartCard\n4.2\n \nEdit / Delete from My SmartCards\nOverview\nThe SmartCard feature is an easy to build and easy to access store of commonly used object data that can be shared with other users, either individually or based on system roles.\nThe SmartCard feature is currently available against the following object data . . .\n \nUTA Level 1 records\n \nUTA Level 2 records\n \nUTA Level 3 records\n \nUser\n \nOrganization\n \nTransactions\nConfiguring SmartCards\nPermissions\nThe ability to create, add objects to and then access SmartCards is controlled by the \nEnable SmartCard\n setting in the \nSystem Feature Permissions\n.\nUse the lookup button for the \nEnable SmartCard\n setting to add those roles that should have access to this feature.\nDisplay Options\nThe system allows for 3 fields to be displayed for each SmartCard item for all supported Object types.\nThe displayed fields themselves are configured via the \nSmartCard Item Display Settings\n page.\n \n Under the Configuration menu click on \nGlobal Settings\n.\n Under the System Configuration header, click on the SmartCard option.\n The \nSmartCard Item Display Settings\n page is displayed.\n Select the Object type from the first drop-down.\n Click on the button adjacent to the first drop-down, which has a tool-tip that reads \"Edit Object Type display settings\".\n A SmartCard display item will appear on the right hand panel, while all Standard and Custom fields associated with the selected Object Type appear on the left hand panel, beneath the second drop-down.\n The second drop-down can be used to control the display of fields underneath, restricting them to Standard fields, common Custom fields or to Type / Role / Category specific Custom Fields.\n Required fields can be dragged across to the SmartCard display item.\n Fields can be removed from the SmartCard display item by clicking on the X to the right of the field name.\n Click Save once complete. You will be informed that SmartCard Display Settings have saved.\n Click on the the delete option in the top right of the SmartCard Display item if you wish to remove the entire item, then click Save.\nCreating SmartCards\nSelecting individual Object Record\n Navigate into the Object record that you wish to add to a SmartCard.\n A small star icon will appear in the top right corner of the Object record. Click this.\n You will be presented with window allowing you to add to a new Smartcard or an existing SmartCard, depending on whether a SmartCard has been created for the current Object Type.\nSelecting objects from List View\n \n Navigate to list view for the Object Type that you wish to add to a SmartCard.\n Run a search and then check the boxes for the records that you wish to add.\n A small star icon will appear in the menu bar above the list view.\n Click on this star icon.\n You will be presented with window allowing you to add to a new Smartcard or an existing SmartCard, depending on whether a SmartCard has been created for the current Object Type.\nAdding to New SmartCard\nIf there is no SmartCard for the selected object type then you can create a new SmartCard.\n \n Populate the Title field with the name you wish to assign the SmartCard.\n Use the Lookup button beside the Icon field to select any icon you wish to assign the SmartCard,\n You can choose to Share the SmartCard.\n Click the Add to New SmartCard button at the bottom.\n The New SmartCard screen will refresh, and you should now see the SmartCard listed on the left hand side and the create new options appear on the right.\nAdding to / Removing from Existing SmartCard\nIf there are existing SmartCards for the selected object type then you can add to these existing ones as well as create a new SmartCard.\nThe SmartCard screen will appear with the existing object specific SmartCards listed on the left hand side and the Create New options on the right.\n \n Each existing SmartCard will have a star icon to the left of the SmartCard name.\n If the star is a solid colour then the record or records already exist against the SmartCard. In this case you can click the Star to remove the record.\n If the stars border is a different colour than its centre then the record or records do not yet exist against the SmartCard. In this case you can click the Star to add the record.\n In each case you will be informed that the SmartCard has been updated.\n You can also create a new SmartCard for the object using the options on the right hand side.\nSharing SmartCard\nSmartCards can be shared with other \npermissioned\n users, either individually or based on system roles.,\n To share based on roles then click on the Lookup option beside the Select Roles option, then select roles that you wish to share the SmartCard with and click OK.\n To share based on individual users then either type into the Select Users Ajax lookup field and select the user from the returned results or use the adjacent Lookup option to select users.\nUsing SmartCards\nAccessing SmartCard\nSmartCards are accessed from the User Menu, by clicking on the My SmartCards option.\n \nThe User will be brought to the SmartCards page, which has 2 tabs\n My SmartCards - the SmartCards created by the current user. They have the ability to edit, delete and share\n Shared with Me - the SmartCards created by other users. They can view, but cannot edit, deleted or share\n \nUsers can click on the individual records listed and will be automatically brought to that record.\nIf a SmartCard has more records than can be listed on the screen then there will be small arrow icon at the bottom that will allow them to scroll down through all the records.\nEdit / Delete from My SmartCards\nThe My SmartCards section displays those SmartCards created by the current user.\nThe current user will have the ability to remove individual records from SmartCards by clicking on the Delete icon to the right of each individual record.\nThe current user will have the ability to edit the SmartCard by clicking on the Edit icon.\n \nThey can then rename the SmartCard and save or, alternatively, they have the option to delete the entire SmartCard.\nThey will also have the option to Share the SmartCard by clicking on the Share icon, which presents them with the Select Roles and Select User options.\n \n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=SmartCard&oldid=38197\n’",
  "links": [
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Level_2_Entity",
    "https://wiki.smartsimple.com/wiki/Level_3_Entity",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Organization",
    "https://wiki.smartsimple.com/wiki/Transactions",
    "https://wiki.smartsimple.com/wiki/System_Feature_Permissions#Miscellaneous_Feature_Permission",
    "https://wiki.smartsimple.com/wiki/SmartCard#Permissions"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/e/ed/SmartCardDisplay.png",
    "https://wiki.smartsimple.com/images/f/f4/SmartCard2.png",
    "https://wiki.smartsimple.com/images/6/6e/SmartCard3.png",
    "https://wiki.smartsimple.com/images/3/32/SmartCard4.png",
    "https://wiki.smartsimple.com/images/e/e3/SmartCard5.png",
    "https://wiki.smartsimple.com/images/2/2b/SmartCard9.png",
    "https://wiki.smartsimple.com/images/6/63/SmartCard7.png",
    "https://wiki.smartsimple.com/images/3/30/SmartCard8.png"
  ]
}