{
  "url": "https://wiki.smartsimple.com/wiki/User",
  "title": "User",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\n Please note that this page is currently under construction. There is more information to come.\nContents\n1\n \nOverview\n2\n \nConfiguration—Essentials\n2.1\n \nAdding Users and Contacts\n2.1.1\n \nManually Adding Users\n2.1.1.1\n \nStandard People Fields\n2.1.2\n \nImporting Contacts\n2.1.2.1\n \nUndoing an Upload\n2.2\n \nActivating a User\n2.2.1\n \nFrom the Organization Hierarchy\n2.2.2\n \nFrom Their Profile\n2.2.2.1\n \nNo Access\n2.2.2.2\n \nGlobal Administrator\n2.3\n \nSearching for Users\n3\n \nConfiguration—Advanced\n3.1\n \nRestore or Purge Deleted Contacts\n3.2\n \nUser & Contact Settings\n4\n \nSee Also\nOverview\nA user is a contact that can log in and access a \nSmartSimple\n \ninstance\n. If you use the \nenable login\n feature when adding contacts, they will be able to log into the system and you can consider them \"users\"; otherwise, you can consider them simply as \"contacts.\" When enabling login access for contacts, you can choose to send each person an email containing their username, password, and the \nURL\n to access your instance of SmartSimple.\n Because \nOrganization Terminology\n will vary between instances, remember that your specific instance may use different nomenclature for users/contacts. The related functions such as how to activate or add users in every instance will remain the same.\n \nPeople \nadded into the system are similar to \norganizations\n in their behaviour and functionality. A person object may store information about internal staff as well as external contacts/venders. All people are also stored in a single format and table in the database, each with their own set of \nstandard fields\n. \n Each person will have a single parent organization in the \nOrganization hierarchy\n, though they represent a variety of users and contacts at the different organizational levels. For example, you might have \nTeaching Assistants \nand \nProfessors \nat the \nDepartment \nlevel, and \nDeans \nat the \nUniversity \nlevel. \nYou can find \nall \npeople in your SmartSimple instance by clicking on the 9-square menu icon on the top right of your page and clicking the \nPeople \nhyperlink.\n \nAs part of the contact setup process, you assign contacts \"roles.\" A user can access and manipulate information only to the extent permitted through their membership of specific \nroles\n, combined with those roles' \nability\n to manage system-wide \npermissions\n. Roles therefore define user access to system resources such as the \ninterface\n they see (Administrator vs normal user portal), the \napplications\n they can access, the \nfields\n they see within each application, and the \nreports\n they can run.\n Example: A user who is a \nSystem Administrator\n will have increased control and visibility to the system than a user whose role is simply \nEmployee.\n Note: Although a user can be attributed with multiple roles, the system will always default to the \nminimum\n level of access.\n \nConfiguration—Essentials\nDepending on your \nrole\n, you may or may not be able to add, delete, and modify contacts.\nTypically, the System Administrator role will have the highest amount of security access to all contacts. In some \ninstances\n, internal Staff roles may similarly be able to modify contacts.\nAll users are able to edit their own contact profile.\nAdding Users and Contacts\nYou can add people to the \norganization hierarchy\n using any of the following techniques:\n Manually entering contacts\n Uploading in bulk through \nImport Wizards\n Uploading in bulk through \nAutoloader\n Enabling one or more company \nsign up pages\n Importing contacts from \nMicrosoft Outlook\n using the \nOutlook Plug-in\n feature [Deprecated download and support for Outlook Plug-in July 9, 2020]\n Importing using the \nAPI\n functionality and a custom program that your organization could create\nManually Adding Users\nNote: \nIf you enable the login feature when adding people, they will be able to log into the system and you can consider them \"users.\" Without this user activation, they are simply \ncontacts.\nPeople are always added to some level of the hierarchy; so, when you wish to add a new person, you must first select the appropriate organization level. \n1. Click the 9-square \nmenu\n icon on the top right of your screen.\n \n2. Under the heading \nOrganizations, \nselect \nOrganization Hierarchy.\n3. Select the organization to which you wish to add the new person. \n The \nroot organization\n is listed first underneath both the \ninternal\n and \nexternal\n tabs. \n The \ninternal\n records are listed underneath the first tab; the \nexternal\n records are listed underneath the second. \n Depending on the \ninstance\n, the \nterminology\n of your internal vs external headings will vary. \n4. Click the \nNew \nbutton, which will reveal drop-down that allows you add a new user. \n \n Our \nduplication check\n relies on email information, so if a user has the same email as someone who is already in the system, they will not be added as a new contact.\n6. If \nRoles\n are available to your SmartSimple instance, you may have to select which role you want this contact to fit into. \n \n Keep in mind that even if you select multiple roles, our system will default to the \nminimum\n level of access.\n If it is a brand new \ninstance\n, there may be no users in any role. In this situation, simply change the Role to \nNo Role Assigned \nby clicking \nNext.\n7. The new user details will appear, including \nstandard fields\n that should be filled out. \nThe fields marked by an asterisk (\n*\n) are mandatory, meaning that without filling them in, you will not be able to proceed. \nStandard People Fields\nThe standard fields used to describe a person are as follows: \nStandard Field\nDescription\nFirst Name\nThe first name of the person\nLast Name\nThe last name of the person\nTitle\nBusiness title of the person\nPrefix/Suffix\nPrefix and suffix of the contact\nPhone/Extension\nDirect line for the person and their extension\nEmail\nEmail address (an email address is required to allow a user to log into the system)\nPrimary Contact\nCheck this box to indicate if this person is the primary contact at the organization\nOrganization\nThe organization to which this person should be associated - changing the organization will move that person to another organization\nAddress\nIf different from their organization, the street address of the person\nAddress 2\nAdditional address line (apartment or suite number, for example)\nCity\nIf different from their organization, the city address of the person\nProvince\nIf different from their organization, the province address of the person\nCountry\nIf different from their organization, the country of the person\nPostal code\nIf different from their organization, the postal code of the person\nFor more options about configuring a contact's standard fields, see \nContact and Account Standard Fields\n. \n8. After filling in the user's standard fields, you may choose to \nSave Draft\n or \nSave\n the contact record. If you select \nSave Draft\n, it will only store the information on the page. If you select \nSave\n, it will validate the information on the page and the contact will be added. \n \nImporting Contacts\nThe import process consists of copying external information (ex: if it is already listed on an Excel file) onto an \nImport Window, \nvalidating the information mapping before uploading, and uploading the data to SmartSimple. If you need to split contact information, this technique will be repeated: once for \norganization records\n that will categorize companies onto the \norganization hierarchy\n, and once for the contact data that will create profiles for users. \nIn the following step-by-step example, contact information from an Excel sheet will be imported onto a copy of SmartSimple. This process occurs after importing organization records, as the system will use the department names in this data to determine the correct level of association on the organization hierarchy for each user. \nThis example uses \ninternal\n users, so they will need to be added to the internal hierarchy of the organization hierarchy. \n \nBefore beginning this process, highlight rows A1 to D22 and select \nCtrl + C \nto copy this information. \n1. Select the 9-square menu icon on the top right of your screen. \n \n \n2. Under the heading \nOrganizations, \nselect \nOrganization Hierarchy. \n The internal records are listed on the first tab. If you are uploading \nexternal\n contact information, simply complete this process on the second tab. \n3. Click the \nroot organization\n name. \nThe root organization details are displayed.\n3. Click the \nNew \nbutton, then select \nImport Staff. \n \n Note that the term \nStaff \nmay be different depending on your instance, as \norganization terminology\n is variable per SmartSimple instance.  \nStep 1 \nof the \nUser Import Wizard \nis displayed. \n4. Paste the data into the \nImport Wizard.\n5. Set the \nrole\n to \nEmployee, \nor another relevant role that is available.\n If a role you would like is unavailable, learn how to \ncreate user roles\n. \n6. Set the \nColumn Delimiter \nto \nTab.\n \n7. Check \nFirst Row Contains Field Names.\n8. Click the \nAnalyze \nbutton. \n9. A pop-up will appear to confirm your action. Select the \nYES \nbutton.\n \n10. The analyzed data of your imported records will appear. At this stage, you have the opportunity to \ndeselect \nany employees you do not wish to add; you may also edit their information, such as their email addresses. At the bottom of the screen, you will see different methods to add users to the SmartSimple instance. Select one, then click \nUpload.\n \n The option to activate users and send them a password by email will explicitly notify your users that they have been added to your SmartSimple instance. This allows them to log in to the system and to manually change their password after.\n11. Your successfully imported contact records will appear in a list.\n \n \nTo ensure that your internal contact records have been imported, simply return to the \nOrganization Hierarchy\n. By clicking the \n+\n button next to an internal organization, the associated contacts will appear.\n \nYou may also \nactivate users\n from the \nOrganization Hierarchy\n view if you did not previously activate them during the importing process.\nUndoing an Upload\nIf you have imported these contact records in error, you may \nundo your upload\n. \nActivating a User\nFrom the Organization Hierarchy\nAdding a user to a level of the hierarchy does not mean that when they log in they will be able to access the system. You must manually enable the user to have access to the system. This process will change a contact \ninto\n a user from the \nOrganization Hierarchy,\n therefore enabling them to specifically log in and access \nSmartSimple\n.\n1. Access the \ncontact\n(s) you are looking for with the 9-square \nmenu\n icon on the top right of your screen.\n \n2. For a comprehensive list of all contacts, select \nPeople \nunder the \nOrganizations \nheading. \n3. From the \nOrganization Hierarchy\n under \nOrganizations, \nyou may access contacts by finding them under their associated \ninternal\n or \nexternal\n organization. \nIf the contact is inactive, they will have a lock icon next to their name.\nTo the right of each \nuser\n the following icons are displayed: \nThe \nEnvelope\n icon will open the Message Center to send a message to the user. Another inter-user communication method is \nInstant Message\n, although its function is more effectively used to see which users are currently online. \nThe \nKey\n icon indicates that this user can log into \nSmartSimple\n - their \nStatus\n is set to \nEnabled\n in the \nUser Settings\n. This status also means that they will receive emails or a new password if they select \nForgot Password\n from their account. \n4. Click on the contact name to go to their \nprofile\n.\n5. To activate the contact, select the grayed-out \nKey\n icon on the top right of their profile.\n \n6. A confirmation pop-up will appear. You may choose to activate the user automatically (without password), active them and send an automated password to their email, or cancel the activation process.\n Activating users with this key icon can also be done from their specific user profile by locating the key icon on the top right of their page. \nFrom Their Profile\nAdding a user to a level of the hierarchy does not mean that when they log in they will be able to access the system. You must manually enable the user to have access to the system. This process will change a contact \ninto \na user from the \nProfile, \ntherefore enabling them to specifically log in and access \nSmartSimple\n. \nYou can most efficiently activate a user from their profile using the same \nkey icon \nfrom the \norganization hierarchy\n. The key icon is located on the top right of the \nprofile page\n of the user: \n \n \n It will be \ngreyed out \nif the user is not yet activated. \n Clicking a greyed out key icon will activate the user.\n Clicking a coloured key icon will \ndeactivate \nthe user. \nThe other option of activating a user from their \nProfile \nis to provide \nUser Access: \n1. On the \nprofile page\n of the newly added user, select the \nOptions\n button to reveal a drop-down menu.\n2. Under the heading \nProperties,\n select \nRoles and Access\n.\n \n3. Once the modal window of \nRoles and Access \nopens, look to the top left of the window to enable \nAdvanced Options \nto open up Access Types.\nAccess Type\nFunctionality\nUser Access\nProvides access to the system to the extent permitted through the user's membership of specific \nroles\nAPI Access\nAn account type used to access data in a SmartSimple instance via an \nAPI\n (Application Programming Interface) - does not give access to SmartSimple interface directly\nNo Access\nThe user will not be able to log into the system\n Toggling on this option will disable user access to your SmartSimple copy \n \nIf the user is currently logged in they will not lose access until they try to log in again\n.\nGlobal Administrator\n(System Administrator)\nThe user will be able to control the entire \norganization hierarchy\n within your SmartSimple copy. They will be able to:  \n Create additional users at any level - including additional \nSystem Administrators\n \n Create new sub-organizations, both \ninternal\n and \nexternal\n Subscribe organizations to SmartSimple application programs, such as \nSmartFolders\n \n Upload organization and contact information, both \ninternal\n and \nexternal\n \n Create \nroles\n and collaborative \nWorkflows\nFor more information, and to find out how to enable or disable the \nSysAdmin \nrole for users, see \nGlobal User Administrator\n. \n4. To enable typical \nUser Access, \ntoggle on \nUser Access. \nIf you would like to make a new user a \nSystem Administrator\n, then toggle that option on the right. \n \nSetting Login Restrictions\n [Deprecated March 11, 2021] You are able to restrict a user's access to SmartSimple to a specific workstation by setting the IP address of the workstation in their profile. Alternatively, you may \nlock \nthe user to the next workstation that they use to log into the system by toggling the \nWorkstation - lock. \n If you only wish for a user to have access to the system for a specific time period, you can toggle the \nWill Expire \noption and set the expiry date, after which the user will no longer be able to access the system. \n5. After saving the access options that you have selected, the buttons at the bottom of the modal window will display password setting and sending options. \n \n \n If you select \nSend Password, \nthe user will receive an automated password in an email. From there, they can log into the SmartSimple system and change their password manually. \n The option to \nSet Password \nis not typically recommended except in necessary situations, such as if a client on the phone demands for a timely setting of the password. The \nSet Password \noption is also highly recommended when you are testing on the \nBackup Server and Testing Instance\n, as an email will not be triggered and sent to the user regardless.. \n You may also \nReset \na user's password using this \nSet Password \noption. \nAfter following these steps, your new user is now enabled to log into the system with their password. \nFor more comprehensive information regarding SmartSimple user passwords, see our \nPassword Policy\n.\nSearching for Users\nAn easy way to access all of your instance's people records is directly through the \nPeople \npage.\n1. Click the 9-square menu icon on the top right of your page. \n \n \n2. Under the heading \nOrganizations, \nselect \nPeople.\nThe \nPeople \npage is displayed. \n \n \nAll contacts will be listed, both \ninternal\n and \nexternal\n. If there are security rules in place, such as \nview own accounts only\n under \nRoles and Security Settings\n, you might not be able to see all contacts.\nThe page is divided into a number of areas:\n \nPeople List\n: This area will display people based on the selection criteria. Initially all contacts are displayed. The columns displayed for this list can be configured based on \nList Views\n.\n \nSearch\n: You can set the criteria for searching specific people, based on \nBasic Search\n or \nAdvanced Search\n functionality.\nConfiguration—Advanced\nRestore or Purge Deleted Contacts\n NOTE: Any records that have been deleted for over one year will be automatically purged. \nWhen a user deletes a company or contact, they are not actually deleted from the system database until a year has passed, although they will be marked as deleted and will not appear in any future interactions.\nIf the company or contact is deleted by accident, then a System Administrator can restore them by taking the following steps:\n1. Click the 9-square menu icon on the top right of your page.\n2. Under the heading \nConfiguration,\n select \nGlobal Settings.\nFor deleted \nCompany\n records, under the \nOrganizations\n tab, select \nDeleted Companies & Accounts.\nFor deleted \nContact\n records, under the \nUsers\n tab, select \nDeleted Staff & Contacts.\n3. Click on the records that you want to be restored.\nContacts\n: \n \nCompanies\n:\n \n4. Click the \nRestore \nbutton. \nThe records are restored, along with any of their associated activities, notes, and \ncustom fields\n. Note that when a deleted company is restored, all associated deleted contacts will also be restored. \nIf you select certain records and click the \nPurge \nbutton, the records will be permanently purged - you will not be able to restore them under any circumstances.\nFor restoring deleted records (such as activities associated with \nUniversal Tracking Applications\n), a similar process is followed. Find out how to restore those \nhere\n.\nUser & Contact Settings\nNote that the terms \nStaff \nand \nContact \nmay have been \nrenamed\n in your instance of SmartSimple.\nTo modify the settings associated with users: \n1. Click on the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nConfiguration, \nselect \nGlobal Settings \n(available to \nGlobal User Administrator\n only).\n3. Under the tab \nUsers, \nyou will see the following hyperlinked setting categories: \n \n \nStandard Fields: \nStandard fields\n associated with users. \n \nCustom Fields: \nCustom fields\n associated with both \ninternal\n and \nexternal\n users.\n \nDynamic Field Visibility Controls: \nConfigure dynamic field visibility controls for users.\n \nStatuses: \nStatuses used for users.\n \nSubmit & Save Buttons: \nSubmit & Save buttons used for users.\n \nSmartCheck Validation:\n SmartCheck validation to attach to form buttons for users.\n \nSignup Pages: \nUsed to manage \nexternal web pages where contacts can register\n. \n \nDuplicate Check Setting: \nAllows you to define which fields are prompted for and compared with existing Contacts for duplicates when adding new users. See \nDuplicate Check\n.\n \nDefault User Settings: \nManage default settings for first time login user. \n \nList Views: \nUsed to configure the \nlist view\n for users.\n \nLookup List Views: \nUsed to configure the fields shown when using an \nAjax\n lookup on users; also determines the \nlist view\n for the Lookup dialog for the \nstandard field\n \"Organization\" in the . See \nConfiguring Ajax Lists Views\n. \n \nActivity List Views: \nUsed to configure the \nList View\n for the activities of users. \n \nDeleted Staff/Contact: \nAllows you to view, restore, or purge recently deleted users. For more complete instructions, see \nhere\n. \nSee Also\n \nAdministrator\n \nGlobal User Administrator\n \nProfile\n \nReporting on User Type and Access Type\n \nPassword Policy\n \nMaintaining Users - video\n \nRelating Contacts and Accounts to the Universal Tracking Application\n \nSignup Page\n \nAssociation Settings\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=User&oldid=39373\n’ \nCategories\n: \nGlossary\nContacts",
  "links": [
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Enabling_User_Access",
    "https://wiki.smartsimple.com/wiki/URL",
    "https://wiki.smartsimple.com/wiki/Organization_Terminology",
    "https://wiki.smartsimple.com/wiki/Organization",
    "https://wiki.smartsimple.com/wiki/User#Standard_People_Fields",
    "https://wiki.smartsimple.com/wiki/Organization_hierarchy",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/Role_Based_Security",
    "https://wiki.smartsimple.com/wiki/Manager_Permission",
    "https://wiki.smartsimple.com/wiki/Interfaces",
    "https://wiki.smartsimple.com/wiki/Application",
    "https://wiki.smartsimple.com/wiki/Fields",
    "https://wiki.smartsimple.com/wiki/Reports",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Getting_Started_with_the_Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Role_Based_Security",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Organization_hierarchy",
    "https://wiki.smartsimple.com/wiki/Importing_Organisation_Records#Importing_User_Data",
    "https://wiki.smartsimple.com/wiki/Autoloader",
    "https://wiki.smartsimple.com/wiki/Signup_Page",
    "https://wiki.smartsimple.com/wiki/APIs",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/The_Root_Company",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Organization_Terminology",
    "https://wiki.smartsimple.com/wiki/Duplicate_Check_Settings",
    "https://wiki.smartsimple.com/wiki/Roles",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Contact_and_Account_Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Importing_Organisation_Records#Importing_Organization_Records",
    "https://wiki.smartsimple.com/wiki/Organization_hierarchy",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/The_Root_Company",
    "https://wiki.smartsimple.com/wiki/Organization_Terminology",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/Creating_User_Roles",
    "https://wiki.smartsimple.com/wiki/User#From_the_Organization_Hierarchy",
    "https://wiki.smartsimple.com/wiki/Importing_Organisation_Records#Undoing_an_Upload",
    "https://wiki.smartsimple.com/wiki/Importing_Organisation_Records#Undoing_an_Upload",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Contact",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Using_Instant_Messaging",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Organization_hierarchy",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/Roles",
    "https://wiki.smartsimple.com/wiki/API",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/SmartFolders",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Roles",
    "https://wiki.smartsimple.com/wiki/Workflows",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Backup_Server_and_Testing_Instance",
    "https://wiki.smartsimple.com/wiki/Password_Policy",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Roles_and_Security_Settings",
    "https://wiki.smartsimple.com/wiki/List_View_Overview",
    "https://wiki.smartsimple.com/wiki/Basic_Search",
    "https://wiki.smartsimple.com/wiki/Advanced_Search",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Restoring_Deleted_Records",
    "https://wiki.smartsimple.com/wiki/Organization_Terminology",
    "https://wiki.smartsimple.com/wiki/User#Global_Administrator",
    "https://wiki.smartsimple.com/wiki/Contact_and_Account_Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Duplicate_Check",
    "https://wiki.smartsimple.com/wiki/List_View",
    "https://wiki.smartsimple.com/wiki/Ajax",
    "https://wiki.smartsimple.com/wiki/List_View",
    "https://wiki.smartsimple.com/wiki/Standard_field",
    "https://wiki.smartsimple.com/wiki/List_View",
    "https://wiki.smartsimple.com/wiki/User#Restore_or_Purge_Deleted_Contacts",
    "https://wiki.smartsimple.com/wiki/Administrator",
    "https://wiki.smartsimple.com/wiki/User#Global_Administrator",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/Reporting_on_User_Type_and_Access_Type",
    "https://wiki.smartsimple.com/wiki/Password_Policy",
    "https://wiki.smartsimple.com/wiki/Relating_Contacts_and_Accounts_to_the_Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Signup_Page",
    "https://wiki.smartsimple.com/wiki/Association_Settings"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/3/37/Construction_warning.png",
    "https://wiki.smartsimple.com/images/0/0a/People_access.png",
    "https://wiki.smartsimple.com/images/c/c9/Uta-diagram-800w-Contact.jpg",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/0/05/NewStaff.png",
    "https://wiki.smartsimple.com/images/5/59/Role.png",
    "https://wiki.smartsimple.com/images/0/0e/ContactButtons.png",
    "https://wiki.smartsimple.com/images/c/cd/Excelimportinfo.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/1/13/Import_Staff_Button.png",
    "https://wiki.smartsimple.com/images/1/18/Import_Staff.png",
    "https://wiki.smartsimple.com/images/8/8f/Screenshot_14.png",
    "https://wiki.smartsimple.com/images/b/bf/User_activation.png",
    "https://wiki.smartsimple.com/images/0/0f/SuccessfulImportStaff.png",
    "https://wiki.smartsimple.com/images/3/3e/Org_Hierarchy_People_Added.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/a/a3/LockIcon.png",
    "https://wiki.smartsimple.com/images/8/81/EnvelopeIcon.png",
    "https://wiki.smartsimple.com/images/f/f7/KeyIcon.png",
    "https://wiki.smartsimple.com/images/4/47/ActivateUser.png",
    "https://wiki.smartsimple.com/images/2/2e/ActivateUserConfirmation.png",
    "https://wiki.smartsimple.com/images/4/4e/Activate_user_icons.png",
    "https://wiki.smartsimple.com/images/3/34/RolesandAccess.png",
    "https://wiki.smartsimple.com/images/d/d8/EditRolesandAccess.png",
    "https://wiki.smartsimple.com/images/5/57/Password.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/5/5f/PeopleList.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/c/ca/PurgeContact2017.png",
    "https://wiki.smartsimple.com/images/8/83/PurgeOrg2017.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/2/22/StaffAndContactSettings2017.png"
  ]
}