{
  "url": "https://wiki.smartsimple.com/wiki/User_Role",
  "title": "User Role",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n1.1\n \nThe Key Control Element - Roles\n1.2\n \nNotes on Roles\n1.2.1\n \nThe Everyone Role\n2\n \nConfiguration - Essentials\n2.1\n \nAccessing Roles\n2.2\n \nCreating a Role\n2.3\n \nPermissioning Roles\n2.4\n \nMenu Settings for Roles\n2.5\n \nRemove or Add from Current Users\n3\n \nSee Also\nOverview\nUser Roles are a key feature of \nSmartSimple\n: they are defined in the system by \nSystem Administrators\n to categorize \nusers\n and to provide the basis for setting \nRole Based Security\n permissions. The majority of your configuration needs will be using \nrole-based security settings. \nThe Key Control Element - Roles\nRoles have the ability to control the following features within your SmartSimple system: \n The \nAdministration Interface\n menu - the menu items displayed in the administrative interface are controlled by the user role. Some users will see different menu items than other users, depending on their allocated role. \n \nPortal\n Interface - you can create a specific portal view for people in a specific role, overriding the display of the administrative interface.\n \nRole Based Custom Fields\n - you can gather different information for different roles through role-specific custom fields. \n Manager Permissions - manager permissions in all applications and key features are associated with specific roles. These \nManager \npermissions will give them higher levels of access and functionality to that feature than other user roles. \n \nRole Permissions\n - permission a role to be able to set other roles. For example, a sales role may be able to change a \nSuspect \nrole to a \nProspect \nrole, but not a \nCustomer \nor \nEmployee \nrole. \n \nAssociations\n - When you use the \nAssociations\n feature to associate a contact with an organization to which they are not a contact, you use a \nrole \nto show the relationship between the organization and the person. \n Within s, roles are used to define a context-specific role for a person - for example, a customer may be playing the role of \nProject Leader, \nbut only for a specific project. Even more commonly, a \nStaff \nRole might have administrative permissions to a specific only. See \nUTA role\n for more information about roles that are permissioned for UTA-only. \n \nWorkflows Overview\n - you are able to reference the role in a collaborative workflow step; for instance, you can specify that everyone with the \nExecutive \nRole would need to approve a document before the system can forward its distribution. \nNotes on Roles\nPrior to adding many users to SmartSimple, it is important to \ndefine \nroles: \n You can define any number of roles.\n You can associate a single user with any number of roles.\n It is recommended for security reasons that only a \nSystem Administrator\n can define roles.\n Once a role is created, the administrator associates users with those roles. \nAlways make sure that the role is defined prior to \nImporting Users\n or adding users via \nAuto Loader\n. Both methods provide features that will prompt you to select one or more roles for the users that you are uploading.\nThe Everyone Role\nA single, important, built-in role is the \nEveryone \nrole. Every contact will be a member of the \nEveryone \nrole regardless of the other roles that are created and assigned to them. You are able to set a menu for the \nEveryone \nrole, but unlike the other roles, you cannot create a \nportal\n for everyone, or provide access to \nreports\n to the \nEveryone \nrole. \n Leaving permissions blank anywhere (\nexcluding \nthe \nSecurity Matrix\n will presume \nView \nand \nEdit \naccess for everyone, provided there is no \nStatus Lock\n in place).\n If there are \nStatus Locks\n in place, the default for any user would be \nView \naccess, unless they have \nOverride Lock \nenabled (e.g. the \nSystem Administrator\n). \nConfiguration - Essentials\nAccessing Roles\nTo access the list of roles available in your copy of SmartSimple, follow these steps:\n1. Click on the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nConfiguration, \nselect \nRoles and Security\n.\n4. Click on the hyperlink for \nUser Roles.\n5. A list of roles available to the system will be displayed; if you want to edit a role, click the \npencil icon \nnext to the name of the role. To create a new role, click the \nNew \nbutton (+ icon). \n \nCreating a Role\nThere are only two fields that need to be defined in order to \ncreate\n a role: the name of the role and a narrative description. \n \nHowever, it is best practice to fill out as many of the fields as possible, with as much explanatory detail as possible. Role settings are described below: \nRole Name\nThe unique name of this user role.\nCaption\nThe caption of this user role; this is the name of the role as it appears throughout the system. If you prefer to change the name of a role, changing the caption will accommodate this.\nDescription\nThe narrative description of the role.\nRole Formula\nThe role formula sets a calculation that is performed whenever a contact record possessing this role is saved. See \nRole Formula\n for more information and instructions.\nTwo Factor Authentication\nEnable two factor authentication for this role if required.\nEnable Menu Icon\nThis will display a menu icon on the right of the screen for this role. \nInternal User Role Only\nIf set, then this role can only be added to \nInternal\n users. \nExternal\n users will not have the option to be associated with this role. \nUTA Role Only\nThis will mean that the created role is relevant only relative to records in a . See \nUTA Roles\n for more information. If this option is toggled on, then the role created will not be able to be assigned to a contact's profile, but rather will be selected as a role only when that contact is assigned to a UTA record.\n Once you are done filling out the general edit fields for creating a new user role, click the \nSave \nbutton at the bottom.\nWhen a user is added to a role, the role will be visible on the role list of that user's \nprofile\n.\n \nPermissioning Roles\n \nClicking into the second tab of the \nNew Role\n page will display the permissions for that role.\nAble to Set \nThis controls the roles that a user can add or remove when configuring other users. Typically, only \nSystem Administrators\n are given rights to set all roles.\nAble to Activate\nThis controls the roles that a user must have before the current user can activate their user account.\nAble to Set Password\nThis controls the roles that a user must have before the current user can manually set their password. For example, if you are looking at a user who has the role \nApplicant, \nbut you can only set the password for the role \nResearcher, \nthen you will not be able to see or access the \nSet Password \nbutton from the \nApplicant \nuser's \nprofile\n. \nAble to Edit Email Address\nThis controls the roles that a user must have before the current user can edit their email address. For example, if you are looking at a user who has the role of \nApplicant, \nbut you can only edit the email address for those with the role \nResearcher, \nthen when you access the \nApplicant \nuser's \nprofile\n you will only be able to see a \nRead-Only \nversion of the Email Address \nstandard field\n. \nMenu Settings for Roles\nWhen you \nEdit \nan existing role, or after you create and \nSave \na new role, the page will reload and display a left hand menu that gives you access to different features of the role.\n \nMain\nThis will display the main details associated with the specific role, including the \nGeneral \npage of fields as well as the \nPermissions \nthat you can set for this role.\nCurrent Users\nThis will display a list of current users associated with this role. From the current user tab, you are able to \nadd or remove users\n. \nCustom Fields\nThis will display a list of the \nCustom Fields\n associated with this role. You are able to add new custom fields by simply clicking the \n+ icon \non the top of the list.\nPortal\nThis will allow you to enable the \nportal\n associated with this specific role. You are able to activate the role-specific portal, set its priority, set its logo, and a template if necessary. \nIf you enable the \nPortal \noption for this role, then a new \nMenu \ntab will display on the left hand side menu. \nMenu\nThis displays all the tools and features of the \nSmartSimple\n system that you can choose from to display for this role's \nmenu\n. Simply select the items that you do not want to appear and click \nSave.\nShortcuts\nShortcuts can be configured depending by role either by as a Common Shortcut (for all roles) or on individual basis (for specific roles). For more information, see \nShortcuts\n. \nReports\nThis will display a list of any \nReports\n that the role is associated with. \nNews Feed\nNews feed refers to any transactions or information pulled from integrations - for example, through OFAC check, \nTransactions\n, and more. For more information, see \nCategory: Integrations\n. \nRemove or Add from Current Users\nYou are also able to \nAdd \nor \nRemove \nusers in bulk when you access the \nCurrent Users \nsection of the role's \nEdit Page, \nusing the \nAdd User \nbutton.\n1. Click into the \nCurrent Users \ntab from the left hand side menu. The list of current users, if any, are displayed.\n2. Click the \n+ \nicon on the top left that will allow you to add new users to this role. \n3. The \nAdd User to Role \nscreen will launch, with \nSearch\n options including the ability to select certain roles as the results of the search. \n \nTip: \nIf this is a brand new \ninstance\n, there may be no users in any role - in that case change the role field in the search options to \nNo Role Assigned.\n \n4. Select all of the users that you would like to associate with this role.\n5. Click the \nAdd \nbutton. \nTo \nRemove Users from a Current Role, \nsimply go to the list of current users and select the names of the users who you would like to remove from the role. Once at least one user is selected, new buttons will appear at the top of the list that give you the ability to \nremove users. \n \nClick \nYes \nwhen the confirmation message appears if you are certain that you want to remove the selected user(s) from the role.  \nSee Also\n \nUser\n \nRoles and Security Settings\n \nSecurity Matrix\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=User_Role&oldid=40825\n’ \nCategory\n: \nRoles",
  "links": [
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Role_Based_Security",
    "https://wiki.smartsimple.com/wiki/Administration_Interface",
    "https://wiki.smartsimple.com/wiki/Portal",
    "https://wiki.smartsimple.com/wiki/Role_Based_Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Role_Permissions",
    "https://wiki.smartsimple.com/wiki/Importing_Organizations_or_Contacts_Association",
    "https://wiki.smartsimple.com/wiki/Associations",
    "https://wiki.smartsimple.com/wiki/UTA_role",
    "https://wiki.smartsimple.com/wiki/Workflows_Overview",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Importing_Organisation_Records",
    "https://wiki.smartsimple.com/wiki/Auto_Loader",
    "https://wiki.smartsimple.com/wiki/Portals",
    "https://wiki.smartsimple.com/wiki/Reports",
    "https://wiki.smartsimple.com/wiki/Security_Matrix",
    "https://wiki.smartsimple.com/wiki/Status_Lock",
    "https://wiki.smartsimple.com/wiki/Status_Lock",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Roles_and_Security_Settings",
    "https://wiki.smartsimple.com/wiki/Role_Formula",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/UTA_Roles",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/User_Role#Remove_or_Add_from_Current_Users",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Portals",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Portals#Shortcuts",
    "https://wiki.smartsimple.com/wiki/Reports",
    "https://wiki.smartsimple.com/wiki/Transactions",
    "https://wiki.smartsimple.com/wiki/Advanced_Search",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Roles_and_Security_Settings",
    "https://wiki.smartsimple.com/wiki/Security_Matrix"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/9/9c/Add_new_role.png",
    "https://wiki.smartsimple.com/images/1/12/New_role.png",
    "https://wiki.smartsimple.com/images/c/c2/Roleimage1.JPG",
    "https://wiki.smartsimple.com/images/b/b7/New_role_permissions.png",
    "https://wiki.smartsimple.com/images/7/70/Roles_side_menu.png",
    "https://wiki.smartsimple.com/images/0/0f/Add_user_to_role.png",
    "https://wiki.smartsimple.com/images/0/04/Remove_roles.png"
  ]
}