{
  "url": "https://wiki.smartsimple.com/wiki/Workflows",
  "title": "Workflows Overview",
  "content": "From SmartWiki\n(Redirected from \nWorkflows\n)\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguration – Essentials\n2.1\n \nCreate Workflow\n2.2\n \nCreate workflow tasks\n2.3\n \nCreate Workflow Connectors\n2.4\n \nEnable on Object\n2.4.1\n \nEnable Workflow on Company/User\n2.4.2\n \nEnable Workflow on Company/User Registration Page\n2.4.3\n \nEnable Status-Driven Workflow on UTA\n2.4.4\n \nEnable Workflow on UTA Type\n2.4.5\n \nEnable UTA Role / Company Assignment Workflow on UTA\n2.4.6\n \nEnable Workflow on File Upload field\n2.4.7\n \nEnable Workflow on SmartFolder\n3\n \nConfiguration – Advanced\n3.1\n \nSuppress Workflow Window\n3.2\n \nRecurring Workflow\n3.3\n \nTask Type specific configuration\n3.3.1\n \nTask Type: Acknowledgement\n3.3.2\n \nTask Type: Activate/Deactivate User\n3.3.3\n \nTask Type: Change Status\n3.3.4\n \nTask Type: Company Association\n3.3.5\n \nTask Type: Create Consumer/Provider Link\n3.3.6\n \nTask Type: Create New Activity\n3.3.7\n \nTask Type: Generate PDF File\n3.3.8\n \nTask Type: PDF Merge\n3.3.9\n \nTask Type: People Association\n3.3.10\n \nTask Type: Request for Approval / Request for Comment\n3.3.11\n \nTask Type: Select User for Next Task\n3.3.12\n \nTask Type: Signority Submission\n3.3.13\n \nTask Type: Trigger Workflow \n3.3.14\n \nTask Type: Update Company Category\n3.3.15\n \nTask Type: Update Custom Field Value\n3.3.16\n \nTask Type: Update Standard Field Value\n3.3.17\n \nTask Type: Update User Role\n3.3.18\n \nTask Type: Web Service - HTTP Request\n3.3.19\n \nTask Type: Web Service – SOAP Message\n3.3.20\n \nTask Type: Web Service - RESTful Request\n3.3.20.1\n \nRESTful Web Service Request using GET Method\n3.3.20.2\n \nRESTful Web Service Request using POST Method\n3.3.20.3\n \nCredentials of the RESTful Web Service Request\n3.3.20.4\n \nParsing JSON response\n3.3.21\n \nTask Type: Translate Field Value\n3.4\n \nImporting and Exporting Workflow Tasks\n3.5\n \nWorkflow Condition\n3.5.1\n \nWorkflow Condition Examples\n3.6\n \nUsing iCalendar to generate Meeting Requests, Tasks and Contact cards\n3.6.1\n \nievent Object\n3.6.2\n \nitodo Object\n3.6.3\n \nicard Object\n3.7\n \nTrigger a Workflow from a Custom Browser Script\n3.8\n \nUsing variables with workflows\n3.8.1\n \nPass parameters when workflow triggers another workflow\n3.8.2\n \nUsing variable syntax to select recipients for workflow tasks\n3.8.3\n \nNotes Workflow\n3.8.4\n \nPassword Variables\n3.9\n \nCC Email Syntax Options\n4\n \nUsing workflows\n4.1\n \nSearching or Sorting Workflows\n4.2\n \nWorkflow Requests\n4.3\n \nWorkflow Diagram\n4.4\n \nWorkflow Pending Queue\n4.5\n \nWorkflow History\n4.6\n \nWorkflows Triggered by a Given Entity\n4.7\n \nConfigure System to display Workflow options\n4.8\n \nReasons workflow messages aren't arriving\n4.9\n \nDetermining the Workflow ID\nOverview\nA Workflow is a set of repeatable steps used to automate and streamline your business processes within the system (e.g. creating review forms and notifying reviewers via email).\nWorkflows are created through the Global Settings tab and can be associated with any entity within the system, such as UTA objects, folders, organizations or users.\nWorkflows are constructed using two basic elements:\n Tasks: define the actions required in the workflow – each task represents a single step in the process. Specific roles or specific users are associated with each task, and these people will be automatically alerted when they need to perform the action defined by that task. These actions are generally used to accept, reject, or request a revision on the associated object, file, user or some application-specific information.\n Connectors: link tasks together, and provide for branching logic based on the user responses to the task or pre-set conditions.\nConfiguration – Essentials\nCreate Workflow\nFirst create and configure the workflow.\nNext add tasks and connectors.\nThe tasks available are dependent on the Workflow Type, so specify the desired type before adding tasks.\n1. Click the Menu Icon and under the System Processes , click the Workflows link.\n2. The Workflows page is displayed. This includes the following tabs:\n3. Workflows – click this tab to see list of workflows. The list includes the name, description, workflow type, Trigger, System Call Identifier and date last updated. In the top right of the action bar is a Category drop down. The list of workflows displayed under the Workflows tab is dependent on the Workflow Category selected. Use the \"All Workflows\" option to see all workflows.\n Tasks – click this tab to see a list of tasks for all workflows.\n Outstanding Tasks – click this tab to see a list of outstanding tasks for all workflows. This is where the workflow in question has been triggered, and the task has been scheduled for future completion date\n4. Click the New Workflow button to see the New Workflow page.\n5. Populate the Name field with a suitable a descriptive name for the workflow, and the Description field with a suitable narrative description for the workflow.\n6. you attempt to connect the workflow to the object.\nThe table below shows a list of available Workflow Types, the objects that each type is enabled on, and the Trigger When options as well as the Termination Trigger options.\nWorkflow Type\nEnabled On\nTrigger\nTermination\nRecurring\nN/A\nActivate\n button on Workflow\nDeactivate\n button on Workflow\nCompany\nCompany or Branch\nNew or Modified company or Branch\nN/A\nUser\nCompany or Branch\nNew or Modified user or contact\nN/A\nFile\nSmartFolder\nNew or Modified file in \nSmartFolder\nN/A\nApplicant Tracking\nAlways Available\nAssignment Status\nAssignment Status\nApplicant Assignment\nAlways Available\nAssignment Status\nAssignment Status\nContent Management\nAlways Available\nNew, Modified and On Demand\nN/A\nDocument Library\nAlways Available\nNew, Modified and On Demand\nN/A\nEmail Broadcast\nAlways Available\nNew, Modified and On Demand\nN/A\nJob Costing\nJob in Job Tracking or Applicant Tracking\nNew, Modified and On Demand\nN/A\nJob Tracking\nJob in Job Tracking or Applicant Tracking\nJob Status\nJob Status\nSales Tracking\nOpportunity\nOpportunity Status\nOpportunity Status\nSmart Folders\nN/A\nNew, Modified and On Demand\nN/A\nWeb Forms\nWeb Form\nNew or Modified Web Form\nN/A\nUniversal Tracking Application\nSelect the name of the relevant UTA\nUTA Template\nLevel 1 Status\nLevel 1 Status\nSingle File\n or \nMultiple Files\n Custom Field\n \nNote: Can be at any level within the selected \nUTA\nFile upload\nNote: Within the workflow set \nTrigger When\n to \n --Deactivate--\nN/A\nTracking Activities\nUTA Template\nLevel 2 Status\nLevel 2 Status\nTracking Activity Assignment\nUTA Template\nAddition of Level 2 Contact\nN/A\nTracking Sub-Activities\nUTA Template\nLevel 3 Status\nLevel 3 Status\nTransactions\nAlways available\nTransaction Status\nN/A\nNotes\nAlways Available\nNew, Modified and On Demand\nN/A\nUTA Role Assignment\nUTA Template\nContact Assignment at Level 1\n(with the \nRole\n specified) \nN/A\nUTA Company Assignment\nUTA Template\nCompany Assignment at Level 1\nN/A\n7. Set the Trigger When option. This determines when a new instance of the workflow should be started. The options available, are determined by the Workflow Type (see Workflow Types table above). The available options include:.\n The New option will only trigger when a new object is created.\n The Modified option will trigger the workflow when an existing object is changed.\n The On Demand option will trigger the workflow when called by a System Call or a browser script.\n The Status Change option found on the Company and User Workflow Type, will expose the statuses for the relevant company/user. The workflow will trigger when the company/user status is changed and saved.\n The Trigger When option will expose different options depending on the Workflow Type:\n UTA specific statuses when Workflow Type is UTA specific (e.g. Universal Tracking Application, Tracking Activities, Tracking Sub-Activities). The workflow will trigger when UTA level 1, 2 or 3 is created or updated to the selected status.\n Roles for assigning users or companies to an object when Workflow Type is User / Org assignment specific (e.g. UTA Role Assignment, UTA Company Assignment). The workflow will trigger when user/company is added to the object with the selected role.\n8. Set the Termination Trigger options if appropriate. This option is exposed for certain workflow types, including the UTA specific workflow types (see Workflow Types table above). If the entity changes to the status after the workflow has triggered, any Pending tasks are removed (not executed).\n9. Click the Save button. The workflow is saved and the Workflow ID is now populated. The following options appear in the action bar near the top of the screen:\n Back/Recently Visited – click this button to return to pages previous accessed.\n Workflows – click this button to return to the workflow list.\n New Task – click this button to create a new workflow task.\n Diagram – click this button to see a diagram view of the workflow.\n10. The following tabs are also now displayed:\n Task – click this tab to view workflow task and to edit tasks. Tasks are steps within the workflow.\n Pending Queue – click this tab to see a list of outstanding tasks for this workflow, you can delete tasks and reassign tasks to other contacts within the system.\n History - click this tab to see a list of completed tasks for this workflow.\nCreate workflow tasks\nOnce you have created the workflow you can add tasks, each task automates and streamlines some action or step in your business processes.\nThe process for adding a task to a workflow is as follows:\n1. Navigate to the desired workflow and click on the Tasks tab.\n2. Click the New task button in the action bar.\n3. The Task details are displayed, with a Task Number initially set to 100 and increasing in increments of 100 for each subsequent workflow task.\n4. Update Task Name then select the Task Type. The task type determines how the task should be processed. The available Task Types include:\n \nAcknowledgement\n - use to generate a message such as an email to appropriate users.\n \nRequest for Approval\n - use to generate action requirements that need an approval. These action requirements display in the \nWorkflow Requests\n area.\n \nRequest for Comment\n - use to generate comment requirements. These will be displayed in the \nWorkflow Requests\n area.\n \nChange Status\n - use to change the status of the object that triggered the workflow. There is no messaging on this task type.\n \nCreate Consumer/Provider Link\n - use to create Consumer/Provider relationship without custom scripting.\n \nCreate New Activity\n - use in Universal Tracking Application workflows, to create Level 2 records.\n \nUpdate Custom Field Value\n - use to update a custom field to an entered value.\n \nUpdate Standard Field Value\n - use to update a standard field to an entered value.\n \nSelect User for Next Task\n - use to pre-select the user that is responsible for a task that immediately follows this task type. This is necessary for tasks that will trigger at a later date.\n \nUser Activation\n - use to activate a contact as a user and send the credentials in order to log in. This is useful for project-type work when you only wish to activate a user as part of a project.\n \nGenerate PDF File\n - use for automatic generation of a PDF that will be emailed to the person(s) designated in the workflow step.\n \nPeople Association\n - use to add either pre-defined, or user selected, contact(s) to the contacts section of a Level 1 record with a given role.\n \nCompany Association\n - use to add either pre-defined, or user selected, companies to the Account section of a Level 1 record with a given category.\n \nActivate/Deactivate User\n - use to set the access type of a user or remove access.\n \nUpdate User Role\n - use to add or remove selected roles from a user.\n \nUpdate Company Category\n - use to add or remove selected categories from a company.\n \nWeb Service - HTTP Request\n - use to send the HTTP Post web service request via a workflow step to retrieve a web service response.\n \nWeb Service - SOAP Message\n - use to pass information to a system outside of SmartSimple as a Web Services call.\n \nWeb Service - RESTful Request\n - use to consume Restful web service request via a workflow step to get/post a web service response.\n \nTrigger Workflow\n - use to trigger a different workflow against a specified object.\n \nSignority Submission\n - use to trigger Signority signing process.\n \nRetrieve Latitude / Longitude\n - use to retrieve Latitude and Longitude values without need to save the object itself\n \nTranslate Field Values\n - use to automatically translate records and field values in the system\nThe Task Types available will vary depending on the Workflow Type selected. The following matrix displays Workflow Task Types availability for Workflow Types.\nThe following matrix displays which \nWorkflow Task Types\n are available for which \nWorkflow Types\n.\nscope row Move Object\nWorkflow Task Type Available?\nWorkflow Types\nRecurring\nCompany\nUser\nFile\nApplicant Tracking\nJob Tracking\nSales Tracking\nSmart Folders\nWeb Forms\nUniversal Tracking Application\nTracking Activities\nTracking Activity Assignment\nTracking Sub-Activities\nTransactions\nNotes\nUTA Role Assignment\nUTA Company Assignment\nAcknowledgement\nActivate/Deactivate User\nChange Status\nCreate New Activity\nGenerate PDF File\nPDF Merge\nPeople Association\nRequest for Approval\nRequest for Comment\nSelect User for Next Task\nTrigger Workflow\nUpdate Custom Field Value\nUpdate Standard Field Value\nUpdate User Role\nUpdate Company Category\nUser Activation\nWeb Service - HTTP Request\nWeb Service - SOAP Message\nWeb Service - RESTful Request\nRetrieve Latitude / Longtitude\nTranslate Field Values\n5. Set the \nName\n of the Task as appropriate.\n6. Populate the Description field if required.\n7. Click Save at the bottom of the page.\nNOTE: There are a number of other settings specific to the Task Type selected. These are covered in the individual entries specific to each Task Type within the Configuring - Advanced section.\n8. Click on the Back button to return to the Edit Workflow screen.\n9. The Task is listed, but without Connectors, the task will not be executed if the workflow is triggered.\nCreate Workflow Connectors\nAll tasks must be connected to other tasks or to the start and complete before they will execute.\nThe connectors control when the next steps execute and control what the next steps are (based on defined conditions).\n1. Navigate to the desired workflow and click on the Task tab.\n2. Inside the list of tasks, click the New button in the row preceding the task you wish to connect. In the example below the preceding task may be the Start option, but it could also be a preceding Task.\n3. The New Connector modal window launches with number of options.\nThe available options include:\n \nName\n - use to enter a descriptive name for the connector\n \nTrigger Type\n - use to select Default or Expired options\n \nConnect To\n - use to select what you want to connect. All tasks within the workflow appear, alongside the Start and Complete options. Also, there will be a list of other workflows in the system.\n \nTrigger Date\n - use to define a trigger date. The connector triggers, when the date matches the selected date.\n \nTrigger Date\n - The date the task is triggers.\n \nStart Date\n - The date in the Start Date field of the record with which the workflow is associated.\n \nEnd Date\n - The date in the End Date field of the record with which the workflow is associated.\n \nCustom Date Field\n - The date in a selected custom field that stores date values.\n \nDelay(s)\n - user can specify any delays based on the trigger date:\n If the value 1 is entered, and use selects the time frame of Day with no Trigger Time selected, then the task will trigger 24 hours after the defined Trigger Date.\n If the value 1 is entered, and use selects the time frame of Hour, then the task will trigger 1 hour after the defined Trigger Date.\n If the value -1 entered, and use selects the time frame of Day with no Trigger Time selected, then the task will trigger 24 hours before the defined Trigger Date.\n \nTrigger Time\n – allow relevant when a delay is scheduled with the Day option selected. The drop-downs to allow users to specify what time the task should be trigger.\n \nBusiness Day Only\n - toggle on to take into account the normal working week, and statutory holidays when determining dates and delays.\n \nHoliday Calendar Used\n - used to select a custom calendar. Holiday calendars can be created and used when you specify which days are Business Days for your community instead of using the predefined Business Days Only option.\n \nRequired Respondents\n - use to specify how many people must complete an action before the workflow moves to the next task.\n \nType Filter\n - lookup to select L1, L2, or L3 types, which will then act as the type condition\n \nStatus Filter\n - Lookup to select L1, L2, or L3 statuses, which will then act as the status condition\n \nCondition\n - use to specify a logical condition that must be met before a connector triggers the next workflow task. Multiple connectors can be set up with mutually exclusive conditions to have branching logic on the workflow.\n4. Complete as appropriate and click Save at the bottom of the screen.\n5. Click the New button in the desired row for the task you wish to connect and connect to a proceeding task, the Complete option or to another workflow entirely. Click Save when finished.\n6. Go back to the General tab and click Save once all connectors have been defined. When the page refreshes then the connectors should be displayed.\nWhen you create a Workflow with a delay connector, the recipients of the subsequent task are processed at the time the workflow is triggered and NOT at the time it runs. In other words, the tasks on the workflow, such as generating an email, are processed before the delay, not at the end of the delay.\nIf the recipients change between the time the workflow is initiated and the time it fires (based on the delay) the recipients will not be updated. To ensure recipients are evaluated at the time the workflow task fires, insert a blank task after the delay connector (i.e. an Acknowledgement workflow with no recipients), then flow into a new Workflow Task with the desired recipients.\nExample scenario:\n A workflow is configured to wait 5 days and then mail all contacts attached to the Level 1 with role Reviewer.\n That workflow is triggered against a specific Level 1 record which has three contacts in the contacts section with the role Reviewer.\n After the workflow has been triggered, before the 5 days have gone by, two additional Reviewers are added to the contacts section, and one of the original three is removed.\n If the Acknowledgement task is attached directly after the connector with the delay then the original three contacts will receive the email, even though they are no longer current.\n If there is a blank workflow task following the connector with the delay, which flows into a workflow task configured to email all Level 1 contacts with the role Reviewer, then the four reviewers on the Level 1 record at the time the email is sent, will be emailed, rather than the original three reviewers.\nEnable on Object\nEnable Workflow on Company/User\nWorkflows must be enabled against an organization before workflows will run against the organization itself, its sub-branches and the users within the organization and its sub-branches.\nIf the current User has the Workflows - Attach Workflow to Company System Feature Permission enabled then they will see 2 drop-downs on an organization profile\n \nCompany Workflow\n - which lists all Workflows with a Workflow Type of Company. Only a single company workflow can be selected per Company\n \nUser Workflow\n - which lists all Workflows with a Workflow Type of User. Only a single User workflow can be selected per Company\nThe way the selected Company workflow will execute will depend on the Trigger Type:\n If \nNew\n is selected the Workflow will only be triggered when a new Company is created.\n If \nModified\n is selected the Workflow will be triggered when a new Company is created, and when an existing Company is modified.\nThe way the selected User workflow will execute will depend on the Trigger Type:\n If \nNew\n is selected the Workflow will only be triggered when a new User or Contact is created.\n If \nModified\n is selected the Workflow will be triggered when a new User/Contact is created, and when an existing User/Contact is modified.\nEnable Workflow on Company/User Registration Page\nThis feature enables a Workflow to trigger on a Company/User registration page.\nAn example use would be sending an email to an employee every time a new company registers so that they can verify the information entered for the company.\nCompany/User registration Workflows will override other new and modified status-based Workflows. We recommended Workflows triggered from Sign Up pages be On Demand.\nEvery sign-up page has an Attach Workflow drop-down menu where users can choose the Workflow they want triggered from the sign up page.\nEnable Status-Driven Workflow on UTA\nStatus-driven workflows can be triggered from all levels of a UTA if workflows have been enabled on the types . To enable workflows for a type do the following:\n1. In your desired \nUTA\n, click \nConfiguration Settings\n. Click on the level 1 tab, Click on \nTypes\n. A list of types is displayed.\n2. Click the \nEdit\n (pencil icon) button on the desired type The template details are displayed.\n \nEnable Applications/Activities Workflow on a template settings page.\n3. To enable workflows for the Level 1 items, toggle\n Enable Applications Workflow\n to on position.\n4. To enable workflows for the Level 2 and 3 activities, toggle\n Enable Activities Workflow\n to on position.\n5. Click \nSave\n.\nNote\n: Upon creation of new templates, both \nEnable Applications Workflow \nand\n Enable Activities Workflow\n are enabled by default\n.\nEnable Workflow on UTA Type\nLevel 1/2/3 Types can be configured to trigger a unique workflow whenever a new item using this template type is added.\nGo to configuration settings, choose the desired tab (level 1/2/3) click the types link, edit the desired type and click on the Template Page tab.\nIn the Workflow drop-down, select the appropriate workflow and then click Save.\nEnable UTA Role / Company Assignment Workflow on UTA\nIf you wish to trigger a UTA Contact Assignment Workflow or a UTA Company Assignment Workflow from a UTA level 1 record then you must have configured the \nLevel 1 Type\n settings.\nEach Level 1 \nType\n page has the following 2 options in the \nProcess\n tab:\n \nAvailable Contact Assignment Workflow\n - use to define one or more UTA Role Assignment Workflows that are triggered by this type .\n \nAvailable Company Assignment Workflow\n - use to define one or more UTA Company Assignment Workflows that are triggered by this type.\nEnable Workflow on File Upload field\nTo trigger a workflow when a file is uploaded to a Link - Single File or Link - Multiple Files Custom Field scroll down to the File Options section. For Workflow on Upload select the desired workflow and save .\nIf the file upload Custom Field is located at Level 2 or Level 3, you can select Tracking Activities or Tracking Sub-Activities Workflow Types.\nIf the file Custom Field is located on a Company or User you can select Company or User Workflow Types.\nNOTE: The Workflow is only triggered when I file is uploaded, it is not triggered by file deletions.\nEnable Workflow on SmartFolder\nTo trigger a workflow when a file is uploaded into a SmartFolder navigate to the desired SmartFolder.\nClick the Folder Settings button (looks like a gear).\nFor Workflows select the desired work flow (all workflows of the Type File will be displayed) and click save.\nConfiguration – Advanced\nSuppress Workflow Window\nWhen a workflow step is executed the user is generally presented with a Workflow window where they can select a value that will be used to determine the next task to be performed.\nThis feature is vital for workflows that require user interventions, but is not required for workflows that are used to simply send an instant message or email message to one or more users.\nIf the User has a pop-up stopper/blocker enabled within their browser, the Workflow Window will be suppressed and the Workflow will not trigger. You must ensure that users of workflows that prompt their\nWorkflow Window, have enabled pop-up window display for your instance of SmartSimple.\nIf you wish to suppress the display of this window you can change the workflow settings as follows:\n1. Go to the menu icon and under System Process click Workflows.\n2. Click the edit button on the desired Workflow.\n3. For Workflow Window enable the Suppress option.\n4. Click Save.\nNOTE: If you do not require a user interventions in your workflows it is recommended that the Workflow window be suppressed to ensure workflows execute as you may have little control over user browser settings.\nRecurring Workflow\nA recurring workflow is a Workflow that is not triggered against any particular object.\nA recurring workflows ability to use variables is limited, but recurring workflows are useful for tasks that recur at regular intervals, such as a weekly reminder e-mail.\nWhen using a recurring workflow, the tasks must be connected in a loop, and there must be at least one connector with a delay. Otherwise, the workflow would endlessly loop.\nIf the workflow is set to look endlessly (without a delay), the system will automatically stop processing any workflows configured this way, after five loops.\nOnce you have configured the Workflow, the Activate button can be used to start the workflow. Once activated, a Deactivate button will be visible that can be used to stop the workflow.\nIf you wish to have a recurring workflow send an e-mail on a particular day or days of the month, you can use the following conditions:\n date_format(now(),\"%d\")=\"01\" - Will be true only on the 1st of the month\n date_format(now(),\"%d\") in (\"01\",\"15\") - Will be true on the 1st and 15th of the month.\nYou will need to configure an empty task (i.e. an Acknowledgement with no recipients) to manage the branching based on the date, and an empty task to manage the one-day delay so the workflow will loop daily and connect to the task that sends the e-mail on the appropriate day(s).\nThe Workflow Connectors attached to the \"Empty Task for Branching\" should have the following Conditions:\nTask Type specific configuration\nEach available task type represents a different type of action and has different configurations needs as a result.\nThis section discusses the specific configuration needs for the different tasks types\nTask Type: Acknowledgement\nAcknowledgements use this Task to send messages to users in SmartSimple.\nAcknowledgement Tasks have the following settings:\n \nName\n - name for the task.\n \nTask Type\n - manually set to Acknowledgment\n \nTask Number\n - a system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location, but order or execution of tasks is determined by the Connectors.\n \nDescription\n - optional description of the task.\n \nExpire After\n - intended duration of the workflow.\n \nMessage Template: Message Type\n - Type of message – e-mail, instant message, both, or none required with this task. E-mail and instant messages can be created using variables that will create custom messages specific to instances of the workflow. Options are No Message Required (default), Quick Message, Email Only and Quick Message and Email.\n \nMessage Template: From Address - Email\naddress sent from. This field accepts variables, so you can either hard-code a value (i.e. donotreply@mycompany.com) or use variable syntax (i.e., on a Level 1 Workflow, @owner.email@)\n \nMessage Template: CC Email Address\n - CC recipients address. (Separate multiple addresses with commas). Additional Email Syntax options can be used within this field.\n \nMessage Template: Email Body Format\n - Options are Plain Text or HTML.\n \nMessage Template: Email Message Header\n - The email header can be modified using the following syntax, with the arguments separated by semicolon:\n X-Priority={1,2,3,4,5}\n Priority={normal,urgent,non-urgent}\n Importance={high,normal,low}\n Sensitivity={personal,private,company,confidential}\n e.g. Priority=urgent;Importance=high\n \nMessage Template: Subject\n - Narrative subject line of the message.\n \nMessage Template: Body\n - Narrative body of the message.\n \nMessage Template: Attach Object\n - Attaches the details of the object to the message. In the case of a SmartSimple object, such as a company, person, or application, the textual details of the object will be added. If the object is a file, then the file will be attached to an e-mail message, but not an instant message.\n \nMessage Template: Attachment File IDs\n - Attach additional default files when triggered from a Smart Folder. See the Determining the File ID article for instructions.\n \nMessage Template: Save as Event\n - will create an e-mail activity. If it’s L1/L2 workflow, where the UTA L2/L3 Email Activity settings have been configured, then it will be saved as L2/L3 event under the L1/L2 object. Otherwise it will be saved as user event against each recipient.\n \nRouting: Use Variable for Recipients\n - Allows recipients of the message to be selected using variables.\n \nRouting: Use UTA Role\n - When using roles to select recipients, the UTA Role can be used to determine recipients. Only appears if workflow is UTA specific.\n \nRouting: Role\n - Used to select recipients by role. This list includes all roles configured in the system, alongside the built-in roles that can be used in a workflow:\n The Originator role is used to reference the name of the person that started the workflow. This could be the person that submitted an expense claim, added a file to a workflow or added a new employee. :*The Initiator role is used to reference the name of the person that initiated the current task in the workflow. This refers to the person that approved the current step of an expense claim, or reviewed a document loaded into a workflow enabled Smart Folder.\n The Owner role is used to reference the user assigned as the Owner of the record.\n The People role is used to reference the user assigned as the Person on the level one. This role is only available to Level One specific tasks.\n The Assigned Users role is used to send messaging to users who are in the Assigned field of a Level Two activity. This role is only available for Level Two workflows.\nOnce the role has been selected the following recipient choices are available:\n Let the current user select target user from this role – When the workflow is triggered, the user will be prompted to select recipients from the list of users currently in the role.\n All Users of this role – The message will be sent to all users in the selected role.\n Selectable list of users currently in the role – The message is sent to the specific users that are selected.\n \nRouting: Selected Users\n - details of the users configured as Recipients in the Role section\n \nRouting Options\n - Specifies the types of options available to process this workflow step. In many instances, the default options can be used, such as Approved, Rejected or Revise. But additional and alternate sets of options can be created to reflect more complex business processes.\nTask Type: Activate/Deactivate User\nThis type of Workflow task is used to set the access type for a user or to deactivate a user.\nNo message accompanies this workflow task. If you wish to notify users of a change in access type, for example to notify activated users of their password, you can configure an Acknowledgement type workflow task to follow this step in the workflow.\nActivate/Deactivate User Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Type\n - manually set to Activate / Deactivate User.\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nOption\n - Sets the access type for the user against which the workflow is triggered. Options are:\n \nActivate (Administrative or Portal Interface)\n - Provides access to the system to the extent permitted through the user's membership of specific roles.\n \nActivate (User Centric or Applicant Interface)\n – Only provides access through the User Centric Interface and Applicant Tracking “career sites”.\n \nActivate (Web Service Client Access)\n - Account type used to access data in a SmartSimple instance via an API (Application Programming Interface). Does not give access to SmartSimple interface directly.\n \nDeactivate (No Access)\n – User cannot log into the system.\nTask Type: Change Status\nChange Status Workflow Task Types change the status of the object that triggered the workflow. There is no messaging on this task type.\nChange Status Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Type\n - manually set to Change Status\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nChange Status To\n - lists statuses from the selected UTA level. This workflow task will change the status of the object that triggered the workflow to the selected status.\nTask Type: Company Association\nYou can use the Company Association Workflow Task Type to automatically add, remove or update one or more companies to a Level 1 record. They will be assigned to the record with the UTA category defined in the \"Roles will be assigned\" setting.\nCompany Association Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Type\n - manually set to Company Association\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nUse Variables for companies\n - Allows user to use syntax to reference the company IDs\n \nAction\n - Add, update or delete the company association\n \nCompanies\n - use Lookup to select the Companies that will be added.\n \nRoles will be Assigned\n - select the categories that you want the companies to be assigned with. To assign different companies with different categories, you will have to create more than one Company Association task.\nTask Type: Create Consumer/Provider Link\nConsumer/Provider Link Workflow Task Type creates Consumer/Provider relationships, and is only available to Level 1 and Level 2 workflows.\nConsumer/Provider Tasks have the following settings, all of which control how the target record is linked to the record triggering the workflow:\n \nName\n - Narrative name for the task.\n \nTask Type\n - manually set to Create Consumer/Provider Link\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nConnection Type\n - Select whether the link will be a Consumer or Provider\n \nConnection Application\n - Select the UTA being connected\n \nConnection Level\n - Choose the connection level (Level One or Level Two)\n \nObject ID / Variable\n - Enter the Record ID (or a variable to obtain the Record ID of the object to connect to). It accepts semicolon separated lists.\n \nConnection Role\n - Select the Consumer UTA Connection role to be used for the connection\nTask Type: Create New Activity\nYou can use the Create New Activity Workflow Task Type to automatically create and attach one or more Level 2 records to a Level 1 record. This workflow can be driven by a Status change on the Level 1 record. The workflow will also trigger (in this sequence):\n1. Auto-assignments\n2. Level 2 Formulas\n3. Level 2 Workflows\nNew Activity Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Type\n - manually set to Create New Activity\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional)\n \nExpire After\n - Intended duration of the workflow.\n \nActivity Scheduling Options\n - drop-down with 3 options (Disable, Schedule by Date and Amount, Schedule by Number of Activities) that can be used to create multiple instances of the Activity.\n If \nSchedule by Date and Amount\n option is selected then following settings are exposed.\n \nStart Date\n: Level 1 field used to set the start date of the activity scheduling period\n \nEnd Date\n: Level 1 field used to set the end date of the activity scheduling period\n \nSchedule Every\n: frequency of scheduling\n \nTotal Amount\n: Level 1 field used for the Total Amount to be distributed. The amount specified will be split evenly between each Level 2. If 'N/A' is selected, the Level 2s will be created without an amount.\n \nActivity Date\n: Level 2 field used to set the date to be assigned to each record based on the scheduling options.\"\n \nActivity Amount\n: Level 2 field used to store the calculated amount for each record. If 'N/A' is selected, the Level 2s will be created without an amount.\n \nActivity Index\n: Level 2 field used to store the index number of each record. If 'N/A' is selected, the Level 2s will be created without an index number.\"\n If \nSchedule by Number of Activities\n option is selected then following settings are exposed.\n \nNumber of Activities\n: Level 1 field used to set the number of activities to be created\n \nActivity Index\n: Level 2 field used to store the index number of each record. If 'N/A' is selected, the Level 2s will be created without an index number.\"\nDays Delay\n - Number in days of delay before creation of new activity. If left blank, the new activity will be created immediately.\n \nCreate for Users in UTA Role\n - select the UTA Role of the users that the Peer Activity should be created against.\n \nActivity Type\n - This is where you specify which Level 2 Type you wish to create. If you select the Custom Field option then a Custom Field ID field is exposed.\n \nCustom Field ID\n - The Create New Activity workflow can be driven by a Custom Field. For example, you could have check boxes at Level 1 corresponding to various Level 2 Types. Selecting each check box would create and attach the relevant Level 2 activity type. You must first create a Custom Field on the Level 1 record which stores the typeid(s) of the Level 2 Types to be created. To create multiple Level 2 records use one of the Select many field types (e.g. Select Many – Check Boxes, Select Many – Scrolling Check Box, Select Many – List Box) and to create a single Level 2 record use the Select One – Combo Box.\n \nActivity Status\n - Allows you to define the Status for the newly created Level 2 record(s). Note: If that Level 2 Status has a workflow attached to it the workflow will be triggered at the point of creation of the Level 2 record.\n \nReminder Type\n - You can select whether a Quick Message or reminder email will be sent out to the Owner or contacts attached to the record, or any combination of the above.\n \nReminder Days\n - Sets delay for reminder message being sent.\nTask Type: Generate PDF File\nAuto generation of a PDF that can be:\n E-mailed to the person(s) designated in the workflow step.\n Stored within a Multiple Files Custom Field.\nThe PDF generated must be based upon a Web Page View Custom Field. You must specify the Custom Field ID of the Web Page View to be converted in the Web Page Field ID field on the Workflow Task settings.\nMultiple PDFs can be created and stored in a single Link - Multiple Files custom field using this workflow task type, by entering the Custom Field IDs of the Web Page View fields, separated by commas.\nTo store the PDF, specify the field ID of the Link - Multiple Files custom field in the Store to Field ID field on the Workflow Task settings.\nThe field you are storing too does not need to be on the same object. The syntax @parent.Field Name.id@ allows the workflow to store a level two web page view to the parent record.\nGenerate PDF File Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Type\n - manually set to Create Consumer/Provider Link\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nWeb Page Field ID\n - Must contain the Custom Field ID of the Web Page View to be converted into PDF format. To create multiple PDFs, enter the Custom Field IDs of the Web Page View fields in the Web Page Field ID# setting of the Workflow Task, separated by commas.\n \nStore to Field ID\n - If PDF file should also be stored to the record, must contain the Custom Field ID of the relevant Link - Multiple Files custom field.\n \nPDF Render Language\n - If a language is specified, the language option will be applied to the PDF generated\n \nMessage Template: Message Type\n - Type of message – e-mail, instant message, both, or none required with this task. E-mail and instant messages can be created using variables that will create custom messages specific to instances of the workflow. Options are No Message Required (default), Quick Message, Email Only and Quick Message and Email.\n \nMessage Template: Message Type\n - Type of message – e-mail, instant message, both, or none required with this task. E-mail and instant messages can be created using variables that will create custom messages specific to instances of the workflow. Options are No Message Required (default), Quick Message, Email Only and Quick Message and Email.\n \nMessage Template: From Address - Email\naddress sent from. This field accepts variables, so you can either hard-code a value (i.e. donotreply@mycompany.com) or use variable syntax (i.e., on a Level 1 Workflow, @owner.email@)\n \nMessage Template: CC Email Address\n - CC recipients address. (Separate multiple addresses with commas). Additional Email Syntax options can be used within this field.\n \nMessage Template: Email Body Format\n - Options are Plain Text or HTML.\n \nMessage Template: Email Message Header\n - The email header can be modified using the following syntax, with the arguments separated by semicolon:\n X-Priority={1,2,3,4,5}\n Priority={normal,urgent,non-urgent}\n Importance={high,normal,low}\n Sensitivity={personal,private,company,confidential}\n e.g. Priority=urgent;Importance=high\n \nMessage Template: Subject\n - Narrative subject line of the message.\n \nMessage Template: Body\n - Narrative body of the message.\n \nMessage Template: Attach Object\n - Attaches the details of the object to the message. In the case of a SmartSimple object, such as a company, person, or application, the textual details of the object will be added. If the object is a file, then the file will be attached to an e-mail message, but not an instant message.\n \nMessage Template: Attachment File IDs\n - Attach additional default files when triggered from a Smart Folder. See the Determining the File ID article for instructions.\n \nMessage Template: Save as Event\n - will create an e-mail activity. If it’s L1/L2 workflow, where the UTA L2/L3 Email Activity settings have been configured, then it will be saved as L2/L3 event under the L1/L2 object. Otherwise it will be saved as user event against each recipient.\n \nRouting: Use Variable for Recipients\n - Allows recipients of the message to be selected using variables. See this article for configuration details.\n \nRouting: Use UTA Role\n - When using roles to select recipients, the UTA Role can be used to determine recipients.\n \nRouting: Role\n - Used to select recipients by role.\n \nRouting: Selected Users\n - If required, specific users can be selected to complete this task. This technique restricts the number of users that the initiator can select.\n \nRouting: Routing Options\n - Specifies the types of options available to process this workflow step. In many instances, the default options can be used, such as Approved, Rejected or Revise. But additional and alternate sets of options can be created to reflect more complex business processes.\nTask Type: PDF Merge\nWill convert \nWord Merge\n document to a PDF which can then be:\n E-mailed to the person(s) designated in the workflow step.\n Stored within a Multiple Files Custom Field\nThe PDF generated must be based upon a \nWord Merge\n Custom Field. You must specify the Custom Field ID of the MS Word Merge document to be converted in the MSWord Merge Field ID field on the Workflow Task settings.\nTo store the PDF, specify the field ID of the Link - Multiple Files custom field in the Store to Field ID field on the Workflow Task settings.\nThe field you are storing too does not need to be on the same object. The syntax @parent.Field Name.id@ allows the workflow to store a level two web page view to the parent record.\nGenerate PDF File Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Type\n - manually set to Create Consumer/Provider Link\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nMSWord Merge Field ID\n - Must contain the Custom Field ID of the Web Page View to be converted into PDF format. To create multiple PDFs, enter the Custom Field IDs of the Web Page View fields in the Web Page Field ID# setting of the Workflow Task, separated by commas.\n \nStore to Field ID\n - If PDF file should also be stored to the record, must contain the Custom Field ID of the relevant Link - Multiple Files custom field.\n \nPDF Render Language\n - If a language is specified, the language option will be applied to the PDF generated\n \nMessage Template: Message Type\n - Type of message – e-mail, instant message, both, or none required with this task. E-mail and instant messages can be created using variables that will create custom messages specific to instances of the workflow. Options are No Message Required (default), Quick Message, Email Only and Quick Message and Email.\n \nMessage Template: Message Type\n - Type of message – e-mail, instant message, both, or none required with this task. E-mail and instant messages can be created using variables that will create custom messages specific to instances of the workflow. Options are No Message Required (default), Quick Message, Email Only and Quick Message and Email.\n \nMessage Template: From Address - Email\naddress sent from. This field accepts variables, so you can either hard-code a value (i.e. donotreply@mycompany.com) or use variable syntax (i.e., on a Level 1 Workflow, @owner.email@)\n \nMessage Template: CC Email Address\n - CC recipients address. (Separate multiple addresses with commas). Additional Email Syntax options can be used within this field.\n \nMessage Template: Email Body Format\n - Options are Plain Text or HTML.\n \nMessage Template: Email Message Header\n - The email header can be modified using the following syntax, with the arguments separated by semicolon:\n X-Priority={1,2,3,4,5}\n Priority={normal,urgent,non-urgent}\n Importance={high,normal,low}\n Sensitivity={personal,private,company,confidential}\n e.g. Priority=urgent;Importance=high\n \nMessage Template: Subject\n - Narrative subject line of the message.\n \nMessage Template: Body\n - Narrative body of the message.\n \nMessage Template: Attach Object\n - Attaches the details of the object to the message. In the case of a SmartSimple object, such as a company, person, or application, the textual details of the object will be added. If the object is a file, then the file will be attached to an e-mail message, but not an instant message.\n \nMessage Template: Attachment File IDs\n - Attach additional default files when triggered from a Smart Folder. See the Determining the File ID article for instructions.\n \nMessage Template: Save as Event\n - will create an e-mail activity. If it’s L1/L2 workflow, where the UTA L2/L3 Email Activity settings have been configured, then it will be saved as L2/L3 event under the L1/L2 object. Otherwise it will be saved as user event against each recipient.\n \nRouting: Use Variable for Recipients\n - Allows recipients of the message to be selected using variables. See this article for configuration details.\n \nRouting: Use UTA Role\n - When using roles to select recipients, the UTA Role can be used to determine recipients.\n \nRouting: Role\n - Used to select recipients by role.\n \nRouting: Selected Users\n - If required, specific users can be selected to complete this task. This technique restricts the number of users that the initiator can select.\n \nRouting: Routing Options\n - Specifies the types of options available to process this workflow step. In many instances, the default options can be used, such as Approved, Rejected or Revise. But additional and alternate sets of options can be created to reflect more complex business processes.\nTask Type: People Association\nYou can use the People Association Workflow Task Type to automatically add one or more contacts to a Level 1 record. They will be assigned to the record with the UTA role defined in the \"Roles will be assigned\" setting.\nPeople Association have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Type\n - manually set to People Association\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nAction\n: Add, update or delete the people association\n \nRouting: Use Variable for Recipients\n - Allows recipients of the message to be selected using variables. This is discussed in greater detail in the Configuration – Advanced section.\n \nRouting: Use UTA Role\n - When using roles to select recipients, the UTA Role can be used to determine recipients.\n \nRouting: Role\n - Used to control role of user that will be associated.\n \nRouting: Selected Users\n - If required, specific users can be selected to be associated\n \nRoles will be Assigned\n - select the role(s) that you want the contact(s) to be associated with. To assign different contacts with different roles, you will have to create more than one People Association task.\nIn the Routing section select a Role currently possessed by the contact(s) you wish to add, whether this is a system role or a UTA role. You can then either select specific contacts or groups that will always be added to the Level 1 when the workflow is triggered, or you can choose Let current user select target user from this role to allow the person that triggers the workflow to select a contact to be added.\nNote:\n If you are allowing the current user to select target user Suppress Workflow Window must be off (not enabled) otherwise the workflow will not fire.\n If you are allowing the current user to select target user, the Workflow must be triggered by a status, and not by a script.\n Include a description, as the description will be presented to the user when they are asked to select the contact to be assigned.\nIn order to notify the contact(s) that they have been assigned you can create a subsequent Acknowledgement Workflow Task to e-mail all contacts with the UTA role you selected.\nTask Type: Request for Approval / Request for Comment\nBoth of these Workflow Task Types prompt users to review the work of others, and keep track of outstanding reviews on the \nWorkflow Requests\n page.\nThe settings for both of these Workflow Task Types match those used for the Acknowledgment task except for 2 additional settings:\n \nRespondents\n - Indicates the number of respondents required for this approval.\n \nAllow Edit\n - Allows editing of the attached object.\nBy default, a Request for Approval or Comment workflow task will move on to the next task (whether approved, rejected, etc.) as soon as the first recipient of the Workflow Task responds. The Respondents field allows a specific number of respondents to be required, which will keep the Request for Comment Task active until that number of respondents has replied.\nThe Routing options field is used as part of the Request for Approval process. Users should enter appropriate options within the Routing Options section(Example: 10=approved;20=reject;30=Revise) and click Save.\nThese Routing Options will then be available in the Trigger Type drop-down when configuring Connectors. It is suggested that each routing option should have a corresponding task so that the routing option can then be connected to an appropriate task.\nYou must set the minimum number of respondents on the connector associated with each of the approval options.\n If you have selected three respondents on the Request for Approval Task, and the task should only pass if all three respondents click approve you would set the number of respondents on the Approve connector to be three, and the number of respondents on the Reject connector to be one.\n If you have selected four respondents on the Request for Approval Task, and the task should only pass if three respondents click \"Approve,\" you would set the number of respondents on the Approve connector to be three, and the number of respondents on the Reject connector to be two.\nThe system checks the connectors once the number of respondents on the task has been met, this behaviour is not configurable. The first connector the system checks will be taken if the requirements are met.\nYou must ensure the Workflow Task is sent to enough people to meet the minimum number of respondents required, if you do not send the task to enough recipients the task would never complete.\nTask Type: Select User for Next Task\nThis task type used to allow the current user to pre-select the user that is responsible for the task that immediately follows this task type.\nThis is necessary for tasks that will trigger at a later date.\nFor example, consider a Workflow that is triggered on the status of Escalated which is configured to send a reminder e-mail to a manager if the status has not changed for seven days. If the reminder e-mail workflow task has Let current user select target user from this role as the recipient the Workflow would fail. This is because the e-mail is triggered (seven days later) by the system, and there is no current user.\nThe settings for this Workflow Task Types match those used for the Acknowledgment task. The only difference if that the Request with the Routing options.\nTask Type: Signority Submission\nYou can use the Signority Submission Workflow Task Type to automatically trigger the Signority signing process via workflow.\nSignority Submission Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nSignority Field\n - drop-down which lists all Signority enabled WPV fields for the entity the workflow is configured against.\nTask Type: Trigger Workflow \nYou can use the Trigger Workflow tasks to trigger a different workflow.\nTrigger Workflow Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nTrigger Workflow\n - Select the workflow that should be triggered from this dropdown menu.\n \nRecord id / Variable\n - this setting should contain the unique record ID for the record against which the selected workflow should be triggered. This record ID can be referenced using variables.\n Examples: If the workflow to be triggered is a User type workflow, you would need to provide a User ID for the contact record against which you would want the workflow to be triggered.\n If the workflow is to be triggered against a series of Level 2s attached to a Level 1 record, you could use List Syntax to define a list of activities meeting certain criteria against which the workflow should be triggered.\nTask Type: Update Company Category\nUpdate User Role Workflow Task Types can add or remove categories from SmartSimple organizations.\nThis task type is only available for \"Company\" workflows.\nUpdate Company Category Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nOption\n - options are Add or Remove. This determines whether the task will add or remove categories from the organization upon which the workflow is triggered.\n \nCategories\n - select the categories that should be added or removed from the organization's profile.\nTask Type: Update Custom Field Value\nThe Update Custom Field Value workflow task type can be used to write values to custom fields on the object against which the Workflow is triggered.\nThese values can be hard-coded or they can use variables.\nYou can also use MySQL syntax to manipulate values using sscalculation.\nUpdate Custom Field Value Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nUse Field\n - lists custom fields across all UTAs from the selected UTA level. This workflow task will update the selected field with the value in the \"Update To Value\" setting.\nNote: If the field to be updated has the Read Only toggle enabled in the Formatting section of the field options (or a \"read-only\" HTML tag or \"textreadonly\" CSS class) the value will not update.\n \nUpdate To Value\n - This workflow task will use this value to update the field selected in the \"Use Field\" setting. Variables can be used in the \"Update To Value\" setting as well as hard-coded values.\nTask Type: Update Standard Field Value\nThe Update Standard Field Value workflow type can be used to write values to standard fields on the object against which the Workflow is triggered.\nStandard fields on the level 1, level 2, level 3, companies, contact and transaction can be updated using this method:\nUpdate Standard Field Value Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nUse Field\n - lists standard fields from the selected UTA level. This workflow task will update the selected field with the value in the \"Update To Value\" setting.\n \nUpdate To Value\n - accepts hard-coded values and variables. This workflow task will use this value to update the field selected in the \"Use Field\" setting.\nNote: Some standard fields (such as Type) require the ID, not the type name in order to update correctly.\nTask Type: Update User Role\nUpdate User Role Workflow Task Types can add or remove roles from SmartSimple contacts.\nThis task type is only available for \"User\" workflows.\nUpdate User Role Tasks have the following settings:\n \nName\n - Narrative name for the task.\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nOption\n - options are Add or Remove. This determines whether the task will add or remove roles from the contact upon which the workflow is triggered.\n \nRoles\n - select the roles that should be added or removed from the contact's profile.\nTask Type: Web Service - HTTP Request\nThis workflow task type is used to consume a \nweb service\n via a workflow step. The web service will send the HTTP Post request to retrieve information. The response returned by the web service can be stored into a custom field on the object against which the Workflow was triggered.\nHTTP Post have the following settings:\n \nURL\n - endpoint of the HTTP Post web service\n \nUser Name\n - username to access post location if needed\n \nPassword\n - password to access post location if needed\n \nParameters\n - free text field to pass in parameters such as apitoken , alias id, etc. Can include username and password if not specified in the specific fields\n \nResponse Stores To\n - field on system where response from HTTP post can be stored\nTask Type: Web Service – SOAP Message\nThe Web Service - SOAP Message Workflow Task allows you to post data to another system, outside of SmartSimple. The response returned by the external system can be stored into a custom field on the object against which the Workflow was triggered.\nThis Task type has the following settings:\n \nName\n - Narrative name for the task.\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nExpire After\n - Intended duration of the workflow.\n \nMessage Template: Action\n - The action to called by the Web Service call (These actions are defined by the external server, and are not part of SmartSimple)\n \nMessage Template: Custom Field ID for Response\n - The Custom Field ID of an XML custom field on the object that the Workflow was triggered against that the response returned by the external server.\n \nMessage Template: Email Message Header\n - The email header can be modified using the following syntax, with the arguments separated by semicolon:\n X-Priority={1,2,3,4,5}\n Priority={normal,urgent,non-urgent}\n Importance={high,normal,low}\n Sensitivity={personal,private,company,confidential}\n e.g. Priority=urgent;Importance=high\n \nMessage Template: Endpoint\n - The URL or IP address of the destination server\n \nMessage Template: Envelope Template\n - The content of the Web Service message to be sent to the external service. This can contain variables related to the object the workflow is triggered against.\n \nMessage Template: Attach Object\n - Attaches the details of the object to the message. In the case of a SmartSimple object, such as a company, person, or application, the textual details of the object will be added. If the object is a file, then the file will be attached to an e-mail message, but not an instant message.\n \nMessage Template: Attachment File IDs\n - Attach additional default files when triggered from a Smart Folder. See the Determining the File ID article for instructions.\n \nMessage Template: Save as Event\n - Email will be saved as an event.\nIf the content from the custom fields being included within the SOAP message contains certain special characters it will disrupt the XML structure, making the message unreadable by the receiving server.\nThe less than symbol (<) and ampersand (&) are two primary special characters to be concerned about. When including fields that may contain those characters you should use a special wrapper so the receiving system understands that they are data content and not part of the XML structure:\n \n<![CDATA[ \nCONTENTS\n ]]>\nFor example, an address could contain ampersands, so it should be wrapped as follows:\n@firstname@@lastname@\n<address> </address>\nIf the response to your Web Service call contains values that you wish to store within a Custom Field on the object against which the Workflow was triggered, you can connect a Update Custom Field Value Workflow Task to be the task following the Web Service - SOAP Message and use the variable syntax to pull the value from the XML Custom Field you selected to store the response to the Web Service call.\nFor example, if the \nXML\n Custom Field that stores the response (custom field ID 155255 in the image above) is called \nWeb Service Response\n, the variable in the \nUpdate Custom Field Value\n task to pull a node called \nAssignedIdentifier\n could be:\n@xml.Web Service Response.soap:Body.AssignedIdentifier.nodevalue@\nIf the response should be saved to a \nSystem Variable\n, the syntax would be:\n@system.xml.\nfieldname\n.\nnodename\n.nodevalue@\nTask Type: Web Service - RESTful Request\nThis workflow task type is used to consume a RESTful web service using GET or POST method.\nRESTful Web Service Request using GET Method\nPOST method is used to send data to a RESTful web service.\nGET RESTful Web Service Request have the following settings:\n \nEndpoint\n - resource of the web service\n \nRequest Header\n - additional instructions sent with the request. These might define the type of response required or the authorization details.\n \nStore Response To Field\n - \nCustom field\n where the response will be stored.\n \nStore Response to SmartFolder\n - \nSmartFolder ID\n where the response file will be stored.\nRESTful Web Service Request using POST Method\nPOST method is used to send data to a RESTful web service.\nPOST RESTful Web Service Request have the following settings:\n \nEndpoint\n - endpoint of the web service\n \nRequest Body\n - data sent with the request.\n \nRequest Header\n - additional instructions sent with the request. These might define the type of response required or the authorization details.\n \nStore Response To Field\n - \nCustom field\n where the response will be stored.\n \nStore Response to SmartFolder\n - \nSmartFolder ID\n where the response file will be stored.\nCredentials of the RESTful Web Service Request\nCredentials of the web service can be added in the Request Header in the format: Authorization=Basic [base64 encoded credentials].\nA third party software can be used to convert the username/password to a base64 encoded credentials.\nNote that all equal signs within the base64 credentials should be replaced with %3D.\nExample:\nFROM: Authorization=Basic c3NcUyVzZXI6SzhAtHVuY2g\n=\nTO: Authorization=Basic c3NcUyVzZXI6SzhAtHVuY2g\n%3D\nParsing JSON response\nVariable syntax is available to parse and retrieve values from JSON format data.\nSample 1\nFIELD_NAME: {\"firstname\":\"John\"}\nvariable syntax: @json.FIELD_NAME.firstname@ \nresult: John\nSample 2\nFIELD_NAME: {\"primarycontact\":{\"firstname\":\"Thomas\"}}\nvariable syntax: @json.FIELD_NAME.primarycontact.firstname@ \nresult: Thomas\nSample 3\nFIELD_NAME: {\"users\":[{\"firstname\":\"Marie\"},{\"firstname\":\"Eve\"}]}\nvariable syntax: @json.FIELD_NAME.users.[# ~firstname~, #]@\nresult: Marie, Eve\nTask Type: Translate Field Value\nThe Translate Field Value Workflow Task allows you to perform automatic translation of records and field values in the system. It will only apply to those custom fields that have \nenabled translation services\n.\nThis Task type has the following settings:\n \nName\n - Narrative name for the task.\n \nTask Number\n - A system generated number that determines the presentation order of the task in the workflow. This number can be changed to display the step in a different location.\n \nDescription\n - Detailed description of the task (optional).\n \nTranslate to\n - set which language or languages to translate to for the custom fields that have enabled translation\nIf a record has translation enabled and a stored field translation exist, there will be a \"Show Translation Values\" in the Options menu\nWhen shown, the translated field values will appear directly underneath the existing field value.\nIf more than one translated language exist, there will be a language drop down appearing at the top of the record.\nImporting and Exporting Workflow Tasks\nWorkflow Tasks can be exported and imported into other Workflows using the Import/Export function on the Edit Workflow page. This feature is particularly useful if you have created workflows for testing on your backup instance and wish to implement the finalized reports in your live system.\nThe steps to export a workflow task or set of workflow tasks are as follows:\n1. Go to the relevant Workflow, click on the Tasks tab and select the checkbox next to the workflow task(s) that you wish to export.\n2. Click on the Export button.\n3. A pop-up window will appear, containing the details of the tasks you have selected in XML format. Select all of the text in the pop-up window and save it to a text editing program, such as Notepad.\nNote that, if multiple tasks are selected, they will be delimited in the XML text block with the tag.\nThe steps to \nimport\n a workflow task or set of workflow tasks are as follows:\n1. Go to the relevant Workflow, click on the Tasks tab, then click on the Import button.\n2. A blank pop-up window will appear. Paste the XML data that you have exported into this window.\n3. Confirm your selection by clicking on the Import button at the bottom of the pop-up window.\n The workflow tasks will be imported into the new workflow.\n The Edit Workflow page will refresh to show the newly-added workflow tasks.\nWorkflow Condition\nA logical statement can be added to workflow connectors in the Condition field, enabling you to specify which workflow task will be triggered.\nExample Branching Logic can be implemented to send an approval message to Senior Management when the request is over $100,000, while requests under $100,000 will take a different path when the workflow is triggered.\nIn general the Workflow Condition is used with several different connectors attached to a task. Collectively the conditions on each task should accommodate every possibility.\nNote: because the sequence in which the system accesses each connector is not configurable it is important that the conditions are mutually exclusive. For example, if you have 3 connectors for different paths based on a particular value the conditions could be:\n \"@Selection@\"=\"Yes\"\n \"@Selection@\"=\"No\"\n \"@Selection@\"!=\"Yes\" and \"@Selection@\"!=\"No\"\n The last statement could also be represented as \"@Selection@\" not in (\"Yes\",\"No\")\nYou can also use MySQL syntax to perform calculations within the Condition:\n date_format(now(),\"%d\")=\"01\"\nThis condition will be true only on the 1st of the month. This could be used with a Recurring Workflow that loops daily if you wish to send out a summary e-mail on the 1st of every month.\nIt is recommended that workflows with a loop include an empty task with 2 connectors with 2 separate conditions, one which goes back to the looped task and another which proceeds on to the next task, thus preventing an endless loop.\nNote: Other than values that are always numeric, all variables should be enclosed in double quotes.\nWorkflow Condition Examples\nThere are two rules that must be followed when adding multiple connectors to a workflow task that incorporate conditional logic statements:\n1. Collectively, the conditions on each task must accommodate every possible permutation\nExample of Incorrect Configuration\n:\nThree level one \ntypes\n exist in a given \napplication\n, with \ntypeIDs\n of 12345, 45678 and 67890.\nTwo connectors are set up on a workflow task with conditions of:\n \n\"@levelone.typeid@\"=\"12345\"\n and\n \n\"@levelone.typeid@\"=\"45678\"\n, respectively\nIf the workflow is fired against a record associated with typeID 67890, the workflow will never progress to the next task.\nExample of Correct Configuration\n:\nThree level one \ntypes\n exist in a given \napplication\n, with \ntypeIDs\n of 12345, 45678 and 67890.\nThree connectors are set up on a workflow task with conditions of:\n \n\"@levelone.typeid@\"=\"12345\"\n,\n \n\"@levelone.typeid@\"=\"45678\"\n and\n \n\"@levelone.typeid@\"=\"67890\"\n, respectively\nAlternatively, connectors with the following conditions could be set up:\n \n\"@levelone.typeid@\"=\"12345\"\n \n\"@levelone.typeid@\"!=\"12345\"\n (not equal to \"12345\"), and\n \n\"@levelone.typeid@\" NOT IN (\"12345\",\"45678\")\n, respectively\n2. Each condition must be mutually exclusive from every other\nExample of Incorrect Configuration\n:\nThree \nlevel 2 types\n exist in a given \napplication\n, with \ntypeIDs\n of 12345, 45678 and 67890.\nTwo level 2 \nstatuses\n exist in the same application, with \nstatusIDs\n of 888 and 999.\nThe system administrator wishes to send emails via workflow if the record is in one of the above statuses. One email should be sent out if the type is 12345 or 45678 and a different email should be sent out if a different type has been used.\nTwo connectors are set up on a workflow task with conditions of:\n \n\"@level2.typeid@\" in (\"12345\",\"45678\") AND \"@level2.statusid@\" in (\"888\",\"999\")\n and\n \n\"@level2.statusid@\" in (\"888\",\"999\")\nThe issue here is that both statements \nevaluate\n as \ntrue\n if the statuses on the record triggering the workflow have a statusID of 888 or 999.\nThe workflow process will not \"know\" which task to connect to. The workflow will progress, but not necessarily to the next intended workflow task. In other words, the wrong email may be sent.\nExample of Correct Configuration\n:\nThe types and statuses exist as above, and the system administrator wishes to configure the same branching logic.\nTwo connectors should be set up on a workflow task with the following conditions:\n \n\"@level2.typeid@\" in (\"12345\",\"45678\") AND \"@level2.statusid@\" in (\"888\",\"999\")\n and\n \n\"@level2.typeid@\" not in (\"12345\",\"45678\") AND \"@level2.statusid@\" in (\"888\",\"999\")\nThis configuration satisfies Rule #2, in that the conditions are now mutually exclusive. However, a third connector must be included, with the following condition, which connects to the \"Complete\" task, in order to satisfy Rule #1 above:\n \n\"@level2.statusid@\" not in (\"888\",\"999\")\nWith these three connectors configured, the workflow will:\n never not have instructions on \nwhether\n to trigger the next workflow task (Rule #1), and\n always have clear instructions on \nwhich\n task to trigger given a certain set of conditions (Rule #2).\nUsing iCalendar to generate Meeting Requests, Tasks and Contact cards\niCalendar is a file format that allows Internet users to send meeting requests, contacts and tasks through email and other digital methods.\nSmartSimple workflows support 3 email attachments types (ievent, itodo and icard).\nThe SmartSimple email engine will look for email contents that have ievent, itodo, and icard objects. The contents of these objects are assembled and added as email attachments.\nThe email engine will process iCalendar objects using the following syntax:\n \"@@ievent\"\n \"@@itodo\"\n \"@@icard\"\nSimple sample iCalendar objects are shown below\nievent Object\nManifests as an ical attachment on the email.\n<!--@ssattach(icalendar,vevent)-->\n@@ievent\nUID:@owner.email@\nORGANIZER;CN=@company@\nDTSTART:TO_UTC(@startdate@ @starttime@)\nDTEND:TO_UTC(@enddate@ @endtime@)\nLOCATION:Room 1\nSUMMARY: Details to follow\nDESCRIPTION: @description@\n@@\n<!--@end-->\ninstead of UTC you can specify the Time Zone for the DTSTART and DTEND as:\nDTSTART;TZID=Australia/Sydney:<!--@sscalculation(DATE_FORMAT(\"@fullstartdate@\",\"%Y%m%dT%H%i%s\"))-->\nDTEND;TZID=Australia/Sydney:<!--@sscalculation(DATE_FORMAT(\"@fullenddate@\",\"%Y%m%dT%H%i%s\"))-->\nitodo Object\n<!--@ssattach(icalendar,vtodo)-->\n@@itodo<br />UID:@owner.email@\nORGANIZER;CN=@company@\nDUE:TO_UTC(@startdate@)\nSTATUS:NEEDS-ACTIONLOCATION:Room 1\nSUMMARY: Meeting\nDESCRIPTION: @description@\n@@\n<!--@end-->\nicard Object\n<!--@ssattach(icalendar,vcard)-->\n@@icard<br />FN:@owner.fullname@\nORG:@company@<br />TITLE:@name@\nTEL;TYPE=WORK,VOICE:@owner.phone@\nTEL;TYPE=HOME,VOICE:(404) 555-1212\nADR;TYPE=WORK:;;100 Waters Edge;Baytown;LA;30314;United States of America\nLABEL;TYPE=WORK:100 Waters Edge\\nBaytown\\, LA 30314\\nUnited States of America\nADR;TYPE=HOME:;;42 Plantation St.;Baytown;LA;30314;United States of America\nLABEL;TYPE=HOME:42 Plantation St.\\nBaytown\\, LA 30314\\nUnited States of America\nEMAIL;TYPE=PREF,INTERNET:forrestgump@example.com\n@@\n<!--@end-->\nTrigger a Workflow from a Custom Browser Script\nWorkflows can be triggered based on a value in a custom field on the object using a browser script:\n_triggerwf(objectid,workflowid,Entity ID); \nThe Entity ID should not be included for UTA Level 1 workflows\nYou must first create the workflow. Once it has been created you need the \nWorkflow ID\n.\nIn the browser script you would use triggerwf with the following syntax:\nLevel 1\n: _triggerwf('@opportunityid@',\nworkflowid\n);\nExample:\n_triggerwf('@opportunityid@',98765);\nLevel 2\n: _triggerwf('@eventid@',\nworkflowid\n,26);\nExample:\n_triggerwf('@eventid@',98765,26);\n(\n26\n is the objecttype for Level 2 activities, and will be the same for all Level 2 workflows)\nNOTE: For workflows triggered by a Browser Script within a UTA you should set Trigger When to --Deactivate-- rather than selecting a Status. This ensures that the workflow is only triggered when called by the script, and there is no risk of triggering it when a status changes.\nNotes:\n You must not select Let current user select target user from this role for the Routing of workflows triggered by script, as they will not execute.\n Because the workflow is triggered when the script executes it happens before the record is saved. If the workflow changes the Status or a Custom Field value, when the record on the screen is actually saved it will overwrite any changes made by the workflow by those on the page that is being saved. Accordingly you should include any Status or Custom Field changes within the JavaScript that triggers the Workflow.\n If this function is called with a button on a page where standard libraries are not included, make sure to include /js/sstools.js (Example:<script src=\"js/sstools.js\" type=\"text/javascript\"></script>).\nUsing variables with workflows\nPass parameters when workflow triggers another workflow\nIf a workflow is triggered from another workflow, you can reference a value from the object that triggers the previous workflow (e.g. if a L3 workflow triggers a L2 workflow, you can reference any value from the L3 object from within the L2 workflow). The syntax is as below:\n @triggerobject.FIELDNAME@\nThis syntax should work when generating an email, and when used in the connectors as a condition.\nIt should also work when using a Trigger Workflow task, and when a Task Connector is linked directly to the workflow.\nUsing variable syntax to select recipients for workflow tasks\nThe recipient of workflows (selected in the Acknowledgement, Request for Comment and Request for Approval task types) can be defined using \nvariable syntax\n, rather than being limited to the list by role.\nThe benefits to using this approach is, you can send to multiple roles at the same time, rather than having to configure different tasks for each role.\nIt also allows you to filter recipients based on a custom field on the contact, or UTA Contact Role Based custom field(s).\nTo enable this feature, click on the \"Use Variable for Recipients\" checkbox under the \"Routing\" header in the workflow task and then use variables to reference the relevant user.\nNotes Workflow\nThe following variables can be used in Notes Workflows:\n @notes@ - the body of the note\nTo reference fields found on the associated Level 1, Level 2, Level 3, contact or organization record:\n @parent.fieldname@ or @parent.#fieldID#@\nFor Notes at Level 2 you can reference fields on Level 1 using:\n @parent.parent.fieldname@ or @parent.parent.#fieldID#@\n The same syntax can be used to call Level 2 fields for Notes at Level 3\nTo call Level 1 fields for notes on Level 3:\n @parent.parent.parent.fieldname@ or @parent.parent.parent.#fieldid#@\nUsing the \"Variable processed recipients\" feature of Workflow Tasks, you can direct a Notes Workflow to the contacts on the record to which the note is attached, using the @parent.owner.userid@ or @parent.[#(?object=contact)~userid~,#]@ syntaxes.\nPassword Variables\nIn the upcoming November 2023 release, password variables will be deprecated for improved security. All systems will be required to use the activation link variable (\n@activationlink@\n) to send the user to a page where they can enter their desired password instead.\nCC Email Syntax Options\nUsed with \nAcknowledgement\n, \nRequest for Approval\n and \nRequest for Comment\n Workflow tasks.\n \nScenario One\n To : peter@smartsimple.com\n Cc : susan@smartsimple.com\nResult : \nONE\n email will be sent to Peter and CC Susan\n \nScenario Two\n To : peter@smartsimple.com\n Cc : \n(sendasto)\nsusan@smartsimple.com\nResult : \nTWO\n email will be sent TO Peter and TO Susan\n \nScenario Three\n To : peter@smartsimple.com\n Cc : \n(sendnoto)\nsusan@smartsimple.com\nResult : \nONE\n email will be sent TO Susan \nONLY\n \nScenario Four\n To : peter@smartsimple.com\n Cc : \n(reply-to)\nsusan@smartsimple.com\nResult : \nONE\n email will be sent to Peter and REPLY will default to Susan\nUsing workflows\nSearching or Sorting Workflows\nTo access the workflows list, click the menu icon in the action bar, followed by the Workflows link in the System Process section.\nThe following tabs are also displayed:\n \nWorkflows\n – click this tab to see list of workflows.\n \nTasks\n – click this tab to see a list of tasks for all workflows.\n \nOutstanding Tasks\n – click this tab to see a list of outstanding tasks for all workflows.\nEach of these tabs has search and sort options, to allow quick and easy location of workflows and tasks.\nThe steps for \nsearching\n are as follows:\n1. Go to the tab that you wish to search against.\n2. Click into the search criteria field to select the list view column to search against.\n3. Enter in appropriate criteria.\n4. Click on the Search button to run the search or click on the X (clear button) to clear the criteria.\n5. All matching results will be listed, as well as filter criteria.\nThe steps for \nsorting\n are as follows:\n1. Click the column header on the column you wish to sort. First click sorts ascending (going up example 1,2,3).\n2. Second click sorts descending (going down example 3,2,1)\n3. Third click returns to the default sort order.\nWorkflow Requests\nWorkflow Requests are generated by Request for Approval / Request for Comment workflow tasks.\nThe Workflow Requests page lists:\n outstanding tasks that you need to complete based on SmartSimple \nworkflows\n,\n tasks that other people need to complete where you are participating in some steps in the workflow, and\n project tasks that you are assigned to complete.\nThe request will be listed under the \nRequests to me\n link.\n1. Click the \nCommunications\n, Workflow Requests link. The Workflow task is displayed.\n2. Click the \nTask type\n, \nFile\n link. The Workflow step is displayed with the following fields in the request:\n \nTask Name\n – The name of the \nworkflow\n task.\n \nCreated Date\n – The date the task was triggered.\n \nTask Description\n – The description of the task’s purpose.\n \nAction\n – The \nRouting Options\n for the request. These options are only visible for \nRequests For Approval\n.\n \nComments\n – This box is always visible but can only be used with \nRequest For Comments\n.\n \nObject Area\n – The bottom portion of the request screen where the attached object is displayed.\n3. Select \nApprove\n to approve the file and click the \nSubmit\n button. The \nApprove\n option requires us to select a \nuser\n to send the approval message to so the \nSelect User\n list is displayed.\n4. Select the \nuser\n to receive the approval message and click the \nSubmit\n button. The step is complete and the Workflow is also complete. The \nworkflow complete\n message is displayed.\n5. Click the \nCommunications\n, \nWorkflow Requests\n button. The \nworkflow\n is removed from the \nRequest to Me\n window.\nWorkflow Diagram\nClicking on the Diagram button in the action bar of the Edit Workflow page will bring up a graphical representation of the Workflow Tasks that have been configured on that workflow.\nSystem Administrators use this feature to document and troubleshoot complicated workflow configurations.\nWorkflow Pending Queue\nOn the Edit Workflow page, the Pending Queue tab shows all instances where the workflow in question has been triggered, and the task has been scheduled for future completion.\nThe last column shows the \"Objectid\" of the entity against which the workflow was fired.\nWorkflow History\nIn the Edit Workflow page, the history of an individual Workflow can also be accessed by the History tab.\nThis page shows all instances of the workflow being triggered. The last column shows the \"Objectid\" of the entity against which the workflow was fired.\nWorkflows Triggered by a Given Entity\nThe Workflow History tab is made visible for a given Universal Tracking Application™ by enabling the relevant Manager Permission. Go to UTA – Settings – Security, click on Feature and Function Permissions.\nThe Enable Workflow History setting is found on the Feature tab.\nEnabling the Manager Permission will enable the Workflow History section from the Option drop-down on Level 1, Level 2 and Level 3 records.\nClicking on the Workflow History tab will display the history of workflows triggered on the entity.\nConfigure System to display Workflow options\nThe user creating the workflow must have permission to set company workflow trigger.\nGo to Global settings – Security – System Feature Permissions , go to the Action Permission tab and scroll down to the Workflows - Attach Workflow to Company setting.\nThere should be a Lookup button to select the roles that should be allowed to attach the workflow.\nOnce the role is selected, the options will display in the edit company view.\nReasons workflow messages aren't arriving\nSome common reasons for workflow messages not arriving are:\n Your \nbrowser\n has a pop-up blocker.\n \nWorkflows\n are not enabled.\n There is another \nworkflow\n triggering on the same status.\n Your \nworkflow\n is not configured properly.\nSolution to:\n Allow \nSmartSimple\n as a trusted site \nor\n check your \nbrowser\n for any tool bars that may be blocking the pop-ups \nor\n set the \nworkflows\n to \nsuppress pop-ups\n.\n Typically in \nUTAs\n, you will need to edit the \ntemplate\n and enable \nworkflows\n for the level at which they are being triggered.\n You will need to review the other \nworkflows\n to make sure that two \nworkflows\n are not triggering on the same status.\n You will need to review the configuration of the \nworkflows\n to ensure that the connectors are set appropriately as well as the individual tasks that are to take place.\nDetermining the Workflow ID\nOnce a workflow has been created, the workflow ID (\nwfid\n) can be found as follows:\n Click on the hyperlink for \nGlobal Settings\n Go System tab, click on the hyperlink for \nWorkflows\n The workflow ID is visible as the right-most column on the list of workflows.\nAlternatively:\n Click on the Edit workflow icon for the Workflow you want, and the Workflow ID will be at the top of the page:\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Workflows_Overview&oldid=43895\n’ \nCategories\n: \nSystem Management\nWorkflows\nApplications",
  "links": [
    "https://wiki.smartsimple.com/wiki/Recurring_Workflow",
    "https://wiki.smartsimple.com/wiki/SmartFolder",
    "https://wiki.smartsimple.com/wiki/Sales_Tracking",
    "https://wiki.smartsimple.com/wiki/Web_Forms",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/Transactions",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Workflows_Overview#Workflow_Requests",
    "https://wiki.smartsimple.com/wiki/Workflows_Overview#Workflow_Requests",
    "https://wiki.smartsimple.com/wiki/Workflow_Task_Types",
    "https://wiki.smartsimple.com/wiki/Workflow_Types",
    "https://wiki.smartsimple.com/wiki/Recurring_Workflow",
    "https://wiki.smartsimple.com/wiki/Types",
    "https://wiki.smartsimple.com/wiki/Workflows_Overview#Workflow_Requests",
    "https://wiki.smartsimple.com/wiki/APIs",
    "https://wiki.smartsimple.com/wiki/Update_Custom_Field_Value",
    "https://wiki.smartsimple.com/wiki/System_Variable",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/SmartFolders",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/SmartFolders",
    "https://wiki.smartsimple.com/wiki/Enable_Translation_Service",
    "https://wiki.smartsimple.com/wiki/Types",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/Determining_the_typeid",
    "https://wiki.smartsimple.com/wiki/Types",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/Determining_the_typeid",
    "https://wiki.smartsimple.com/wiki/Level_2_Types",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/Determining_the_typeid",
    "https://wiki.smartsimple.com/wiki/Status",
    "https://wiki.smartsimple.com/wiki/Determining_the_statusid",
    "https://wiki.smartsimple.com/wiki/Boolean_Operators",
    "https://wiki.smartsimple.com/wiki/Workflows_Overview#Determining_the_workflowid",
    "https://wiki.smartsimple.com/wiki/Variable_List",
    "https://wiki.smartsimple.com/wiki/Workflows",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/Workflow_-_Silent_Mode",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/Workflow",
    "https://wiki.smartsimple.com/wiki/Global_Settings"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/5/5a/Workflow2017_1.png",
    "https://wiki.smartsimple.com/images/3/39/Workflow2017_2.png",
    "https://wiki.smartsimple.com/images/e/e7/Workflow2017_3.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/7/77/Yes.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/0/04/No.png",
    "https://wiki.smartsimple.com/images/5/5e/Workflow2017_4.png",
    "https://wiki.smartsimple.com/images/6/6d/Workflow201802_6.png",
    "https://wiki.smartsimple.com/images/f/fc/Workflow2017_7.png",
    "https://wiki.smartsimple.com/images/c/cb/Workflow2024_8.png",
    "https://wiki.smartsimple.com/images/9/94/Workflow2017_9.png",
    "https://wiki.smartsimple.com/images/9/9c/Workflow2017_10.png",
    "https://wiki.smartsimple.com/images/7/73/HTTPPost.PNG",
    "https://wiki.smartsimple.com/images/d/d5/SOAP.png",
    "https://wiki.smartsimple.com/images/1/1d/RESTful_GET.PNG",
    "https://wiki.smartsimple.com/images/f/fd/RESTful_POST.PNG",
    "https://wiki.smartsimple.com/images/2/2c/ExportWorkflow2017.png",
    "https://wiki.smartsimple.com/images/c/c2/Workflow2017_13.png",
    "https://wiki.smartsimple.com/images/4/4a/Workflow2017_17.png",
    "https://wiki.smartsimple.com/images/7/75/Workflow2017_18.png",
    "https://wiki.smartsimple.com/images/d/da/Workflow2017_19.png",
    "https://wiki.smartsimple.com/images/e/ed/Workflow2017_20.png",
    "https://wiki.smartsimple.com/images/f/fa/Workflow2017_21.png"
  ]
}