{
  "url": "https://wiki.smartsimple.com/wiki/Relating_Contacts_and_Accounts_to_the_Universal_Tracking_Application#The_Account_List_Field",
  "title": "Relating Contacts and Accounts to the Universal Tracking Application",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nNote\n: The terms \nContact\n and \nAccount\n can be renamed in Global Settings.\nAccordingly, they may have different names in your instance of \nSmartSimple\n.\nThe functionality described below will be the same.\nContents\n1\n \nLevel 1 Contact and Account Fields\n1.1\n \nThe Owner Field\n1.2\n \nThe Person Field\n1.3\n \nThe Contacts Field\n1.3.1\n \nGroups\n1.4\n \nThe Accounts Field\n1.5\n \nThe Company (or Branch) Field\n1.6\n \nThe Customer (or Client) Field\n2\n \nLevel 1 Contact and Account Field Settings\n2.1\n \nDefining Which Roles are Available in the UTA\n2.1.1\n \nCreating Contact Roles\n2.1.2\n \nCreating Account Roles\n2.2\n \nTabs for Contact and Account Lists\n2.3\n \nUTA Contact Filters and UTA Account Filters\n2.4\n \nContact Restrictions\n3\n \nLevel 2 Contact and Account Fields\n3.1\n \nThe Owner Field (Level 2)\n3.2\n \nThe Contact People Field\n3.3\n \nThe Assigned People Field\n3.4\n \nThe Account List Field\n4\n \nLevel 2 Contact and Account Field Settings\n4.1\n \nMultiple Contact List\n4.2\n \nMultiple Account List\n4.3\n \nContact Restrictions\n4.4\n \nContact Filtering\n5\n \nAccount and Contact Settings\n6\n \nCustom Fields\n7\n \nSee Also\nLevel 1 Contact and Account Fields\nThere are 3 different standard fields that can be used to associate \ncontacts\n with a \nLevel 1\n entity:\n Owner\n Person\n Contacts\nThere are also 2 standard fields that can be used to associate \naccounts\n with a Level 1 entity:\n Accounts\n Company (often renamed to Branch)\nThe \nOwner\n, \nContacts\n, \nPerson\n and \nAccounts\n fields at Level 1 are all used to control \naccess levels within the UTA if the \nSecurity Matrix\n is enabled\nThe Owner Field\nThe UTA Level 1 standard field \nOwner\n is used to establish a \ndirect relationship\n between a single \ninternal\n contact and the Level 1 entity. \n When editing a Level 1 record the \nOwner\n standard field will be displayed as a combo box listing all \ninternal\n contacts.\n When a new Level 1 record is created, the \nOwner\n will be set to the current user by default, but can then be changed to any \ninternal\n contact.\nThe \nOwner\n field can also be configured to allow both external and internal owners. \n To enable external owners, click on the \nSettings tab\n, choose the \nEntity tab\n, and select the \nEnable External Owners\n check box in the Level 1 settings section.\nThe Person Field\nThe \nPerson\n field allows you to make an additional direct relationship between any contact and the \nLevel 1 Entity\n. \nAny \ninternal\n or \nexternal\n contact can be assigned \n You can either click the \nLookup\n button to find and select the contact, or you can simply start typing the name and a list of matching contacts will appear below the field.\n The \nPerson\n field does not allow assignment by role.\n If the \nFilter Person Based on Customer\n option is selected on the \nUTA Settings\n page, the list of contacts available when the Customer standard field is enabled will be restricted to the company/account selected as the Customer, as well as the contacts in any of the sub-companies of the Customer company.\nThe Contacts Field\nThe standard UTA Level 1 field \nContacts\n is used to establish a direct relationship between multiple people and the same \nLevel 1 Entity\n. \nWhen you add the \nContacts\n field to the \nLevel 1 Entity\n it will display as a section on the Level 1 Record:\nClicking on the Lookup button in \nEdit mode\n brings you to a pop-up where you can select the users to be added. \nIf you type into the Ajax field then you will see options returned that contain matching data, as well as the option to create a new contact. \nYou can search for contacts on any field that has been added to the \nContact Ajax Lookup Settings\n on the Global Settings page. \nUsers can also be added using the \nImport Contact\n feature, available from within the \nUTA Settings\n section.\nWhen contacts are assigned to the Level 1 entity you can select a \nRole\n to describe that contact's engagement with the \nLevel 1 Entity\n. Managing which roles are available is described \nbelow\n.\nFor example, if your UTA is tracking \nResearch Projects\n, the person who is applying to have their project approved could be added to the record with a \nrole\n named \nCandidate\n. \n Someone else could be assigned as \nManager\n, and perhaps 3 people would be assigned as \nEvaluators\n A given contact could be an \nEvaluator\n for one Level 1 item and a \nManager\n for a different Level 1 item. \n If the contact is both a \nManager\n and \nEvaluator\n for the same Level 1 entity they can be assigned to the Level 1 twice: once as \nManager\n and once as \nEvaluator\n.\nThis feature is further extended providing the ability to define \ncustom fields\n used to describe the interaction between the person and their engagement in the \nLevel 1 Entity\n. \n For example, if the \nLevel 1 Entity\n is a \nResearch Project\n and you anticipate there being different \nManagers\n being responsible over time, you could create custom fields on the \nManager\n \nrole\n to track their respective start and end dates along with other information. \nThe fields that are visible in the \nContacts\n section can be controlled using the \nContact List View\n hyperlink on the \nUTA Settings page\n in the Level 1 settings section.\n On the image above the fields in the list view are \nIndex\n, \nFirst Name\n, \nLast Name\n and \nRole\nGroups\nIf you have configured \nUser Groups\n, multiple contacts can be assigned to the Level 1 record at the same time by selecting the \nGroups\n radio button:\nEach member of the selected \ngroup\n will be assigned to the Level 1 record. You can either select a \nRole\n and all contacts in the group will be assigned with that role. Or you can select the \nUse Group Roles\n checkbox and the contacts will be assigned the the Level 1 with the \nrole\n they are assigned in the \nGroup\n.\n \nNote:\n When using the \nUse Group Roles\n, the contacts will be assigned with the roles they have in the group, even if those role(s) are not enabled within the given \nUTA\n.\nThe Accounts Field\nThe Standard UTA Level 1 field \nAccounts\n is used to establish a \ndirect relationship\n between multiple accounts (or companies) to the same \nLevel 1 Entity\n. \nWhen you add the Accounts field to the \nLevel 1 Entity\n it will display as a section in the \nLevel 1 Entity\n:\nJust as with contacts, when accounts are assigned to the Level 1 entity you can select a \nRole\n to describe that account's engagement with the \nLevel 1 Entity\n. You must first define \nCompany Roles\n as explained \nbelow\n.\n For example, a company may play the role of \nSponsor\n in a given Level 1 item. \nThe fields that are visible in the \nAccounts\n section can be controlled using the \nAccount List View\n on the UTA Settings page in the Level 1 settings section.\nAny contacts that are associated with that account (as defined \noutside\n of the UTA) can thus be indirectly associated with the Level 1 item via the \nAccounts\n field.\nAlso, Accounts can also be added using the \nImport Organizations\n feature, available from within the \nUTA Settings\n section.\nThe Company (or Branch) Field\nIf this field is added to the Level 1 it will be displayed as a pull-down menu of all the internal sub-companies/branches of the parent company/branch.\nThe Customer (or Client) Field\nThis field allows you to select any external Company or Account.\n If the \nFilter Person Based on Customer\n option is selected on the UTA Settings page, the list of contacts available in the Person standard field (if enabled) will be restricted to the company/account selected here, as well as the contacts in any sub-companies of the Customer company.\nLevel 1 Contact and Account Field Settings\nDefining Which Roles are Available in the UTA\nThe \nroles\n that have already been set-up within \nSmartSimple\n for the users of the system can be used, or you can create new roles (explained below):\nTo select which Roles will be available when adding \nContacts\n to a Level 1 record, go to the Security Config tab in UTA Settings. In the \nContact Assignment Role Settings\n section select the check boxes next to the \nroles\n you wish to be available.\nTo select which Roles will be available when adding \nAccounts\n to a Level 1 record, go to the Security Config tab in UTA Settings. In the \nAccount Assignment Role Settings\n section select the check boxes next to the \nroles\n you wish to be available.\nYou can also create new \nRoles\n specifically for use in the UTA:\nCreating Contact Roles\n Choose \nRoles & Permissions\n from the \nConfiguration Menu\n.\n Click the \nUser Roles\n link.\n Add the roles you wish to be available when assigning contacts to Level 1 entities in the UTA\nThese \nRoles\n will be available for all UTA. There is no need to set any attributes for these \nroles\n as they will only be used to reference contacts with the UTA.\nAs you save each role, note the \nCustom Fields\n tab.\nYou use this tab to establish the \ncustom fields\n pertinent to this role.\nCreating Account Roles\nTo create the \nroles\n that will be available when adding Accounts to the Level 1 record \n Choose \nRoles & Permissions\n from the \nConfiguration Menu\n.\n Click the \nCompany Roles\n link.\n Add the roles you wish to be available when assigning Accounts to Level 1 entities in the UTA\nNote\n: Company roles are only applicable within the Universal Tracking Application and should not be confused with Account Categories – the standard method for categorizing companies.\nTabs for Contact and Account Lists\nIf you associate a large number of contacts or accounts (companies) to Level 1 items, you can separate the users onto different tabs based on the \nrole\n they are assigned with (and accounts based on account roles).\n You can access the feature within the UTA Settings tab - Contact Tabs and Account Tabs hyperlinks in the Level 1 Settings section. \n You can create as many tabs as required, and associate as many roles with each tab as desired. Tabs can also be deleted through the same screen.\n If you do not add the \nEveryone\n to one of the tabs that you create, the system will automatically display a tab called \nEveryone\n which will include all contacts (or accounts) with roles not defined for another tab.\n If you do not wish to use tabs to separate contacts or accounts simply delete all tabs listed.\nUTA Contact Filters and UTA Account Filters\n You can define who can see which contacts and accounts (companies) at Level 1 based on role membership.\n* \nNote\n: when this feature is enabled, contacts that are not assigned in the \nContacts Section\n of the Level 1 record \nwill \nnot\n be able to see any assigned contacts. The implication being that internal staff (for example)\nwill need to be assigned to the Level 1 in order to view the contacts.\n* Similarly, the \nOwner\n of the Level 1 will have no visibility of the Contacts assigned if they are not also an assigned Contact \nin the Contacts section. If you want the owner to have visibility of Contacts you can enable an Account \nAuto Assignment\n \n(Settings > Auto Assignments) which automatically assigns the owner to the Level 1 Contacts section with a specified \nrole\n.\n To implement these features, click on the \nSettings tab\n, choose the \nSecurity tab\n and within the Security Settings panel, select the check boxes beside Enable UTA Contact Filter and/or Enable UTA Account Filter.\n Once the feature has been enabled for either contacts or accounts, the UTA Contact Filters and/or UTA Account Filters hyperlinks are available under on the UTA Settings page - \nSettings panel\n.\n You can now configure visibility of the contacts/accounts associated with a Level 1 based on User Roles and Account Roles. For example if you have a role called \"Candidate\" you may want the candidate, when viewing the Level 1, to be able to see who is assigned to the case as the \"Manager\". To accomplish this you would enter the following settings:\n If there is another role called \"Evaluator\", you may want the contacts assigned to the Level 1 as evaluators to see who is assigned to the Level 1 as candidate and as manager. You would create another filter as follows:\n \nBecause we have not added the \"Evaluator\" role to the \"Candidate\" filter, the candidate assigned to the Level 1 will not be able to see contacts assigned to the Level 1 as evaluators.\n \nSimilarly, because we have not added the \"Candidate\" role to the \"Candidate\" filter, the candidate will not be able to see his/herself, or any or any other candidates assigned to the record. \n \nNote\n: this filter does \nnot\n impact the ability to \nadd\n contacts. If someone is permitted to add contacts with the role \"Evaluator\", but is not given the filter permission to see contacts assigned as \"Evaluators\", when they add a new Evaluator it will be added, but will disappear from their view since they are not permitted to see Evaluators.\n The Account filter works in the exact same manner.\nContact Restrictions\n To access this feature, click on the Contact Restrictions hyperlink on the UTA Settings tab.\n The limit can be any number between 1 and 99.\n You can restrict the number of contacts belonging to a \ngiven role\n that can be associated with a Level 1 record. \nThe following would ensure no more than 2 evaluators are assigned to a Level 1 record:\nNote\n: The Message box allows you to specify the error message that will be generated if the specified limit is exceeded.\n Similarly you can restrict the number of times a given contact can be associated with a Level 1 record.\nUsing the following would ensure each contact can only be assigned to the Level 1 record once:\n The following combination would ensure that each contact can be assigned to the Level 1 twice, but only once per role (assuming the roles available are Candidate, Evaluator and Manager):\nLevel 2 Contact and Account Fields\nThere are 4 standard fields that can be used to associate Contacts with the Level 2 entity:\n Owner\n Contact People\n Assigned People\n Account List\nThe Owner Field (Level 2)\nThe \nOwner\n Field at Level 2 is the same as the Owner field at Level 1. If the option \"Allow External Owners\" is selected on the Level 1 settings, both external and internal owners will be allowed on Levels 2 and 3.\nThe Contact People Field\nThe \nContact People\n standard field allows you to assign multiple contacts to the Level 2 record. \n If you wish to assign contacts to the Level 2 record by \nrole\n (similar to Level 1) you can enable the Multiple Contact List as described \nbelow\n.\nNote\n: if the \nContact Links\n field is also enabled on the Standard Fields page the record will display a hyperlink to the contacts listed in the Contact People field directly underneath the field.\nTo \nreport\n on contacts in this field the \nContacts\n table should be joined to the \nTracking Application Activity\n table\nThe Assigned People Field\nThe \nAssigned People\n standard field works similarly to the Contacts field above. \nNote\n: if the \nAssigned Links\n field is also enabled on the Standard Fields page the record will display a hyperlink to the contacts listed in the Assigned People field directly underneath the field\nTo \nreport\n on contacts in this field the \nUser\n table should be joined to the \nTracking Application Activity\n table\nThe \nAssigned People\n field will not be available if the \nMultiple Contact List\n is enabled.\nThe Account List Field\nThe \nAccount List\n field at Level 2 allows you to assign companies to the Level 2 entity by company role, exactly as described for the \nAccounts\n field for Level 1 above. The \nroles\n available for the companies assigned at Level 2 will be the same as those enabled for Level 1.\n In order to use the \nAccount List\n field at Level 2 you must first enable \nUse Multiple Account List\n under the Level 2 settings on the \nEntity tab\n. Then go to the Level 2 Standard Fields list on the same tab and enable the \nAccount List\n field by entering a name in the Label field.\nLevel 2 Contact and Account Field Settings\nMultiple Contact List\n If you enable the \nUse Multiple Contact List\n check box on the Settings > \nEntity tab\n you will be able to associate and control contact associations in a similar manner to Level 1 contacts. The roles available at Level 2 will be the same as selected for Level 1 above.\n \nIMPORTANT: It is not yet possible to refer to contacts that are assigned by role at Level 2 on Web Page Views or in other Custom Fields.\nNote\n: If you have enabled the \nSecurity Matrix\n and are using the UTA Role \nassignments for the matrix instead of the System Role assignments:\nIt is the role that a contact is given at \nLevel 1\n that determines their\naccess as defined in the \nSecurity Matrix\n. \nNot\n the role they are given if \nthey are assigned at Level 2.\nMultiple Account List\n As described \nabove\nContact Restrictions\n You can limit the total number of contacts that can be assigned to the Contacts Field (or Multiple Contact List if enabled) at Level 2.\n To enable enter the desired limit into the \nMaximum Contacts - Maximum number of contacts can be assigned\n field on the \nEntity tab\n in the Level 2 settings section.\nContact Filtering\nYou can restrict the selection of contacts that can be associated with Level 2 items to either a list of named contacts, or by role. \nThis is implemented on the Level 2 \nTypes\n page, so you can enforce a different selection of contacts for each Level 2 Type you have defined.\n Click on Settings > Types (Under Level 2 Settings) > then select the type you wish to restrict:\n To restrict by specified named contacts, select the relevant contacts in the \nSpecific Service Providers\n field.\n To restrict by specified role(s), add the relevant roles to the \nSpecific Service Provider Roles\n field.\nAccount and Contact Settings\nThe account and contact settings are used to determine if the Level 1, 2 and 3 items should be available in other parts of \nSmartSimple\n, rather than only in the \nUniversal Tracking Application\n. \n If \nEnable Level 1, 2 and/or 3 Tab on Contact Profile\n is enabled, when viewing a contact profile there will be tab(s) listing all the records that contact is associated with.\nHere is how the L2 tabs under Contact and Company profile works\nL2 under User Profile\n L2s with the user as L2 contact role association\n L2s with the user as a (standard field) contact, assigned, or owner\n L2s under any L1s with the user as the L1 owner or L1 person\nL2 under Company Profile\n L2s with associated users that is under the company\n L2s with users as a contact, assigned that is under the company\n L2s with users as an owner that is under the company\n L2s with the company as L2 company association\nCustom Fields\nIn addition to the standard contact and account fields described above, you can create additional \nCustom Fields\n to store contacts and accounts related to a case.\nThe contacts or accounts stored in \nCustom Fields\n cannot be used to provide permissions if you are using the \nSecurity Matrix\n, cannot be assigned to roles, nor are they related in any way to the Contact Filter or Contact Restriction features described above.\nThese fields are:\n \nCustom Field Type: Lookup – Entity and People\n \nCustom Field Type: Lookup – External Entity\n \nCustom Field Type: Lookup – External People\n \nCustom Field Type: Select One – Internal Entity\n \nCustom Field Type: Select One – Internal People\n \nCustom Field Type: Select One - User Group\nSee Also\n \nAuto Assignments\n \nSecurity Matrix\n \nDisable Default Assign\n \nFilter Person Based on Customer\n \nUTA Role\n \n  \nLevel 1 and Level 2 Entity Settings\n       \n \nTerminology Settings\n  \n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Relating_Contacts_and_Accounts_to_the_Universal_Tracking_Application&oldid=30260\n’ \nCategories\n: \nUniversal Tracking Application\nApplications\nContacts",
  "links": [
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Level_One_Entities",
    "https://wiki.smartsimple.com/wiki/Security_Matrix",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_Page",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_-_Entity",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Filter_Person_Based_on_Customer",
    "https://wiki.smartsimple.com/wiki/UTA_Settings",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Edit_mode",
    "https://wiki.smartsimple.com/wiki/User_%26_Contact_Settings",
    "https://wiki.smartsimple.com/wiki/Import_multiple_contact/companies_to_uta_objects",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_-_Settings",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Custom_Field",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_page",
    "https://wiki.smartsimple.com/wiki/User_Groups",
    "https://wiki.smartsimple.com/wiki/User_Group",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/User_Groups",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Import_multiple_contact/companies_to_uta_objects",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_-_Settings",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Roles_%26_Permissions",
    "https://wiki.smartsimple.com/wiki/Configuration_Menu",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Custom_Field",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Configuration_Menu",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Auto_Assignments",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_Page",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_-_Security",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_-_Settings",
    "https://wiki.smartsimple.com/wiki/UTA_Role",
    "https://wiki.smartsimple.com/wiki/Report",
    "https://wiki.smartsimple.com/wiki/Report",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_-_Entity",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_-_Entity",
    "https://wiki.smartsimple.com/wiki/Security_Matrix",
    "https://wiki.smartsimple.com/wiki/Security_Matrix",
    "https://wiki.smartsimple.com/wiki/UTA_Settings_-_Entity",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Security_Matrix",
    "https://wiki.smartsimple.com/wiki/Auto_Assignments",
    "https://wiki.smartsimple.com/wiki/Security_Matrix",
    "https://wiki.smartsimple.com/wiki/Disable_Default_Assign",
    "https://wiki.smartsimple.com/wiki/Filter_Person_Based_on_Customer",
    "https://wiki.smartsimple.com/wiki/UTA_Role",
    "https://wiki.smartsimple.com/wiki/Level_1_and_Level_2_Entity_Settings",
    "https://wiki.smartsimple.com/wiki/Level_1_and_Level_2_Entity_Settings",
    "https://wiki.smartsimple.com/wiki/Terminology_Settings",
    "https://wiki.smartsimple.com/wiki/Terminology_Settings"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/f/ff/Person.PNG",
    "https://wiki.smartsimple.com/images/e/e4/L1Contacts2017.png",
    "https://wiki.smartsimple.com/images/9/97/L1Contacts2_2017.png",
    "https://wiki.smartsimple.com/images/d/d7/AddGroup2017.png",
    "https://wiki.smartsimple.com/images/5/59/Accounts2017.png",
    "https://wiki.smartsimple.com/images/6/6b/RolesList.png",
    "https://wiki.smartsimple.com/images/a/ac/EditRoleButtons.png",
    "https://wiki.smartsimple.com/images/f/f0/Tabs.PNG",
    "https://wiki.smartsimple.com/images/7/7c/Filter.PNG",
    "https://wiki.smartsimple.com/images/7/74/Filter2.PNG",
    "https://wiki.smartsimple.com/images/c/ca/Candidate.PNG",
    "https://wiki.smartsimple.com/images/5/5e/Evaluator.PNG",
    "https://wiki.smartsimple.com/images/7/78/RoleRestriction.PNG",
    "https://wiki.smartsimple.com/images/5/52/UserRestriction.PNG",
    "https://wiki.smartsimple.com/images/5/5e/ContactRestrictionExample.png",
    "https://wiki.smartsimple.com/images/2/2a/MiscSettings-AccountandContactSettings.png",
    "https://wiki.smartsimple.com/images/c/ca/Previous.png",
    "https://wiki.smartsimple.com/images/c/c4/Next.png"
  ]
}