{
  "url": "https://wiki.smartsimple.com/wiki/Web_Page_View_Field",
  "title": "Web Page View Field",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nRecommended HTML Editors\n3\n \nCreating or Editing the Field\n4\n \nBasic HTML Tags Required\n5\n \nSample Template with HTML Tags, Static Text and Variables\n6\n \nTips\n7\n \nAdding a Logo or Image to the Web page View Field\n8\n \nDisplaying a Web Page View Field\n9\n \nDocument Options\n10\n \nSee Also\nOverview\nThe \nWeb Page View\n field provides the ability to display a fully formatted document or web page.\nThis article describes how to use the field and some important tips to get the best use from this feature.\nYou can think of these types of document as “templates” that are automatically completed from \nSmartSimple\n data or as a kind of mail-merge of a single document with the data coming from the system and the static text coming from the \ntemplate\n.\nWeb page view fields are very useful for creating:\n Correspondence such as letters.\n Contracts and Agreements.\n Forms.\nYou control the following attributes for each \nWeb Page View\n field that you add to the system:\n The format used for the saved document – either \nPDF\n or \nHTML\n format.\nFor types on format conversion compatibility between \nPDF\n and \nHTML\n go to:\nhttp://pd4ml.com/html.htm\nhttp://pd4ml.com/css.htm\n Where the document can be saved either back to a \nSmartSimple\n file field or to the local computer.\n If the document can be edited to make final changes.\n If the document can be emailed (in either \nPDF\n or HTML format).\n If the document requires a \npassword\n (\nPDF\n only).\nEach of these options are discussed in more detail later in this article.\nIn constructing this type of field you add:\n HTML tags that control the formatting of the page.\n Static text that does not change.\n \nSmartSimple\n variables that are replaced with actual values from the underlying data when you display the field.\nIn order to create these types of fields you will need to have some familiarity with HTML formatting tags as well as the names of the values you wish to place in the final document.\n JavaScript to provide advanced features (see \nCategory:JavaScript\n)\nBefore You Start\nThere are a number of techniques that you can use to create the content of the document.\n Edit the HTML template within \nSmartSimple\n - using this approach, you need to know some HTML code, as you will be adding these formatting codes directly to the document. It may be ok for simple documents, but too difficult an approach for more complicated documents.\n Create the HTML \ntemplate\n using another application – using this approach you create the HTML code in one of a number of recommended HTML editors and then when complete copy and paste the code into the HTML content field. This technique is recommended for more complex documents. The recommended tools are listed below.\nRecommended HTML Editors\nRecommended Editors\nAdobe Dream Weaver\n: Popular HTML editor provides full HTML editing features; program purchase necessary (~$300/$400).\nNotepad\n: Built-in Windows text editor provides no HTML formatting features (so HTML knowledge is required); useful for its editing features.\nNot Recommended Editors\nMicrosoft Word\n and \nMicrosoft FrontPage\n are not recommended as editors, as they both add proprietary formatting tags that will cause problems when displaying the contents of your web page view field in \nbrowsers\n other than Internet Explorer (Microsoft’s own browser)\nCreating or Editing the Field\nThe following example shows the creation of a simple employee Letter of Offer, displaying the new employee’s name and address, plus details of their compensation.\nThis is how the field will look before you add the HTML template:\nThe \nHTML Template\n is used to store the body of the document and will be a mix of HTML code, static text and variable names – in this case the variables will reference the \nuser\n \nentity\n and the employee \nrole\n.\nBasic HTML Tags Required\nSample Template with HTML Tags, Static Text and Variables\n The \nVariables\n are shown in bold.\n This example uses the \n< br >\n field for a line break but no other \nHTML\n tags.\n Note the use of the “me” variable to reference the current \nuser’s\n details.\nTips\nGetting one document right and then duplicating that document\nThe simplest way to create a lot of different document \ntemplates\n fast is to create a single template, get it right in every respect and then create new documents from that \ntemplate\n, adding in the \nstatic text\n and \nvariables\n that you need. The following tips are useful in getting the document right.\nUsing an Editor\nIf you want to create a more elaborate document, then you should use an HTML editor to prepare the document, insert the variable names and then copy and paste the HTML code into the HTML template field.\nControlling Margins and Header/Footer when Printing\nIf you don’t set any margins when printing a web page document, then the margins in your \nbrowser\n will define the margins used to print the document. Generally this will lead to unsatisfactory results.\nYou should always control the margins both within the \nWeb Page View\n \ntemplate\n and within the \nbrowser\n to get the most accurate printed version.\n Set the \nuser’s\n browser margins to the minimum value, usually 0 for all margins (top, bottom, left and right).\n Remove the default header and footer from the \nbrowser\n.\n These settings are usually controlled through the \nFile\n, \nPage Setup\n \nmenu\n on your browser (Internet Explorer or FireFox).\nIf you set the margins in the \nWeb Page View\n and don’t reduce the \nbrowser’s\n margin these values will be added together and the document will be printed at a reduced font size.\nThe code for setting the Web Page view is shown in a later section.\nControlling Margins and Header/Footer when converting to \nPDF\nWhen saving the document as a \nPDF\n (if you enable this option for the Web Page View field) only the margins that you have added to the document will be used.\nIf you don’t set the margins within the document then the built-in margins in the \nPDF\n writer (the program that created the PDF version of the document) will be used.\nThese margins are: Top margin: \n0.375”\n Bottom margin: \n0.375”\n Left margin: \n0.625”\n Right margin: \n0.6865”\n.\nSetting the Margins in the Web Page View field\nThe following code is used to control the margins in the document. There are two methods of setting the document margins – you can set margins within the body tab of the HTML OR define styles in the head portion of the HTML.\nThe above settings will work in both Firefox and Internet Explorer.\nAll measurements for these types of settings are using pixels.\nPixels should not be confused with points. A pixel represents a single dot on a monitor; a point is a unit of measure equal to 1/72 of an inch. The following link provides a comparison between points and pixels:\nhttp://www.sibagraphics.com/font.php\nSetting Default Font in the Web Page View field\nIf you don’t set the font and font size within the \nWeb Page View\n field, then the font used will be determined by the \nuser’s\n \nbrowser\n settings.\nYou can check this setting in Internet Explorer through the \nTools\n, \nInternet Options\n \nmenu\n and \nAppearance Fonts\n button and in FireFox (Mozilla) though the \nTools\n, \nOptions\n \nmenu\n, \nContent\n icon, \nFonts\n and \nColors\n settings.\nFont formatting can be explicitly set for specific sections of the document or for the entire document using the following code:\nSetting Default Paragraph Margins in the Web Page View field\nThis tip is very important if you are enabling editing within the completed \nWeb Page View\n document.\nHTML supports a Line tag - < br > and a Paragraph tag set < p > .\n When you hit the \nEnter\n key a new paragraph is generated using the \nSmartSimple\n HTML Editor to edit the Web Page Document.\n When you use the \nSHIFT + Enter\n key combination a new line is generated.\nParagraphs are set to have extra line spacing called paragraph margins and when you press the \nEnter\n key the lines can be spaced too far apart because they are really paragraphs.\nYou can solve this issue by using \nSHIFT + Enter\n but if your \nusers\n find this too difficult to remember, you can set the paragraph margin within the \nWeb Page View\n document with the following code:\nCreating a Landscape Document\nIf you need to create a document in landscape layout you will need to add the following special tag to the document template:\nYou can position this tag at any location within the \ntemplate\n to change the orientation so the document could begin in portrait layout and then switch to landscape.\nThis tag is specific to the \nSmartSimple\n PDF writer and can only be used when you provide the \nSave As PDF\n option to the document.\nFor more details of the SmartSimple \nPDF\n writer you can visit the following link: \nhttp://pd4ml.com/support.htm\nAutomatic conversion from Web Page View to PDF - .pdfwrite() function\nIf you want to automatically convert Web Page View to PDF without clicking 'Export as PDF' button, use the following code at the very bottom of you Web Page View source code.\n...\n<script language=\"javascript\">// <![CDATA[\nparent.pdfwrite();\n// ]]></script>\nAdding a Logo or Image to the Web page View Field\nIf you wish to add an image to a document such as your company logo then the easiest method is to add a \ncustom field\n to your company setting and then reference this field in the \nHTML Template\n. For example, a \ncustom field\n named Logo as Display Only - Image type field. You can then reference this image as \n@branch.logo@\n in the HTML template.\nNote:\n When adding an image from a SmartFolder, and converting the document to PDF, the image link must be a relative reference (/files/123/f1235/image.jpg) instead of an absolute one (with \nhttp://xxx.smartsimple.xxx/files/123/f1235/image.jpg\n).\nDisplaying a Web Page View Field\nThe Web Page View field is displayed as a button.\nWhen you click the button the document is completed and displayed.\n All variables are added, except the salutation field because it is not set in the underlying \nentity\n.\n There are no options available for this document – these must be enabled.\nSuppressing Missing Fields\nA special tag is used to suppress any fields that are missing from the underlying \nentity\n:\n <!--hideifnotfound-->@my variable@\nPlacing this tag \nimmediately\n in front of any field that may not be present will suppress the display of the variable name. (\nNote: there must not be a space between the tag and the variable\n)\nDocument Options\nYou control which options are available to the \nuser\n of each \nWeb Page View\n field.\nEach of the selected options will add a button to the top of the Web Page View field.\nThe following example shows how the field will look with all options enabled:\n \nShow Menu\n – check box that defines if a \nmenu\n should be shown in the document window.\nGeneral Options\n \nAllow Printing\n – enables the \nuser\n to print the resultant document.\n \nAllow Editing\n – enables the \nuser\n to edit the document with the HTML Editor\n \nAllow New Window\n – displays the document in a new window so the \nbrowser’s\n print function can be used.\n \nIs XML\n – indicates that the document is prepared as an \nXML\n output.\nPDF\n Options\n \nEnable Password Protection\n – enables the \nuser\n to \npassword\n protect the document (generally used when the document is going to be emailed).\n \nSend as Email\n – enables the \nuser\n to send the PDF as an attachment to an email message.\n \nSave to Multiple File Field\n – enables the \nuser\n to save the document as a \nPDF\n into any multiple file type fields in the related \nentity\n.\n \nSave to Local Disk\n – enables the \nuser\n to save a local copy of the \nPDF\n document.\nHTML Options\n \nSend as Email\n – enables the \nuser\n to send the document as the body of an email message.\n \nSave to Multiple File Field\n – enables the \nuser\n to save the document as an HTML document into any multiple file type fields in the related [[Entity|entity].\n \nSave to Local Disk\n – enables the \nuser\n to save a local copy of the HTML document.\nDon’t Save as PDF in Edit Mode\nBe sure to save the document and switch to \nPreview\n mode before you save the modified document in a PDF format.\nSee Also\n \nWeb Page View Field Variables\n \nsslogic\n \nssattach\n \nsscalculation\n \nAttach a PDF to a Web Page View\n \nPDF\n \nTranslating Web Page Views\n \nConvert Special Characters to PDF\n \nThree Common Mistakes When Configuring Web Page Views for PDF Conversion\n \nUsing Special Characters in Web Page View\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Web_Page_View_Field&oldid=33924\n’ \nCategories\n: \nSystem Management\nCustom Fields\nPDF",
  "links": [
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Template",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Password",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Template",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Entity",
    "https://wiki.smartsimple.com/wiki/Role",
    "https://wiki.smartsimple.com/wiki/Variables",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Template",
    "https://wiki.smartsimple.com/wiki/Template",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/Template",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Template",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Custom_Field",
    "https://wiki.smartsimple.com/wiki/Custom_Field",
    "https://wiki.smartsimple.com/wiki/Entity",
    "https://wiki.smartsimple.com/wiki/Entity",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Password",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Entity",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Web_Page_View_Field_Variables",
    "https://wiki.smartsimple.com/wiki/Sslogic",
    "https://wiki.smartsimple.com/wiki/Ssattach",
    "https://wiki.smartsimple.com/wiki/Sscalculation",
    "https://wiki.smartsimple.com/wiki/Attach_a_PDF_to_a_Web_Page_View",
    "https://wiki.smartsimple.com/wiki/Translating_Web_Page_Views",
    "https://wiki.smartsimple.com/wiki/Convert_Special_Characters_to_PDF",
    "https://wiki.smartsimple.com/wiki/Three_Common_Mistakes_When_Configuring_Web_Page_Views_for_PDF_Conversion",
    "https://wiki.smartsimple.com/wiki/Using_Special_Characters_in_Web_Page_View"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/2/23/Wpv1.png",
    "https://wiki.smartsimple.com/images/a/a2/Wpv2.png",
    "https://wiki.smartsimple.com/images/5/52/Wpv3.png",
    "https://wiki.smartsimple.com/images/8/8a/Wpv5.png",
    "https://wiki.smartsimple.com/images/c/c8/Wpv6.png",
    "https://wiki.smartsimple.com/images/f/f4/Wpv7.png",
    "https://wiki.smartsimple.com/images/e/ef/Wpv8.png",
    "https://wiki.smartsimple.com/images/b/b7/Wpv9.png"
  ]
}