{
  "url": "https://wiki.smartsimple.com/wiki/Application_Connectivity_Summary_Diagram",
  "title": "Application Connectivity Summary Diagram",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguration—Essentials\n2.1\n \nHow to view the Application Connectivity Summary:\n2.2\n \nHow to use the Application Connectivity Summary:\n3\n \nSettings Explained\nOverview\nThis article covers the Application Connectivity Summary feature, including how to access it, how it is used, and an explanation of its various components.\nThe Application Connectivity Summary diagram is used to help administrators visualize the layout of their SmartSimple system by rendering the consumer-provider relationship between all applications. This both helps promote a more profound understanding of the workings of a given SmartSimple instance, as well as serves as a tool to aid in troubleshooting.\nNote\n: You will need \nGlobal Administrator\n access to view or utilize the \nApplication Connectivity Summary\n feature.\nConfiguration—Essentials\nHow to view the Application Connectivity Summary:\n Signed in as Global Administrator — Click on the \nMenu Icon\n (9 square grid button) \n \nMenu Icon\n \n Under the \nConfiguration\n subsection, select \nTracking Applications\n. \n \nTracking Applications\n In the upper left-hand corner, select \nApplication Connectivity Summary\n button, this will display the Application Connectivity Summary Diagram.\n \nApplication Connectivity Summary Button\n \n \nApplication Connectivity Summary Diagram\nHow to use the Application Connectivity Summary:\n There are two views within the Application Connectivity Summary Diagram.  These are the \nUTA View\n and the \nLevel View\n.                                                               \n Ensure that \nUTA View\n is enabled by ensuring that it is selected from the \nView Dropdown\n on the right side of the action bar below the header. \n \nUTA View\n Within UTA View, select the desired Universal Tracking Application (UTA) to view information about that specific UTA. Upon selecting a tracking application, a Properties Panel will appear on the right side of your screen. This will specify the object type, as well as list the UTAs which hold a consumer/provider relationship with this UTA (under \nProvides To\n and \nConsumes\n). Selecting an underlined linked UTA from the \nProvides To\n and \nConsumes\n lists will then open the details for the selected UTA in the Properties Panel. This will also select the UTA within the Application Summary Diagram to display its connections. \n \nProperties Panel\n From within the Properties Panel, select the \nEdit Application Settings Button\n to open a modal window containing the UTA Settings for the selected UTA. This makes it easier to troubleshoot and make changes to the desired UTA.\n \nEdit Application Settings\n Click the \nShow Details Toggle\n to show/hide the details of objects displayed in the Connectivity Summary Diagram. This includes the UTA Connection Roles, Consumer Creation Buttons, and Association Based Consumer Creation Buttons. \n \nShow Details Toggle\n Change the \nView\n dropdown on the right side of the action bar to \nLevel View\n in order to inspect the relationships between Level 1 and Level 2 Entities within a UTA. An example of such a use-case would be to inspect the relationship of a Review/Panel Manager's Level 1 Committee being consumed by a Submission/Application/Grant Manager's Level 1 Application. \n \nLevel View\n With the \nView\n dropdown set to \nLevel View\n, select the desired UTA Level. Upon selecting a Level Entity, the Properties Panel will appear on the right of your screen. This will specify the object type, as well as list the Level Entities which hold a consumer/provider relationship with this Level Entity (under \nProvides To\n and \nConsumes\n). Selecting an underlined linked Level Entity from the \nProvides To\n and \nConsumes\n lists will then open the details for the selected Level Entity in the Properties Panel. This will also select the Level Entity with the Application Summary Diagram to display its connections.\n From the Properties Panel on the right, select the \nEdit Connection Settings Button\n to open a modal window where you can configure Connections between Level Entities. \nSettings Explained\nSetting\nDescription\n                \nExample\nShow Details Toggle\nThe Show Details toggle displays the details of objects displayed in the Connectivity Summary Diagram. This includes the UTA Connection Roles, Consumer Creation Buttons, and Association Based Consumer Creation Buttons.\n \nShow Details Toggle\nUTA View\nThe Universal Tracking Application (UTA) View displays all UTAs within your instance and the Consumer/Provider relationship between them (signified by the directional arrows).\n \nUTA View\nLevel View\nThe Level View shows all Level 1, 2, and 3 entities and the Consumer/Provider relationships between them (signified by the directional arrows).\n \nLevel View\nProperties Panel\nUpon selecting a desired UTA or UTA Level in the diagram, the Properties Panel will appear on the right side of your screen. This panel displays the object type for the object you have selected, as well as a list of what it consumes and/or provides. Also featured within the panel is the Edit Settings Button as well as the Focus Button.\n \nProperties Panel\nEdit Application Settings Button\nThe Edit Application Settings Button opens a modal window containing the UTA Settings for the selected UTA. This is convenient for troubleshooting and configuration.\n \nEdit Application Settings Button\nFocus Button\nThe Focus Button is used to narrow the view of the Connectivity Summary Diagram to just the selected UTA/Level Entity and its relevant Consumer/Providers. This makes it easier to see the connections of the selected entity by hiding non related entities. Making it easier to troubleshoot connectivity issues.\n \nFocus Button\nEdit Connection Settings Button\nThe Edit Connection Settings Button opens a modal window containing the Connection Settings for the selected Level 1,2, or 3 Entity. This is convenient for troubleshooting and configuration.\n \nEdit Connection Settings Button\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Application_Connectivity_Summary_Diagram&oldid=37166\n’ \nCategory\n: \nTools",
  "links": [],
  "images": [
    "https://wiki.smartsimple.com/images/7/76/Menu_Icon.png",
    "https://wiki.smartsimple.com/images/1/12/Tracking_Applications.png",
    "https://wiki.smartsimple.com/images/2/2b/Application_Connectivity_Summary_Button.png",
    "https://wiki.smartsimple.com/images/f/f5/Application_Connectivity_Summary_Diagram.png",
    "https://wiki.smartsimple.com/images/5/51/UTA_View.png",
    "https://wiki.smartsimple.com/images/8/8b/Properties_Panel.png",
    "https://wiki.smartsimple.com/images/3/35/Edit_Application_Settings.png",
    "https://wiki.smartsimple.com/images/7/7c/Show_Details_Toggle.png",
    "https://wiki.smartsimple.com/images/2/27/Level_View_Dropdown.png",
    "https://wiki.smartsimple.com/images/7/7c/Show_Details_Toggle.png",
    "https://wiki.smartsimple.com/images/5/51/UTA_View.png",
    "https://wiki.smartsimple.com/images/2/27/Level_View_Dropdown.png",
    "https://wiki.smartsimple.com/images/8/8b/Properties_Panel.png",
    "https://wiki.smartsimple.com/images/3/35/Edit_Application_Settings.png",
    "https://wiki.smartsimple.com/images/a/a0/Focus_Button.png",
    "https://wiki.smartsimple.com/images/4/4d/Edit_Connection_Settings.png"
  ]
}