{
  "url": "https://wiki.smartsimple.com/wiki/Association_Settings",
  "title": "Association Settings",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nIntroduction\n2\n \nConfiguring Associations\n2.1\n \nEnable Association feature\n2.2\n \nCreate List Views\n2.3\n \nConfigure Associations tab on Org Profile, including Lookup and Assignment Roles\n2.3.1\n \nLookup Roles\n2.3.2\n \nAssignment Roles\n2.4\n \nConfigure Associations tab on User Profile, including Lookup Categories\n2.4.1\n \nLookup Categories\n2.5\n \nEnable Date Range for Associations (optional)\n2.6\n \nDisable Switch Organization feature (optional)\n2.6.1\n \nEnable Switch Organization variables\nIntroduction\nThe Association feature provides the ability to link a single contact to multiple organizations. This feature is required to match real-word situations such as:\nA contract is the Executive Director of one organization but a board member at several other organizations.\nA contact is a professor at a university and a consultant at a hospital as well as the CEO of a start-up company.\n A contact is an individual artist but a collaborator in multiple arts collectives.\nThe relationship between the contact and the associated organization is control by Role. So when you view a contact you will see all the organizations they are associated with as well as the role at each organization.\nAn Associations tab can be displayed on a company record to show associated people and on a contact record to display the companies that they are associated with.\nConfiguring Associations\nThe steps for configuring are as follows: \n Enable Association feature\n Create List Views\n Configure Associations tab on Org Profile, including Lookup and Assignment Roles \n Configure Associations tab on User Profile, including Lookup Categories\n Enable Date Range for Associations (optional)\n Enable Switch Organization feature (optional)\nEnable Association feature\nThe feature is accessed through the Global Settings - Organizations or Global Settings - Users tab.\n Check the box beside the \nEnable Associations\n setting.\n Additional Association settings are exposed.\n Click Save at the bottom of the page. \nCreate List Views\nThe List View settings on this page allow System Administrators to define the \nlist views\n for Associated records on different profiles.\nThe Contact Association List View settings will control how the list of Associated Contacts will appear when viewed from inside an Organization profile.\nThe Organization Association List View settings will control how the list of Associated Companies will appear when viewed from inside a User profile. \nSee \nConfiguring List Views\n for instructions.\nConfigure Associations tab on Org Profile, including Lookup and Assignment Roles\nThe Association tab appears on the Company Profile once the corresponding standard field is enabled. \nThe steps for enabling the Association tab are as follows:\n Go to Global Settings - Organizations or Global Settings - Users tab\n Go to Company & Organization Settings and click on Standard Fields\n Click on the Edit option for the Associations Standard field\n Click Save. The Associations tab is now enabled. \nThe Standard field also controls the Lookup Roles and Assignment Roles used within the Associations tab. \nLookup Roles\nLookup roles allows System Administrators to delimit the roles that are returned when Associations are selected. Only those users in the roles selected in \nLookup Roles\n will be selectable from the contacts lookup.\nThe steps for configuring the Lookup Roles are as follows:\n Use the Lookup Scope radio buttons to specify whether the list of users are restricted to internal users, external users or both.\n Click on the Lookup button to the right of the Lookup Roles field. \n The Roles pop-up should appear. Populate checkbox for those roles to be returned when associated users are selected. \n Click OK to close Roles pop-up. The selected roles should appear in the Lookup Roles field. \n Click Save at the bottom of the page. \nAssignment Roles\nAssignment Roles allows System Administrators to delimit the roles with which contacts can be associated with an organization. Only those roles selected in \nAssignment Roles\n will be able to be selected from the \nRole\n dropdown when associating a contact to an organization.\nThe steps for configuring the Assignment Roles are as follows:\n Click on the Lookup button to the right of the Assignment Roles field. \n The Roles pop-up should appear. Populate checkbox for those roles used when associating contacts with an organization. \n Click OK to close Roles pop-up. The selected roles should appear in the Assignment Roles field. \n Click Save at the bottom of the page.\nConfigure Associations tab on User Profile, including Lookup Categories\nThe Associations tab appears on the Contact Profile once the corresponding standard field is enabled. \nThe steps for enabling the Associations tab are as follows:\n Go to Global Settings - Organizations or Global Settings - Users tab\n Go to Staff & Contact Settings and click on Standard Fields\n Click on the Edit option for the Associations Standard field\n Click Save. The Associations tab is now enabled. \nThe Standard field also controls the Lookup Categories used within the Associations tab. \nLookup Categories\nLookup categories allows System Administrators to delimit the categories that are returned when associated organizations are selected. Only those organization in the categories selected in \nLookup Categories\n will be selectable from the organization lookup.\nThe steps for configuring the Lookup Categories are as follows:\n Use the Lookup Scope radio buttons to specify whether the list of organizations are restricted to internal organizations, external organizations or both.\n Click on the Lookup button to the right of the Lookup Categories field. \n The Categories pop-up should appear. Populate checkbox for those categories to be returned when Associated companies are selected. \n Click OK to close Categories pop-up. The selected categories should appear in the Lookup Categories field. \n Click Save at the bottom of the page. \nEnable Date Range for Associations (optional)\nWhen you configure Associations you have the option to enable a date range. This will allow a start and end date to be entered when creating Associations. \nA daily automated process checks the company-user associations and if it finds any with end dates that have passed and where the status isn't Expired then it will expire them. \nThe steps for configuring the date ranges are as follows:\n Check the box beside the \nEnable Date Range\n setting.\n Click Save at the bottom of the page. \n Click on the Standard Fields, access the Start or End Date standard fields. \n Click Save. The Date standard field is now enabled.\nDisable Switch Organization feature (optional)\nOften users may have multiple associations to multiple organizations, but with each association having a different role and consequently requiring a different level of access (e.g. user may be Staff with one organization, with access to all data, and a Reviewer with a second organization where they may need more restricted access).\nThe \nSwitch Organization\n setting provides the option to prevent switching between the Associated organizations,. \nThe steps for configuring are as follows:\n Click on the Lookup button to the right of the Disable Switching between Portals field. \n The Roles pop-up should appear. Populate checkbox for those roles that the Switch Organization feature should be unavailable for. \n Click OK to close Roles pop-up. The selected roles should appear in the Disable Switching between Portals field. \n Click Save at the bottom of the page. \nIf a user is not in one of the selected roles then they will see the Switch Organization option appear along the top of their instance. \nIf they click on this then they will be presented with the Switch Organization lightbox, which includes a drop-down that lists there parent organization and all organizations they are associated with. \nWhen they select a different organization then there session will temporarily update to reflect the interface and level of access for the associated role. \nEnable Switch Organization variables\nYou can use the \nsessioncompany\n variable syntax if there is a need to filter information (e.g. date returned in list views) based on what organization you have switched to.\nThe syntax is as follows: \n@sessioncompany.FIELD@\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Association_Settings&oldid=30326\n’ \nCategories\n: \nGlobal Settings\nSystem Management",
  "links": [
    "https://wiki.smartsimple.com/wiki/List_view",
    "https://wiki.smartsimple.com/wiki/Configuring_List_Views",
    "https://wiki.smartsimple.com/wiki/System_Feature_Permissions#Arcadia_Permission"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/d/d9/Associations1.png",
    "https://wiki.smartsimple.com/images/f/f9/AssociationSettingsPickingAssociates.png",
    "https://wiki.smartsimple.com/images/d/de/AssociationSettingsAssignmentRolesSelected.png",
    "https://wiki.smartsimple.com/images/6/6d/AssociationSettingsAssignmentRoles.png",
    "https://wiki.smartsimple.com/images/1/16/AssociationsDateRange.png",
    "https://wiki.smartsimple.com/images/8/82/AssociationSwitch1.png",
    "https://wiki.smartsimple.com/images/4/4d/AssociationSwitch2.png"
  ]
}