{
  "url": "https://wiki.smartsimple.com/wiki/Auto_Loader",
  "title": "Auto Loader",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nAn \nAutoloader\n is a SmartSimple feature used to automatically import data related to \ncompanies\n, \ncontacts\n or \nUniversal Tracking Applications\n. This allows you the ability to automatically update information with data from external text files which can be vital if you need to keep customer or project data in sync with an existing legacy or enterprise resource planning (ERP) system.\nContents\n1\n \nOverview\n2\n \nAutoloader\n2.1\n \nPrerequisites\n2.1.1\n \nCreating a SmartFolder/Configuration Folder\n2.1.2\n \nPreparing the file to upload into the autoloader\n2.2\n \nConfiguration - Essentials\n2.3\n \nConfiguration - Advanced\n2.3.1\n \nColumn Mapping\n2.3.2\n \nManual/Automated Autoloader\n2.3.2.1\n \nTriggered by sending a file to the SmartFolder/Configuration Folder\n2.3.2.2\n \nAutomated Schedule\n2.3.3\n \nDecryption\n2.3.4\n \nUploading Specific Files to Specific Records in Bulk\n2.3.5\n \nExternal Data Source\n2.3.5.1\n \nFTP and SFTP\n2.3.5.2\n \nHTTP\n2.3.5.3\n \nSOAP\n2.3.5.4\n \nOData\n2.3.6\n \nFile Preparation\n2.4\n \nSettings Explained\n2.4.1\n \nGeneral\n tab\n2.4.2\n \nProcess\n tab\n2.4.2.1\n \nCreate Options\n2.4.2.1.1\n \nCompany Record / Company Item\n2.4.2.1.2\n \nContact Record / Contact Item\n2.4.2.1.3\n \nCompany or Contact Record / Event or Transaction Item\n2.4.2.1.4\n \nUTA Record / all Levels\n2.4.2.2\n \nUpdating Account Owners\n2.4.2.3\n \nUpdating Account Parent\n2.4.2.4\n \nUpdating Event / Transaction Parent Company\n2.4.2.5\n \nUpdating Parent Company\n2.4.2.6\n \nUpdating Event / Transaction Parent User\n2.4.2.7\n \nBranch, Company and Owner Custom Field Matching\n2.4.2.8\n \nUpdating Tracking Parent\n2.4.2.9\n \nParent record match field ids\n2.4.2.10\n \nAd hoc upload url\n2.4.3\n \nHistory\n Tab\n2.5\n \nExample autoloader configurations\n2.5.1\n \nOrganization autoloader\n2.5.2\n \nHR Feed autoloader\n2.5.3\n \nUTA L1 autoloader\n2.5.4\n \nExample how to use \nad hoc upload url\n2.6\n \nOther considerations\n2.6.1\n \nImportant note about XML Files\n2.6.2\n \nNote about JSON Files\n2.6.3\n \nReference: Standard Field Names and Variables\n2.7\n \nSee Also\nOverview\nThe \nAutoloader\n feature provides the ability to automatically create/update SmartSimple information with data from an external file. A general overview of the process is as follows: \n Once a file is added to the \nSmartFolder\n/\nConfiguration Folder\n, the Autoloader process will recognize that a file has been added and start the upload process.\n Once the file has been processed, it will not be processed a second time unless a new file of the same name is added to the folder.\n Each record from the uploaded file will update the associated record in the database.\n A log file will be created to indicate the success or failure of each record update and an email can be sent to a designated user to notify them of the success (or failure) of the upload.\n If a new version of the file is added to the folder, the new file will be processed.\n An Autoloader can upload to different objects within your SmartSimple instance: \ncompanies\n, \ncontacts\n, \nUniversal Tracking Application\n \nLevel 1\n or \nLevel 2\n, \nLevel 3\n,, \nNotes\n, \nAssociations\n.\nAutoloader\nPrerequisites\n You must be a \nGlobal User Administrator\n in your \ninstance\n of SmartSimple to access the Autoloader feature and set up an upload process.\n The user uploading the file must have write permissions to the folder where the file is to be stored.\n You \nmust\n not use the upload folder for any purpose other than uploading files, as the autoloader will attempt to process any file added to the folder.\nCreating a SmartFolder/Configuration Folder\n Any \nSmartFolder\n/\nConfiguration Folder\n can be used as the source for an Autoloader.\n The folder must be used \nexclusively\n for the Autoloader, since every file uploaded will be processed.\n Incorrect files or incorrectly formatted files \nwill be processed\n and could lead to data loss and/or creation of invalid data.\nIMPORTANT:  \nBecause any file uploaded to a \nSmartFolder\n/\nConfiguration Folder\n that is associated to an autoloader will be processed, it is extremely important that the SmartFolder/Configuration Folder is permissioned and labelled appropriately.\n \nSmartFolder\n/\nConfiguration Folder\n for Autoloaders should be permissioned such that only contacts that need to be able to upload files for autoloading are permitted to do so.\n It is \nbest practice\n to put all Autoloader enabled \nSmartFolder\n/\nConfiguration Folder\n into a parent folder named \nAutoloader\n (with role-restricted access) to help ensure no inappropriate files are uploaded to the folder.\n In creating a new \nConfiguration Folder\n, specify \"Autoloader/Export Storage\" as Folder Type.\nPreparing the file to upload into the autoloader\nDefine the format and layout of the data file - the number of columns in the upload file, the delimiter between each field and the field order.\n You must be able to specify a unique field that will be used to link each record in the upload file to each record in the customer record. You cannot use a standard field such as customer name or phone number.\n This common field needs to be present in each record on the upload file and in each customer record. For instance, a unique account number field that you add to the customer table can be linked to the same account number field in the upload data.\n The file to be uploaded must be in \nASCII\n format. There is no specific file naming convention.\n Each record in the file must be separated by a CR/LF (ASCII 13,10 /D,A) character combination.\n Each field must be delimited by one of the following characters:\nComma – “,” (ASCII 44/2C)\nTab – (ASCII 9/9)\nPipe – “|” (ASCII 179/B3)\nSemi colon – “;” (ASCII 59/3B)\nColon – “:” (ASCII 58/3A)\n This can be accomplished either using Notepad to create and edit the data for import which can be saved with \ntxt\n as the file extension.\n Alternately you can use the \nSave As\n feature within Microsoft Excel and save the document as a \ncsv\n file.\nNotes:\n If any of the data to be imported contains commas and you are creating a \ncsv\n file from Excel you should export the data using pipes (|) as the separators rather than commas. To do this you need to change the settings on your PC prior to creating the \ncsv\n file. The method of doing this depends on your PCs Operating System, but is roughly outlined below:\nStart -> Settings -> Control Panel -> Regional Settings -> Additional Settings Button.\nClick the \"Number\" tab and in the \"List Separator\" field, \nReplace the current default separator with the one you want to use (such as the pipe symbol | ). \n If you use Microsoft Excel to create a \ncsv\n file it is recommended that you open the document with Notepad to review the contents prior to Autoloading. If any of the data within the Excel document had line breaks within cells it will create a line break in the \ncsv\n document. Each new line in the \ncsv\n document will start a new record, thus you must ensure all inner-cell line breaks are removed from either Excel or the \ntxt\n document.\n Alternately when performing a CSV import, any columns that have line breaks or delimiters within the content can be contained within double quotes. NOTE: Any double quotes within that content MUST be escaped with a backslash \\ in front of the double quote so they aren't treated as the closing quote of the column. Example of a 4-column CSV:\n1st Record|Draft|\"This content\"|555-1212\n2nd Record|Submitted|\"That content\"|123-4567\n3rd Record|Draft|\"Broken \nContent\"|444-5555\n4th Record|Draft|\"Normal Content Test\"|321-9876\n5th Record|Submitted|\"Backslash Escaped \\\" quote content\nAlso with \nmultiple line breaks\"|777-8888\n6th Record|Submitted|\"Normal Content again\"|111-2233\n If the file has special characters, convert encoding to UTF-8.\n If columns has a number sign after the comma, always add double quotes to avoid data problem when processing the file.\nNote:\n The number of rows in the selected file cannot exceed 100,000\n The number of columns in the selected file cannot exceed 100\n File should not contain a cell that exceeds the character limit of 32,000\nConfiguration - Essentials\nThese are the mandatory fields in creating a basic autoloader:\n1. Essential settings in the \nGeneral Tab\n Set the \nLoader Name\n Select the \nFolder Type\n: \nSmartFolder\n or \nConfiguration Folder\n Click the Folder Lookup button and select the folder assigned to this autoloader\n Select the \nFile Type\n Select the \nFile Encoding\n Define the \nRecord Type\n for this autoloader\n Select \nItem\n of the \nRecord Type\n Activate the autoloader\n2. Essential settings in the \nFile Layout Tab\n Select the \nNumber of Columns\n - based on the file sample to be uploaded into this autoloader\n \nIgnore Lines\n should be 1, if the file has header in row 1\n Select \nField Delimiter\n from the dropdown list\n Define the column mapping based on the field columns of the file to the \nRecord Type\n fields from the dropdown.\nNote that you can toggle the identifier if the file has a unique identifier. This will ensure integrity of the data being added/updated.\n3. Essential settings in the \nProcess Tab\n Go to the \nCreate / Update Options\n section and select \nCreate / Update Behaviour\n for the autoloader.\nOnce all three tabs have been configured, click on \nSAVE\n button. The autoloader is now ready to process the file that will be fed to the \nSmartFolder\n or \nConfiguration Folder\n selected for this autoloader.\nConfiguration - Advanced\nColumn Mapping\nOnce you have defined the number of fields, you define the field order to match the column order in the upload file.\n \n \n The \nnumber of columns\n you select determines the number of fields you can map.\n \nIdentifier\n. Enable the column that you have identified as the identifier.  This is important when you are updating existing records. Single/multiple field(s) is/are required to match an uploaded record to an existing record within the system.  \n The\n Table header\n field is only required if you are using an XML or JSON file. You can fill out this section with the column headers of the file you want to upload.\n \nField \nis selected thru a dropdown box. (see the Reference section below for information on standard field names)\nIMPORTANT:\n \nThe following fields must only be included in the Autoloader field mappings if you are updating \nexisting\n records. These fields \nmust not\n be used when using the Auto Loader to create new records.\n \nCompany ID\n (Company Auto Loader)\n \nUser ID\n (Contact Auto Loader)\n \nResource ID\n (Resource Auto Loader)\n \nTracking ID\n (\nLevel 2\n / \nLevel 3\n Auto Loader)\n When using the fields above the IDs being Auto Loaded must match IDs of records present within the system.\n If used the fields should be marked as the Identifier.\n These fields would normally be used if you have extracted data from \nSmartSimple\n including those ID fields, updated the data outside of \nSmartSimple\n and wish to import the updated information.\nNOTE:\n  \n1. If you wish to deactivate a user using the Autoloader then select the \nDisable User Login (use value of 1)\n Field option and ensure that the uploaded file has a value of 1 in the relevant cells.\n2. If the Item or App Level option is set to one of the Association options then you can only have Associations ID as identifier. The system we will force the Identifier when Associations ID is selected in mapping, and will only alert them when they try to set any other columns as identifier.\nManual/Automated Autoloader\nTriggered by sending a file to the SmartFolder/Configuration Folder\nAutomated Schedule\nHere is a more detailed look at the automated \nScheduler\n.\nDecryption\nPGP decryption is available in the autoloader and occurs when the file is picked up for processing.\nPGP encryption and decryption keys should be added in the \nIntegration_Key_Management\n section.\nTo configure this setting, go to the autoloader configuration page and under the General tab go to the \nDecryption\n section, select the desired PGP decryption key to use before the autoloader processes the file.\nUploading Specific Files to Specific Records in Bulk\nThe autoloader also allows you to upload specific files to specific records in bulk. Previously, if you had several files across multiple records that needed to be updated within a specific UTA, user, or company, finding each record and manually uploading those files would be tedious, especially if the files needed to be updated on a regular cycle. Now you can upload all the files in bulk and the system will unpack and distribute those files to the fields you specified accordingly.\nTo use this feature, follow these steps:\n Create a CSV file containing mandatory columns (\nFile Name\n and \nCustom Field ID\n) and the relevant identifier columns for the record type.\n Create a ZIP file that contains the files you want to upload or replace. Make sure the ZIP file and the CSV file have the same name.\n Go to \nMenu Icon\n > \nAutoloaders\n > Create or edit an autoloader > Select the desired \nProcessing Folder\n.\n Set the \nFile Type\n to “CSV, Text”.\n Under \nRecord Type\n, select the desired record type you want to target (\"UTA\", \"People\", or \"Company\").\n Under Item, select the new “File Upload” option. If you selected a UTA as a your \nRecord Type\n, you will be prompted to select the desired Level 1, 2, or 3.\n Configure the column mappings as usual.\n Upload the CSV and ZIP file to the processing folder you selected in Step 3.\nNote:\n This new option does not create new records or update other columns. The “File Upload” item only uploads files.\n \nUse the new \"File Upload\" option to have the autoloader unpack a ZIP file and upload/replace files to specific upload fields as specified in a CSV file.\n \nThe CSV file must have the same name as the ZIP file and it must specify the record ID, upload field ID, and file name.\nExternal Data Source\nThis section allows for the configuration of an external file source if the user does not want to manually upload the file.\nThe \nExternal Data Source\n is a drop-down list with 5 options available:\nAdditional fields are exposed when one of these options is selected, with the exact number and type of fields dependent on the selected option.\nFTP and SFTP\n \nDisable processing. Download file only\n - if checked then the system will only pull the file across into SmartSimple, but will not load the contents of the file\n \nDelete File from Data Source After Downloaded\n - file will be deleted from the sftp site\n \nAppend Datetime Stamp to File Name\n - will append date and time when the file picked up from the sftp do not have a datestamp\n \nURL\n - the URL where the file(s) can be retrieved from. e.g. \nmy.sftp.com\n or \nmy.sftp.com:2222\n \nLogin Name\n - username to allow access to the system\n \nLogin Password\n - password to allow access to the system\n \nUse Private Key\n - enable this setting when using keys as credentials to authenticate\n \nPrivate Key File\n - upload the private key file\n \nPath\n - exact folder location on the system where the files can be found i.e. \"/\" for root directory or \"/in\" or \"/out\"\n \nFile Names\n - name of the files to be loaded via the Autoloader. e.g. HRFeed.csv, Payment_*.csv (Use \n*\n for wildcards in filenames. < br/>\nNote that when settings are saved, a \nVerify Connection\n button will appear next to the Login Name Textbox. This button can be used to verify that the url, username, password are correct.\nHTTP\n \nDisable processing. Download file only\n - if checked then the system will only pull the file across into SmartSimple, but will not load the contents of the file\n \nURL\n - the URL where the file(s) can be retrieved from\n \nFile Names\n - name of the files to be loaded via the Autoloader\nSOAP\n \nDisable processing. Download file only\n - if checked then the system will only pull the file across into SmartSimple, but will not load the contents of the file\n \nURL\n - the URL where the file(s) can be retrieved from\n \nLogin Name\n - username to allow access to the system\n \nLogin Password\n - password to allow access to the system\n \nFunction\n - The function called by the Web Service call.\n \nRequest Body\n - The content of the Web Service message to be sent to the external service.\n \nCallback\n - Method to sends the response back to the client.\nOData\n \nOData Version\n - Version of OData available from the endpoint\n \nURL\n - the endpoint of OData\n \nLogin Name\n - username to allow access to the system\n \nLogin Password\n - password to allow access to the system\nFile Preparation\nThis section allows for manipulation of the data prior to the Autoloader actually loading the data onto the system.\nIt is only available when the \nFile Type\n is either \nCSV,Text\n or \nFixed Length Text\n.\nIt is not available when \nFile Type\n is XML.\nSee \nAutoloader File Preparation\n for configuration instructions.\nSettings Explained\nThis section describes the detailed steps required to use the Autoloader. Carefully examine, using a file editor, the file that will be uploaded.\nEnsure that the file meets the file layout criteria outlined in the previous section:\n Choose the Configuration, \nGlobal Settings\n menu.\n Stay on the System tab and scroll down the page.\n Click the \nAutoloader\n link.\n Click the New Autoloader tab.\n Go thru each of the three tabs.\nGeneral\n tab\n \nSetting the Autoloader Name\nAs you can define any number of autoloaders each autoloader process must be uniquely named.\n Set the name for this autoloader process.\n \n \nSetting the Folder Type\n Select Folder Type: \nSmartFolder\n  or \nConfiguration Folder\n Click the Folder Lookup button to display the list.\n Select the folder where you plan to add the file.\n \n \nThe folder name will be added to the Folder box.\nSetting the File Properties\nThe File Type can be a CSV,Text file, an XML file, Fixed Length, or JSON data.\nThe File Encoding can be UTF-8, UTF-16 or ANSI. This option is hidden if the File Type is XML.\n \n \nDefining the Record Type\nThe Record type can be Company, Contact, Resource or a \nUniversal Tracking Application\n.\nIf the selected Record type is Company or Contact then the user is required to populate an additional Item field. The possible options here can include Company or Contact, Event,Transactions, Address and Associations (User or Company) .\nIf the selected Record type is a \nUTA\n then the user is required to populate an additional Level field. The possible options here can include Level 1, Level 2, Level 3, Transactions, L1 Company Association, L1 Contact Association, L2 Company Association and L2 Contact Association.\n \n \nIf the selected Record type is a \nUTA\n and the selected Level is Transaction then the user is required to populate an additional drop-down field reflecting all the levels that the transactions are enabled against.\n \n \nActivate Autoloader\nEnable this check box for the Autoloader to execute.\nExternal Data Source\nAutoloader can be connected an external data source to pull the file and move the file to the SmartFolder.\n \n \nSelect a connection type and complete the \nSchedule\n section below to specify the launch times of the autoloader everyday.\nFile Layout\n Tab\nThe File Layout section is used to determine the number of columns in the file and the Field Delimiter.\n \n \nNumber of Columns\n - The number of columns you select is used to define the number of columns in the upload file, and the number of fields that can be updated in the database.\n The maximum number of fields that can be updated is 100 fields in a single file.\n If more than 100 fields are required, then you will need to create two upload files.\n \nIgnore Lines\n - You can specify the number of rows to ignore from the beginning of the file. This can be used to ignore column headers, if they exist as the first row in any file.\n \nField Delimiter\n - drop-down list showing the delimiter options used to separate different values in the file into different columns. Will not be presented when the File Type is XML or JSON.\n \nRecord Node Name\n - Only presented when the File Type is XML.\n \nRecord Node Filter\n - Only presented when the File Type is XML.\nProcess\n tab\n \n \nWorkflow before loader starts\n – drop-down list that contains a list of all workflows in the system. It defaults to No and if users wants to have a workflow execute before the Autoloader adds the data to the system they should select the relevant workflow.\n \nWorkflow after loader ends\n – drop-down list that contains a list of all workflows in the system. It defaults to No and if users wants to have a workflow execute after the Autoloader adds the data to the system they should select the relevant workflow.\n \nRun report after loader ends \n- drop-down list that contains a list of all reports in the system.  It will ran the configured \nScheduled Export\n of the report.\n Frequency\n on the report should bet set to \nOn Demand\n.\n \nRun sequencial Autoloader after loader ends\n – \nLinking Autoloaders\n \nTrigger Formulas\n – enables the triggering of any template formulas that may exist for the selected record type and item/level. If this check box is not enabled then these formulas will not execute.\n \nSend email with log when Autoloader is done\n – Sends email every time the Autoloader executes with a report of the upload process.(Note: The log file is also stored in the same folder as the uploaded file.)\n \nSend email notification when Autoloader failed to complete\n – Sends email when ftp/sftp connection failed, or when autoloader process was terminated unexpectedly.\n \nSend email with log when Autoloader has any failed records \n- Sends email when autoloader fails to complete.\n \nEmail To\n – Sets the email address who will receive a message. Multiple email addresses can be included separated by commas.\nCreate Options\nThis section of the Autoloader is used to determine how new records in the upload file should be handled.\nThe exact fields that are displayed vary depending on the \nRecord Type\n and \nItem\n or \nList\n values previously selected.\nCompany Record / Company Item\n \n \nCreate/Update Behavior\n - If you wish to create new record, then enable the \nCreate new or update matching record\n check box. If you enable the other check box \nUpdate only, do not create new\n, existing records will be updated but new records will be rejected.\n \nDuplicate Match Behavior\n - behavior when multiple records are matched by the same identifier key. Drop-down allows user to specify the behaviour whenever multiple records are matched using the Identifier field(s).\n Update Unique Match Only - will only update when one matching record is found\n Update All Matches - will update all matching records\n \nAccount\n – determines where in the organisational hierarchy new records should be added.\n \nIs External\n – choose this option when creating external companies under the root company.\n \nCategory\n – determines the organisational category that you wish to be associated with the new records.\n \nTrigger Workflow\n – drop-down list of all workflows related to the \nRecord Type\n. It defaults to N/A.\n \n Trigger On All Records \n - check-box that is populated is you wish to have a workflow execute against all records, whether new records or updated records. This can be used to create companies with multiple categories.\nContact Record / Contact Item\n \n \nCreate/Update Behavior\n - If you wish to create new record, then enable the \nCreate new or update Matching record\n check box. If you do not enable the other check box \nUpdate only, do not create new\n existing records will be updated but new records will be rejected.\n \nDuplicate Match Behavior\n - behavior when multiple records are matched by the same identifier key.\n \nAccount\n – determines where in the organisational hierarchy new records should be added.\n \nRole\n – determines a user role that you wish to be associated with the new records. If you wish to have multiple roles associated with a user then you will need to trigger a workflow against each record (see below for further details).\n \nTrigger Workflow\n – drop-down list that of all workflows related to the \nRecord Type\n. It defaults to N/A.\n \n Trigger On All Records \n - check-box that is populated is users wants to have a workflow execute against all records, whether new records or updated records. This can be used to activate users with multiple roles and to e-mail a password to newly created contacts automatically.\nCompany or Contact Record / Event or Transaction Item\n \n \nCreate/Update Behavior\n - If you wish to create new record, then enable the \nCreate new or update Matching record\n check box. If you do not enable the other check box \nUpdate only, do not create new\n existing records will be updated but new records will be rejected.\n \nDuplicate Match Behavior\n - behavior when multiple records are matched by the same identifier key. Drop-down allows user to specify the behaviour whenever multiple records are matched using the Identifier field(s).\n Update Unique Match Only - will only update when one matching record is found\n Update All Matches - will update all matching records\n \nType\n – drop-down list of all Event or Transaction types, depending on the exact \nItem\n selected. It defaults to N/A\n \nStatus\n – drop-down list of all Event or Transaction statuses, depending on the exact \nItem\n selected. It defaults to N/A\n \nTrigger Workflow\n – drop-down list that of all workflows related to the \nRecord Type\n. It defaults to N/A.\n \n Trigger On All Records \n - check-box that is populated if users wants to have a workflow execute against all records, whether new records or updated records.\nUTA Record / all Levels\n \n \nCreate/Update Behavior\n - If you wish to create new record, then enable the \nCreate new or update Matching record\n check box. If you do not enable the other check box \nUpdate only, do not create new\n existing records will be updated but new records will be rejected.\n \nDuplicate Match Behavior\n - behavior when multiple records are matched by the same identifier key. Drop-down allows user to specify the behaviour whenever multiple records are matched using the Identifier field(s).\n Update Unique Match Only - will only update when one matching record is found\n Update All Matches - will update all matching records\n \nType\n – drop-down list of all Level 1, Level 2, Level 3 or Transaction types, depending on the exact \nLevel\n selected. It defaults to N/A\n \nStatus\n – drop-down list of all Level 1, Level 2, Level 3 or Transaction statuses, depending on the exact \nItem\n selected. It defaults to N/A\n \nTrigger Workflow\n – drop-down list of all workflows related to the \nRecord Type\n. It defaults to N/A.\n \n Trigger On All Records \n - check-box that is populated if you wish to have a workflow execute against all records, whether new records or updated records.\nUpdating Account Owners\nWhen you are updating company type information you can automatically associate an account field to a user field in order to establish “account ownership”. This section is only displayed at the bottom of the Autoloader page if you have set the Record Type to Company and Item to company.\nFor example, if the imported account file contains an employee ID field, then this can be matched to the user table – providing each user with an employee ID field.\nUpdating Account Parent\nWhen you are updating company type information you can automatically associate an account field to a parent account field in order to establish “company hierarchy”. This section is only displayed at the bottom of the Autoloader page if you have set the Record Type to Company and Item to company.\nFor example, if the imported account file contains a parent ID field, then this can be matched to the account table – providing each company with a parent company.\nExample: Updating Account Parent AutoLoader Configuration:\nThe AutoLoader Parent ID field is an Account field that will get populated with the second value (Parent ID) from the CSV record below.\nExample: AutoLoader Source File:\nAction: A two column report with the Company ID and the Parent ID needs to be created, exported to a CSV file and uploaded to the associated AutoLoader SmartFolder. \nResult: The Account records with a Company ID IN (278520,297733,316703) will have their Parent ID changed to 349238.\nUpdating Event / Transaction Parent Company\nWhen you are updating company type information related to an Event or a Transaction you can automatically associate an account field to a transaction or event field in order to establish a parent for the transaction. This includes using Account standard fields.\nIf no matches exist then you can select the required action using the \nNo parent matched action\n drop-down.\n Reject Record - record is not loaded into the system\n Add as orphan record - record is loaded into the system but without being attached to a parent company\n Attach to dummy account - record is loaded into the system and is attached to the parent company specified in the \nDefault Parent ID\n field.\nThis section is only displayed at the bottom of the Autoloader page if you have set the \nRecord Type\n to Company and the \nItem\n to either Event or Transaction.\nUpdating Parent Company\nWhen you are updating people type information you can automatically associate an account field to a user field in order to attach the user to the correct account. This section is only displayed at the bottom of the Autoloader page if you have set the Type to People.\nUpdating Event / Transaction Parent User\nWhen you are updating user type related to a Transaction information you can automatically associate a user field to a transaction field in order to establish a parent user for the transaction.\nIf no matches exist then you can select the required action using the \nNo parent matched action\n drop-down.\n Reject Record - record is not loaded into the system\n Add as orphan record - record is loaded into the system but without being attached to a parent company\n Attach to dummy account - record is loaded into the system and is attached to the parent company specified in the \nDefault Parent ID\n field.\nThis section is only displayed at the bottom of the Autoloader page if you have set the \nRecord Type\n to People and the \nItem\n to either Event or Transaction.\nBranch, Company and Owner Custom Field Matching\nWhen you are updating UTA information you can automatically associate a standard field on the UTA with user and company fields in order to establish individual or organizational ownership. This section is only displayed at the bottom of the Autoloader page if you have set the Record Type to \nUTA\n and the Level to Level 1.\nUpdating Tracking Parent\nWhen you are updating UTA Level 2 or 3 information you can automatically associate a field on the level 2 with a field on the level 1, or associate a field on the level 3 with a field on the level 1, in order to establish a relationship between the entities.\nIf no matches exist then you can select the required action using the No parent matched action drop-down.\n Reject Record - record is not loaded into the system\n Add as orphan record - record is loaded into the system but without being attached to a parent company\n Attach to dummy account - record is loaded into the system and is attached to the parent entity specified in the Default Parent ID field.\nThis section is only displayed at the bottom of the Autoloader page if you have set the Record Type to \nUTA\n and the Level to Level 2 or Level 3.\nParent record match field ids\nThis section allows for manipulation of the data prior to the Autoloader actually loading the data onto the system.\nIt is only available when the \nFile Type\n is \nXML\n.\nAd hoc upload url\nThis is an Autoloader setting that provides a more friendly and accessible user interface for importing data into the system as well as allowing users to verify the file before uploading it to a SmartFolder for processing by the Autoloader. This feature is intended to be used when External Data Source is not configured.\nHistory\n Tab\nAvailable after February 2019 upgrade.\n \nA new Autoloader feature that shows a new History information tab. The list includes the file name, user who uploaded the file, start time, end time, records added/updated and status of last run.\n \n#\n - item number\n \nFile\n - filename that was processed. If the file is deleted from the SmartFolder, the filename will not be displayed on the list.\n \nUploaded By\n - name of the user who uploaded the file\n \nStart Time\n - date and time the file was processed\n \nEnd Time\n - date and time the file was completed\n \nAdded\n - number of records that were added\n \nUpdated\n - number of records that were updated\n \nFailed\n - number of records that failed to update/add\n \nStatus\n - status of the process.   \n \nProcessing\n - the file is currently being processed and is not yet complete\n \nCompleted\n - the file was successfully processed and was completed\n \nInterrupted\n - the process was terminated i.e. GORT was terminated abruptly (someone restarted the server)\n \nData Problem\n - the file has data problem i.e. pound sign at the start of the column . data with # should be enclosed in double quotes e.g. ,\"another column\",\"#111 Peter Street\",\"another column\",\n \nConnection Failed\n - external data source connection failed\n \nNo file / download file failed\n - connection was established but no file was existing in the external data source subfolder\n \nFile problem\n \n \nFile failed pre-processing\n \n \nError processing file\n \n \nWrong file type\n \n \nProcess ID\n - unique identifier of the process\nExample autoloader configurations\nOrganization autoloader\nHR Feed autoloader\nUTA L1 autoloader\nExample how to use \nad hoc upload url\nWhen you click on the Upload File button then you will be presented with page one of the Ad Hoc Autoloader screen. Use the 'Choose file' button to select the file to be loaded and then click the 'Upload' button.\nYou will be presented with page 2 of the Ad Hoc Autoloader screen, which provides users the option to review the file being uploaded, including what data us being mapped to what field.\nIf there is no issue with the data and the mappings then click on the 'Add to SmartFolder and Autolader queue' button. You should be presented with page 3 of the Ad Hoc Autoloader screen, which confirms that the file has been successfully added to the SmartFolder.\nOther considerations\nImportant note about XML Files\nIf the contents of any the elements in an XML file being autoloaded contains certain special characters it will disrupt the XML structure, making the message unreadable by the receiving server. The \nless than\n symbol (<) and \nampersand\n (&) are two primary special characters to be concerned about. When including fields that may contain those characters you should use a special wrapper so the receiving understands that they are data content and not part of the XML structure:\n \n<![CDATA[ \nCONTENTS\n ]]>\nFor example, an \naddress\n or \ncompany name\n could contain ampersands, so should be included as:\nJaneSmith\n<address> </address>\n It is advisable to use CDATA for any field containing text since the contents are often unpredictable.\nNote about JSON Files\nJSON format should start with a \ndata\n node, as shown in the example below\n{\n\"data\":[{\n\"Name\":\"Acme Corporation\",\n\"Phone\":\"416-123-4567\",\n\"CompanyID\":\"496246\"\n},\n{\n\"Name\":\"Super Banana Ltd.\",\n\"Phone\":\"800-555-1234\",\n\"CompanyID\":\"496244\"\n},\n{\n\"Name\":\"Red Apple Supply\",\n\"Phone\":\"917-123-0000\",\n\"CompanyID\":\"496248\"\n},\n{\n\"Name\":\"Orange you Glad\",\n\"Phone\":\"410-222-2030\",\n\"CompanyID\":\"496242\"\n}\n]\n}\nReference: Standard Field Names and Variables\nThe below table can be used to compare Level 1 Standard Field terminology found in the \nUTA\n, on the Autoloader, in the Database, and Variable syntax]]\nUTA L1 Standard Field Name \nAutoloader Standard Field Name\nDatabase name\nVariable List\nn/a\nLevel 1 ID\nopportunityid\n@opportunityid@\nApplication Type\nType Name\nopportunitytypename\n@type@\n \nType ID\nopportunitytype\n@typeid@\nApplication Name\nName\nname\n@name@\nCustomer\nClient\ncompany\n@client@\n \nClient ID\ncompanyid\n@clientid@\n \nClient Custom Field\ncompanycfield\n \nStatus\nStatus\nstagename\n@status@\n \nStatus ID\nstageid\n@stausid@\nRevenue\nRevenue\nrevenue\n@revenue@\nCurrency\n \n \n \n \nCurrency (USD,CAD etc.)\ncurrencyid\n@currencyname@/ @currencycode@\n \nCurrency Exchange (USD,CAD etc.)\nexcur\n@excurrencycode@/ @excurrencyname@\n \nExchange Rate\nexcur_rate\n@exrate@\nClose Date\nClose Date (yyyy-mm-dd)\nclosedate\n@closedate@\nProbability\nn/a\n \n@probability@\nDescription\nDescription\ndescription\n@description@\nRequirement\nn/a\n \n@requirements@\nOwner\n \n \n \n \nOwner ID\nupdatedby\n@ownerid@\n \nOwner (firstname lastname)\nupdatedbyname\n@owner@\n \nOwner Email\nupdatedbyemail\n@owner.email@\n \nOwner Custom Field\nupdatedbyfield\n \nBranch\nBranch\nbranch\n@branch@\n \nBranch ID\nbranchid\n@branchid@\n \nBranch Custom Field\nbranchcfield\n \nWorkflow\nn/a\nn/a\nn/a\nContacts\nn/a (added Import Contacts on UTA)\nn/a\nn/a\nActivity List\nn/a (needs separate autoloader)\nn/a\nhttps://wiki.smartsimple.com/wiki/Web_Page_View_Field_Variables\nEnd Date\nEnd Date (yyyy-mm-dd)\noenddate\n@enddate@\nStart Date\nStart Date (yyyy-mm-dd)\nostartdate\n@startdate@\nModified Date\nn/a\n \n@modifieddate@\nInstitutions\nn/a (needs a workflow)\n \nhttps://wiki.smartsimple.com/wiki/Web_Page_View_Field_Variables\nEnd Time\nn/a\n \n@hour(fullenddate)@:@minute(fullenddate)@\nStart Time\nn/a\n \n@hour(fullstartdate)@:@minute(fullstartdate)@\nPerson\n \n \n \n \nPerson ID\noppeopleid\n@personid@\n \nPerson (firstname lastname)\noppeoplename\n@person@\n \nPerson Email\noppeopleemail\n@person.email@\n \nPerson Custom Field\noppeoplefield\n \nUTA Providers\nn/a (needs a workflow task)\n \nhttps://wiki.smartsimple.com/wiki/Web_Page_View_Field_Variables\nStatus Indicator\nn/a\n \nn/a\nTransactions\nn/a (needs separate autoloader)\n \nhttps://wiki.smartsimple.com/wiki/Web_Page_View_Field_Variables\nUTA Providers (L2)\nn/a\n \nhttps://wiki.smartsimple.com/wiki/Web_Page_View_Field_Variables\nModified By\nn/a\n \n@modifiedby@/ @modifiedbyid@\nCreated Date\nn/a\n \n@createddate@\nCreated By\nn/a\n \nn/a\nInvitations\nn/a\n \nn/a\nSee Also\n \nHow to Add Users and Contacts\n \nAutoloader File Preparation\n \nLinking Autoloaders\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Auto_Loader&oldid=43151\n’ \nCategories\n: \nTransactions\nData Import\nGlobal Settings",
  "links": [
    "https://wiki.smartsimple.com/wiki/Organization",
    "https://wiki.smartsimple.com/wiki/Contact",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview#Configuration_Folders",
    "https://wiki.smartsimple.com/wiki/Organization",
    "https://wiki.smartsimple.com/wiki/Contact",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Level_One_Entities",
    "https://wiki.smartsimple.com/wiki/Level_Two_Entities",
    "https://wiki.smartsimple.com/wiki/Level_Three_Entities",
    "https://wiki.smartsimple.com/wiki/Notes_Overview",
    "https://wiki.smartsimple.com/wiki/User#Global_Administrator",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview#Configuration_Folders",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview#Configuration_Folders",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview#Configuration_Folders",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview#Configuration_Folders",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview#Configuration_Folders",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview#Configuration_Folders",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview#Configuration_Folders",
    "https://wiki.smartsimple.com/wiki/Level_Two_Entities",
    "https://wiki.smartsimple.com/wiki/Level_Three_Entities",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Scheduler",
    "https://wiki.smartsimple.com/wiki/Integration_Key_Management",
    "https://wiki.smartsimple.com/wiki/Autoloader_File_Preparation",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview",
    "https://wiki.smartsimple.com/wiki/SmartFolders_Overview#Configuration_Folders",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/Linking_Autoloaders",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/How_to_Add_Users_and_Contacts",
    "https://wiki.smartsimple.com/wiki/Autoloader_File_Preparation",
    "https://wiki.smartsimple.com/wiki/Linking_Autoloaders"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/e/e4/Auto9.png",
    "https://wiki.smartsimple.com/images/5/53/2023-07-ticket-143944-1.png",
    "https://wiki.smartsimple.com/images/3/3a/2023-07-ticket-143944-2.png",
    "https://wiki.smartsimple.com/images/e/eb/Autoloader_DS1.png",
    "https://wiki.smartsimple.com/images/c/c5/AutoFTP2.PNG",
    "https://wiki.smartsimple.com/images/9/9f/AutoHTTP.png",
    "https://wiki.smartsimple.com/images/2/2f/AutoSOAP.png",
    "https://wiki.smartsimple.com/images/f/f9/External-OData1.PNG",
    "https://wiki.smartsimple.com/images/0/09/AutoFilePreparation.png",
    "https://wiki.smartsimple.com/images/a/a8/Auto6b.PNG",
    "https://wiki.smartsimple.com/images/a/a4/Auto3.PNG",
    "https://wiki.smartsimple.com/images/3/3a/Auto4.png",
    "https://wiki.smartsimple.com/images/e/e4/AutoFile.png",
    "https://wiki.smartsimple.com/images/8/85/Auto5.png",
    "https://wiki.smartsimple.com/images/c/c8/Auto5b.png",
    "https://wiki.smartsimple.com/images/7/7d/Connectiontypes.PNG",
    "https://wiki.smartsimple.com/images/1/18/Auto8.png",
    "https://wiki.smartsimple.com/images/1/12/Auto6.png",
    "https://wiki.smartsimple.com/images/2/2f/Auto7.png",
    "https://wiki.smartsimple.com/images/f/f0/Auto7b.png",
    "https://wiki.smartsimple.com/images/6/6a/Auto7c.png",
    "https://wiki.smartsimple.com/images/d/d1/AutoloaderNewRecordUTA.png",
    "https://wiki.smartsimple.com/images/c/ce/Auto10a.png",
    "https://wiki.smartsimple.com/images/c/c7/Auto10b.png",
    "https://wiki.smartsimple.com/images/1/14/Update_Account_Parent_Example.JPG",
    "https://wiki.smartsimple.com/images/4/4f/Update_Account_Parent_Example_-_Source_File.JPG",
    "https://wiki.smartsimple.com/images/9/93/Auto10c.png",
    "https://wiki.smartsimple.com/images/5/58/Auto10f.png",
    "https://wiki.smartsimple.com/images/5/58/Auto10f.png",
    "https://wiki.smartsimple.com/images/d/de/Auto10e.png",
    "https://wiki.smartsimple.com/images/d/d6/Auto10g.png",
    "https://wiki.smartsimple.com/images/3/30/AutoXML.png",
    "https://wiki.smartsimple.com/images/c/cc/AdhocAutoload.png",
    "https://wiki.smartsimple.com/images/9/91/Autoloader-History.PNG",
    "https://wiki.smartsimple.com/images/9/93/AdhocAutoload1.png",
    "https://wiki.smartsimple.com/images/4/4c/AdhocAutoload2.png",
    "https://wiki.smartsimple.com/images/1/18/AdhocAutoload3.png"
  ]
}