{
  "url": "https://wiki.smartsimple.com/wiki/Configuring_Privacy,_Confidentiality_and_Other_Policies#Policy_Details",
  "title": "Configuring Privacy, Confidentiality and Other Policies",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nFeature Illustrated\n3\n \nConfiguring the Privacy and Security Settings\n4\n \nPrivacy and Security Field Options\n4.1\n \nPolicies\n4.2\n \nPolicy Details\n5\n \nAdding the Privacy & Security link to Existing login pages\n6\n \nNotes\n7\n \nPrivacy logs\n8\n \nSee Also\nOverview\nPrivacy is a shared responsibility\n. This feature allows organizations to better highlight their privacy and other stated policies, provides tools to manage country and language combinations, and places persistent links to policies on login pages and user portals.\nIf you are in need of a list of features that will help make your SmartSimple instance GDPR-compliant, please see the \nGeneral Data Protection Regulation (GDPR)\n article. \nTo see SmartSimple's own privacy policy, please visit \nour website.\nNote:\n Note: In the July 2024 upgrade, a new enhanced version of this feature will be released with a new interface and behaviors. Existing policies will not be migrated to the new feature and will have to be reconstructed manually. If you wish to opt into the new feature, you can read more on \nthe updated wiki page for privacy and security policies\n.\nFeature Illustrated\nPrivacy and Security link displayed on a users portal (above).\nPrivacy and Security link displayed on user login page (above).\nCountry and language policy configuration page is displayed above. Found under Configuration > Global Settings > Security tab.\nConfiguring the Privacy and Security Settings\nYou must create a policy for the \nDefault Country\n and \nEnglish\n language first. The default will be displayed to all users prior to login.\n From the Configuration menu, click on \nGlobal Settings\n.\n Click on the \nSecurity\n tab.\n Click on the \nPrivacy and Security Policies\n link within the Security Settings.\n The list of configured \nPrivacy and Security\n policies is displayed.\n Click \nNew Policy\n icon to configure a new policy, or click on the \"Edit Policy\" icon to modify an existing policy.\n Complete the privacy settings field options.\n Click \nSave\n to save the policy.\nPrivacy and Security Field Options\nThe following are field options for configuring Privacy and Security policies:\nPolicies\nThis section allows you to create specific country and language policy combinations.\n \nCountry\n - Select the country this specific policy will pertain to from the drop down list. Choose the \nDefault Country\n option when creating a general (non-country specific) policy. The \nDefault Country\n is displayed pre login. Post login, the privacy policy displayed is determined by the users settings.\n \nLanguage\n - Select the language that will be associated with the country selected from the above option.\nPolicy Details\nThis section allows for the labeling of policies and the adding of policy details via rich text or external link. Each policy can be labeled individually using the label field to the right of the policy name.\n \nEnforce User Acceptance\n - determine if/when policies require acceptance by end-users. Used in conjunction with the \nUser Acceptance Required\n option to enforce acceptance specific to individual policies.\n \nInterval\n - Drop-down with fee interval options. If one of the options is selected it will make users re-accept the policies at the set interval.\n \nIntroduction\n - This defines the first policy page displayed and can be used to introduce the policies that have been defined. Only the rich text option is available for defining the introduction (no URL option).\n \nPrivacy Policy\n - This option allows the privacy policy to be defined.\n \nCommunications Policy\n - This option allows the communication policy to be defined.\n \nData Access\n - This option allows the data policy to be defined.\n \nAccountability\n - This option allows the accountability policy to be defined.\n \nData Confidentiality\n - This option allows the data confidentiality policy to be defined.\n \nPerformance Integrity\n - This option allows the performance integrity policy to be defined.\n \nInternational Data Privacy\n - This option allows the international data privacy policy to be defined.\nThe policies (with the exception of Introduction) have 3 options None, Rich Text, and URL. . .\n The \nNone\n option means that this policy is not defined for this country/language policy combination\n The \nRich Text\n option allows the creation of the specific policy using the rich text editor\n The \nURL\n allows the specifying of a URL link resource to be referenced from an external site.\nThey also have a \nUser Acceptance Required\n option to indicate that the user is required to provide acceptance specific to individual policies after the date specified in the \nEnforce User Acceptance\n setting.\nIf the \nUser Acceptance Required\n option is switched on then an additional \nRole Lookup\n option is displayed. If Roles are selected here then the policy will only affect users with these roles.\nAdding the Privacy & Security link to Existing login pages\nFor login pages created prior to the introduction of this feature (April 2016) the Privacy & Security link will not show by default. This can be added manually by updating the Standard Template located on the \nLogin Screen Content\n page. \nNote:\n Updating the Standard Template will remove any previous formatting. It is recommended that you start with the Standard Template and then customize the page to your satisfaction. In the case where you decide that you do not want to use the Standard Template the code below includes the link to insert it manually:\n[s_viewpolicies.jsp?companyid=@companyid@&policylang=@lang@&isexternal=1 Privacy & Security]\nNotes\n Each field includes a \nlast modified by\n and \nmodified date stamp\n Policy formats include both rich text format and URL link to a webpage containing the policy\n Additional policies can be added by clicking the \n+ plus icon\n at the bottom of the Policy Details section.\nPrivacy logs\nWhen a user confirms and completes the Privacy policy then a PDF version is stored against the corresponding policy under the View Log tab.\nThe PDF is named using the structure \n[userid]-[firstname]_[lastname]_policy-[policyid]-[countryid]-[langid]_V_[version].pdf\nSee Also\n \nGeneral Data Protection Regulation (GDPR)\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Configuring_Privacy,_Confidentiality_and_Other_Policies&oldid=42613\n’ \nCategories\n: \nHow\nGlobal Settings\nSecurity",
  "links": [
    "https://wiki.smartsimple.com/wiki/General_Data_Protection_Regulation_(GDPR)",
    "https://wiki.smartsimple.com/wiki/Privacy_and_Security_Policies",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Login_Screen_Content",
    "https://wiki.smartsimple.com/wiki/General_Data_Protection_Regulation_(GDPR)"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/a/a6/Privacy_top.png",
    "https://wiki.smartsimple.com/images/0/05/Privacy.png",
    "https://wiki.smartsimple.com/images/6/63/Privacy_configuration_page.png",
    "https://wiki.smartsimple.com/images/d/d9/PrivacyViewLog.png"
  ]
}