{
  "url": "https://wiki.smartsimple.com/wiki/Configuring_a_SmartSimple_Instance",
  "title": "Configuring a SmartSimple Instance",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguration - Essentials\n2.1\n \nConfiguration Checklist\n2.2\n \nMenu and Global Settings\n2.3\n \nBranding\n2.3.1\n \nAccessing Branding & Visual Settings\n2.3.1.1\n \nColors & Styles\n2.3.1.2\n \nLogin Pages\n2.3.1.3\n \nLogo, Header, Web Alias and Email Domain\n2.3.1.4\n \nTerminology\n2.4\n \nUsing the Colour Picker\n2.5\n \nLogin Screen Content\n2.6\n \nStorage Summary\n2.7\n \nSecurity Settings\n2.8\n \nPassword Policy\n2.9\n \nIntruder Log\n2.10\n \nUser Email Templates\n2.11\n \nEnable SSL (Secure Socket Layer)\n2.12\n \nSetting the Web Alias\n2.13\n \nSetting an E-mail Domain\n2.14\n \nSession Timeout\n2.15\n \nCompany & Account Settings\n2.16\n \nUser & Contact Settings\n2.17\n \nDefault User Settings\n2.18\n \nAssociation Settings\n2.19\n \nPeople Online Settings\n2.20\n \nSmartFolder Settings\n2.21\n \nOrganisational Terminology\n2.22\n \nData Loading & Backup Settings\n2.23\n \nSee Also\nOverview\nSmartSimple\n is a cloud-based platform that prides itself on its total flexibility; we have highly configurable options for almost every part of our system, so that you can easily tailor your \ninstance\n to your company's direct needs as well as your personal preferences. This page will bring you through the general chronological steps for configuring a SmartSimple instance. By the end of it, you will have built the foundations for a system that is designed for your unique business aims. \nConfiguration - Essentials\nConfiguration Checklist\nPrior to beginning your configuration, read over this sequence that you should consider when setting up your copy of SmartSimple (before anyone is given access into the system). These highlight the general topics/areas that are configurable and that will help you make your system an ideal tech solution for your company.\nConfiguration Organization Settings\nSet a \ncolour scheme\n, \nlicensing\n, \nbackup instance\n and customized \nterminology\n.\nCustom Fields\nIf required, define the \nCustom Fields\n required for your organizations. These are fields that you might need to accurately reflect your business, but go beyond the standard \nName, Phone Number, Address \netc. \nInternal\n and \nExternal\n Organization Information\nCreate or import organization information for the organizations in your system's \norganization hierarchy\n. \nRoles\nDefine the roles that people play in your business.\n'\nExample: \nIf you are a research-based company serving university grants, you might want to make roles labelled \nPeer-Reviewer, '\nProfessor, Departmental Lead \netc.\nUser\n Imports\nDefine or upload \"people\" (users/contacts) into their respective substrata of your \norganization hierarchy\n.\nSystem Administrator\n/Manager Permissions \nGive high-level permissions to specific roles and choose your \nGlobal User Administrators\n. Determine which groups of people will be responsible for each application and feature in your SmartSimple copy. \nTip: Keep this page open while opening hyperlinks from this page. Although other articles will give more specific instructions for configuring certain features, this page will be helpful by providing a broad sequence of areas required for successful configuration. \nMenu and Global Settings\nIf you are a \nSystem Administrator\n, you will have access to \nGlobal Settings. \nUsers with SysAdmin permissions will be able to access all functions within the system and to customize roles, security, feature visibilities, etc. Be cautious with who you assign in a SysAdmin role, as their access into the system has the potential to make wide and immediate impact. \n No matter what, best practice is to test configuration and changes to your system in the Backup Instance prior to modifying the live instance. \n The \nBackup Server and Testing Instance\n will not retain any changes into the live \ninstance\n; the backup is overwritten nightly with that day's production copy. \nIn order to properly configure your system, you must know where your \nmenu icon \nis as well as \nGlobal Settings.\nYour menu icon is located on the top right of your page, and looks like a 9-square icon. \n \n \nThe \nGlobal Settings \narea of the system is available under the heading \nConfiguration. \nSee \nGlobal Settings\n for a full list of the available features in a set of sections. \n \nNote\n: We aim to end support for the \nClassic \nInterface after our upcoming November 2019 Upgrade. For this reason, we encourage all clients to switch to the \nArcadia \nInterface now, and to use the \nArcadia\n Interface configuration options.\nBranding\n See \nBranding\n for more detailed information. \nAs part of the implementation process, SmartSimple or its partners will configure the look and feel of your system for you. Anyone with SysAdmin privileges will then be able to change the branding and visual settings of the system at any time. \nAccessing Branding & Visual Settings\n1. Click on the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nConfiguration, \nselect \nGlobal Settings. \n3. Click onto the second tab, labelled \nBranding.\n \nColors & Styles\nYou have the freedom to adjust the colours and style choices of fonts in your system. All colour settings will affect all users: What a \nGlobal User Administrator\n sees will be the same colours that an applicant sees.\nSee \nColors & Styles\n for more. \nLogin Pages\nLogo, Header, Web Alias and Email Domain\nTerminology\nUsing the Colour Picker\nColours are selected by clicking the colour palette icon to the right of the colour box.\n1. Click the square icon of a colour next to any branding setting that allows colour change. \nThe colour pallet is displayed.\n \nIf you need to match colours exactly with your organisation web site, you can view the HTML source of your organisation web page and find the hex codes for “colour”.\nYou can then type these colour codes into the text boxes.\nAlternatively, you can use a program such as Photoshop to “sample” an image and determine the correct colour.\nLogin Screen Content\nYou can further “brand” the login page by creating your own login page.\n1. Click the \nLogin Screen Content\n link.\nThe Login screen content is displayed.\n2. Modify the content as required.\n3. Click the \nSave\n button.\nYou are returned to the \nGlobal Settings\n page.\nSmartSimple\n recommends that \nusers\n should log in through their web site.\nIn order to add the \nusername\n and \npassword\n boxes to your web site, download the instructions from the \nSmartSimple\n Wiki – \nwww.smartsimple.org\nTitle Type\nThe Title Type defines whether text or a login should be displayed in the top left corner of the main window.\nWhen the organisation first registers, the title text displayed on the top left of the \nSmartSimple\n page is set to the organisation name.\nTitle Image\nThis setting is used to upload and display a logo, or other image files that you may wish to display on the login page, and in the top left corner of the \nSmartSimple\n main window.\nFor the best presentation, this image should be pre-sized to \n133 by 46 pixels\n.\nIf you need to resize the image you can use a program such as \nAdobe Photoshop\n that allows you to set an exact height and width in pixels.\nTitle Text\nYou can define alternative text to be displayed on the login page, and in the top left corner of the SmartSimple main window as an alternate to the image.\nStorage Summary\n \nThis section displays the current number of Branches (\ninternal\n), Accounts (\nexternal\n), Users (\ninternal\n) and Contact (\nexternal\n) in this \ninstance\n of \nSmartSimple\n.\nA list of deleted companies/accounts, users/contacts is also displayed. You can review the deleted companies or contacts by clicking on the word “deleted”.\nYou can then review the list and either restore one or more contact, or purge (permanently delete) from the system.\nThe total storage used by the instance is calculated by clicking the Re-calculate Storage button.\nSecurity Settings\nThese setting are used to control system security.\n \n \nPassword Policy\nPassword Policy\n is used to control the length and complexity of passwords, the number of retries that the \nuser\n is allowed, and the lockout time for the account if they exceed the number of retries.\n1. Click the \nPassword And Activation Policies\n link.\nThe \nPassword Policy\n window is displayed.\n \nThe following password settings are available:\nPassword length\n – the minimum length allowed for a \npassword\n, between 6 and 32 characters.\nComplexity\n – the level of complexity required in the \npassword\n, the options are:\n \nNo Restriction\n – any character can be used. This is the default.\n \nAlpha Only\n – only letters can be used.\n \nAlpha & Numeric\n – letters and numbers must be used in the password.\n \nAlpha & Numeric & Special characters\n – letters, numbers and special characters must be used. The following special characters are allowed:\n~ ! @ # $ % ^ & * ( ) { } [ ] ; : ' \" < > ?\nIf you enable special characters, the special character list will be displayed to the user when they change their password.\n \nIntruder Lockout Settings\n – these settings determine the actions that should be taken if someone attempts to log into your copy of \nSmartSimple\n.\n Number of Attempts\n – the number of attempts to log in with an account before the account is locked.\n Lockout Duration\n – the duration of the account lockout. The \nuser\n will not be able to log in during this period. Period can be set to 5 minutes, 15 minutes, 30 minutes, 1 hour, 3 hours, 12 hours, 24 hours or forever (until unlocked by \nadministrator\n).\nIntruder Email Alert\n – these settings define who should be informed by email if an intruder alert is detected.\n \nEmail From\n – the “from” address for the email. If you do not set this value, the address: \nsupport@smartsimple.com\n will be used.\n \nEmail To\n – select the \ninternal\n person to receive the email.\n \nSubject\n – the subject of the email. See below for the variables that you can use in the subject.\n \nBody\n – the body of the alert email. See below for the variables that you can use in the body.\nIntruder Alert Email Variables\n – because the \nuser\n in not logged into the system the amount of information available is limited to IP Address \n@ip@\n, the attempted username \n@username@\n and time \n@time@\n.\nIntruder Log\nThe \nView Log\n tab is used to access the \nIntruder Alert\n log.\n2. Click the \nView Log\n tab.\n The list can be sorted by clicking the column title.\n You can filter the list by \nusername\n, year, and month.\nView Locked Users\nThe \nView Locked Users\n link will display all currently locked \nusers\n.\nIf a user is locked, then you need to go to the \nuser\n records and reactivate by sending a new \npassword\n.\nUser Email Templates\nThis \norganisation settings\n page is also used to manage content for the \ndefault new user\n and \nrequest password\n emails.\n \n The \nNew User\n email message is sent to a \nuser\n when you enable their access to SmartSimple for the first time.\n The \nRequest Password\n email message is sent to a \nuser\n when they request a new \npassword\n from the login page, or when you reset a \nuser’s\n password in the user details page.\nYou can alter the text as required.\nEnable SSL (Secure Socket Layer)\nSecure Socket Layer (\nSSL\n) is an industry standard encryption technique that encrypts all the information transmitted between the user’s \nbrowser\n and the \nSmartSimple\n server.\nAnyone intercepting this information over the Internet would be unable to decrypt the information.\n1. Click the \nEnable SSL\n check box.\nIf your organisation is using a dedicated \nSmartSimple\n Server, you will need to purchase an SSL certification for this feature to function.\nIf you are using a SmartSimple server, then you can enable this feature at any time.\nSetting the Web Alias\nThe web \nalias\n defines the prefix to your copy of \nSmartSimple\n.\n2. Set the \nWeb Alias\n as required.\nThe Web Alias should be set before other \nusers\n begin to use the system.\nIf a user sets their home page to a page referenced by the numeric alias and the alias is changed, the user will get an invalid session error when the system attempts to display that page during the login process.\nFor security reasons, \nSmartSimple\n will never display if an \nalias\n is not valid when you try to log in.\nSetting an E-mail Domain\nSetting the organisation e-mail domain lets \nusers\n from your organisation domain log in without keying their entire e-mail address.\n3. Set the \nEmail Domain\n as required.\nUsers of the system that are not in your email domain must use their full email address to log into \nSmartSimple\n.\nSession Timeout\nThe session timeout feature will automatically log out any \nuser\n if their session remains inactive for the defined number of minutes.\n4. Set the \nSession Timeout\n as required.\nWe recommend that you always set this option. Generally, 30 or 60 minutes are acceptable timeout periods.\nBusiness Configuration Settings\nThe Business Configuration settings provide access to key features to personalize this \ninstance\n of \nSmartSimple\n for specific business needs.\nObjectSync Settings\nThis feature supports sharing information between \ninstances\n of \nSmartSimple\n.\nCompany & Account Settings\n \n \nBranch Custom Fields\n – \ncustom fields\n associated with \ninternal\n companies.\n \nAccount Custom Fields\n – \ncustom fields\n associated with \nexternal\n companies.\n \nUser and Contact Signup Pages\n – used to manage \nexternal\n web pages where people can register as contacts.\n \nBranch and Account Signup Pages\n – used to manage \nexternal\n web pages where companies can register.\n \nCompany Parent\n - enables the display of a parent organisation in the list views throughout the system. This feature is useful if the organisations you deal with are subsidiaries, and you need to be aware of the parent organisations.\n \nResources\n – displays the company resource tab, only required when using job costing.\n \nNAIC Codes\n - the \nNorth American Industry Classification System\n (NAICS, pronounced Nakes) was developed as the standard for use by US, Canadian, and Mexican agencies in classifying business establishments. Enable this setting if you wish to track organisations by NAIC codes. You can set two codes for each organisation, a primary and secondary code.\n \nDisplay UTA Items\n – displays tracking items from the \nUniversal Tracking Application\n associated as a set of tabs on the company record.\nUser & Contact Settings\n \n \nUser Custom Fields\n – \ncustom fields\n associated with \ninternal\n \nusers\n.\n \nContact Custom Fields\n – \ncustom fields\n associated with \nexternal\n contacts.\n \nDefault User Settings\n – the default system settings that will be set for each new \nuser\n or contact.\n \nDisable Pre-load People List\n – this option is used to improve performance when you have in excess of 50,000 contacts in your copy of \nSmartSimple\n. Enabling this option will disable the display of contacts in all \nSearch People\n pages.\n \nEnforce Homepage\n - you can force all \nusers\n to the same web page when they first log into the system. This feature is useful if you have customers using the system and want to present them with some specific information such as your own organisation web site.\n \nHomepage\n – specifies a web page to be used as the homepage.\n \nLanguage\n – the default language for all new \nusers\n.\nChecking this box does not override the home page setting for each \nuser\n, but simply defines the first page they will see when logging in.\nDefault User Settings\nThe default user setting options provide you with a way of controlling the setting each \nuser\n will have when they first log into the system. We recommend that you set these values before setting up any additional users.\n1. Click the \nDefault User Settings\n link.\nThe Default User Setting window is displayed.\nYou can set the following values:\nDefault User – Display Options\n \nLeft Navigation Style\n – choose \nStatic\n for \nmenus\n that don’t expand or dynamic for \nmenus\n that open and close.\n \nUTA Tabs\n – used to control the presentation of tabbed fields when the \nUniversal Tracking Application\n is used.\n \nFont Size\n – choose a larger font size for your view of the system.\n \nNumber of Records Per page\n – defines the number of records per page you wish to see when information is displayed as a list. You can choose 20, 40, 60, 80 or 100.\n \nText Editor\n – enables and disables the Rich Text/HTML Editor.\n \nPublish Pin Board\n – make your personal Pin board visible to other people.\n \nList View Thumbnail Size\n – determines the size of images in reports.\nDefault User – Regional Settings\nThese options determine your regional settings.\n \nInput Date Format\n – the individual \nuser’s\n preferred entry format for date time values.\n \nInput Short Date Time Format\n – the individual \nuser’s\n preferred short display format for date time values.\n \nInput Long Date Time Format\n – the individual \nuser’s\n preferred link format for date time values.\n \nTime Difference\n – used to set your local time.\n \nHome Currency\n – the default currency for this \nuser\n. This currency will be referenced in applications such as \nSales Tracking\n and Expense Tracking. This currency will be assumed to be the default currency for this user.\n \nLanguage\n – the language that you wish to use. Currently you can select from seven languages.\n \nInternet Map Service\n – determines the Internet service you wish to use when displaying maps.\n1. Click the \nGlobal Settings\n tab to return to the \nGlobal Settings\n page.\nAssociation Settings\nThese settings provide the ability to link the same person to any number of organisations.\nAssociates\n/\nAssociations\n – enabling this feature will allow you to associate a single contact with multiple companies. The \nAssociates\n tab will be displayed in each company record – to show associated people. The \nAssociations\n tab will be displayed on each contact record to display the companies that they are associated with.\nPeople Online Settings\nThese settings control the fields displayed when you mouse over \nusers\n listed in the people online.\nSmartFolder Settings\nThese settings are only displayed when you enable the \nSmart Folder\n application.\n \nOn-Line Editing\n – provides \nusers\n with the ability to open, edit, and save edited files to \nSmartSimple\n. This feature is used in conjunction with a desktop plug-in that must be downloaded and installed in any workstation where you wish to use this feature.\n Size Subscribed – defines the amount of disk storage required for \nSmartFolders\n – up to 5 GB.\nOrganisational Terminology\nYou can define specific terminology for some basic \nSmartSimple\n objects.\nThese terms relate to both \ninternal\n and \nexternal\n “organisations” – singular and plural and internal and external “users” – singular and plural.\nFor example, your \ninternal\n organisation unit may be a “branch” or a “business unit”, and your \ninternal\n people may be “employees”.\nPhone Number Format\nThese settings define the accepted formats for phone numbers of varying length.\nData Loading & Backup Settings\n \nAutoloader\n – used to define scheduled upload of data from \nSmartFolders\n into company, contact, and \napplications\n.\n \nDisable Login Access...\n – checkbox disables access to the \nbackup server\n for all non-\nGlobal User Administrator\n accounts.\nSee Also\n \nConfiguration mode\n \nCustom fields\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Configuring_a_SmartSimple_Instance&oldid=40191\n’ \nCategories\n: \nSystem Management\nGlobal Settings",
  "links": [
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Branding",
    "https://wiki.smartsimple.com/wiki/Backup_Server_and_Testing_Instance",
    "https://wiki.smartsimple.com/wiki/Organization_Terminology",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Organization_hierarchy",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Organization_hierarchy",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/User#Global_Administrator",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Backup_Server_and_Testing_Instance",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Branding_%26_Visual_Settings",
    "https://wiki.smartsimple.com/wiki/Branding",
    "https://wiki.smartsimple.com/wiki/User#Global_Administrator",
    "https://wiki.smartsimple.com/wiki/Branding#Colors_.26_Styles",
    "https://wiki.smartsimple.com/wiki/Using_the_Colour_Picker",
    "https://wiki.smartsimple.com/wiki/Login_Screen_Content",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Username",
    "https://wiki.smartsimple.com/wiki/Password",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Database_and_File_Storage_Status",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Security_Settings",
    "https://wiki.smartsimple.com/wiki/Password_Policy",
    "https://wiki.smartsimple.com/wiki/Password_Policy",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Password",
    "https://wiki.smartsimple.com/wiki/Password",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Administrator",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Login_%26_Security_Settings",
    "https://wiki.smartsimple.com/wiki/Username",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Password",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Password",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/SSL",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Login_%26_Security_Settings#Web_Alias",
    "https://wiki.smartsimple.com/wiki/Alias",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Alias",
    "https://wiki.smartsimple.com/wiki/Setting_an_E-mail_Domain",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Session_Timeout",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Company_%26_Account_Settings",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/User_%26_Contact_Settings",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Default_User_Settings",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/Menu",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Sales_Tracking",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Association_Settings",
    "https://wiki.smartsimple.com/wiki/Associates",
    "https://wiki.smartsimple.com/wiki/Associations",
    "https://wiki.smartsimple.com/wiki/Associates",
    "https://wiki.smartsimple.com/wiki/Associations",
    "https://wiki.smartsimple.com/wiki/People_Online_Settings",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Smart_Folder",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Smart_Folder",
    "https://wiki.smartsimple.com/wiki/Organisational_Terminology",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/Data_Loading_%26_Backup_Settings",
    "https://wiki.smartsimple.com/wiki/Autoloader",
    "https://wiki.smartsimple.com/wiki/Smart_Folder",
    "https://wiki.smartsimple.com/wiki/Application",
    "https://wiki.smartsimple.com/wiki/Backup_Server_and_Testing_Instances",
    "https://wiki.smartsimple.com/wiki/User#Global_Administrator",
    "https://wiki.smartsimple.com/wiki/Configuration_mode",
    "https://wiki.smartsimple.com/wiki/Custom_fields"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/f/f0/Menu_and_global_settings.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/e/ee/Branding.png",
    "https://wiki.smartsimple.com/images/1/19/Html_font_colour.png",
    "https://wiki.smartsimple.com/images/e/ef/Glob7.png",
    "https://wiki.smartsimple.com/images/b/b9/Glob8.png",
    "https://wiki.smartsimple.com/images/8/84/Storage_summary1.png",
    "https://wiki.smartsimple.com/images/e/e5/Security_settings1.png",
    "https://wiki.smartsimple.com/images/e/ef/Security_settings2.png",
    "https://wiki.smartsimple.com/images/0/09/Password_and_activation_policies.png",
    "https://wiki.smartsimple.com/images/3/3e/Glob12.png",
    "https://wiki.smartsimple.com/images/b/b1/Intruder_alert_settings.png",
    "https://wiki.smartsimple.com/images/d/d5/Glob13.png",
    "https://wiki.smartsimple.com/images/e/e5/Password_email_template.png",
    "https://wiki.smartsimple.com/images/e/ec/Glob15.png",
    "https://wiki.smartsimple.com/images/c/cf/Glob16.png",
    "https://wiki.smartsimple.com/images/1/15/Glob17.png",
    "https://wiki.smartsimple.com/images/c/cd/Glob18.png",
    "https://wiki.smartsimple.com/images/0/0b/Glob19.png",
    "https://wiki.smartsimple.com/images/5/50/Glob20.png",
    "https://wiki.smartsimple.com/images/8/8f/Organization_settings.png",
    "https://wiki.smartsimple.com/images/9/91/Glob22.png",
    "https://wiki.smartsimple.com/images/1/10/User_settings.png",
    "https://wiki.smartsimple.com/images/1/1f/Glob24.png",
    "https://wiki.smartsimple.com/images/6/6a/Glob25.png",
    "https://wiki.smartsimple.com/images/6/60/Glob26.png",
    "https://wiki.smartsimple.com/images/0/05/Glob27.png",
    "https://wiki.smartsimple.com/images/9/9b/Glob28.png",
    "https://wiki.smartsimple.com/images/7/74/Glob29.png",
    "https://wiki.smartsimple.com/images/4/44/Dataloadingandbackup2.jpg"
  ]
}