{
  "url": "https://wiki.smartsimple.com/wiki/Configuring_Ajax_List_Views",
  "title": "Configuring Ajax List Views",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nThe Columns Tab\n1.1\n \nDefinition of Options Available on the Columns Tab\n2\n \nSort Order\n3\n \nSee Also\nAjax \nlist views\n can be configured to choose the fields shown when contact or organization records are searched for using \nAjax\n lookups. \nUnlike other \nlist views\n in the system, records shown on Ajax list views cannot be edited or opened. Ajax list views present information on records for selection of contacts or organizations.\nThe list views are configured from the \nGlobal Settings\n page under the following tabs:\nNote that the columns selected in the Ajax list view will be the fields searched upon when values are typed into an Ajax lookup field.\nFor example, when a contact lookup list view is configured with the Name, Organization, Title and Address columns, and \"art\" is typed into a contact lookup field, records will be returned where the string \"art\" is found in any of those fields:\nThe Columns Tab\n The Columns tab is where the \nstandard\n and \ncustom fields\n that you want to be displayed in your list view are defined.\n When you first click on this tab, you will see the default four blank columns.\n When you click into a cell, you will see the configuration options below. Note that the \nAvailable Field List\n will display at the right. \nStandard\n fields are shown first, followed by the \ncustom\n fields available.\n You can quickly click through the cells and use the Available Field List to choose the fields you wish to display.\n When you select a field from the Available Field List, the \nContent Template\n will be populated with a SmartSimple \nvariable\n that references that field.\n Note that multiple fields can be selected for each column in the list view. In the example below, both the First Name and Last Name standard fields have been added to column number 2 and the Header Caption has been changed to \"Name.\"\n First, click into an Active Cell and click on the fields you want to display in the column in the Available Field List.\n You can also add extra characters, such as parentheses and explanatory text.\n HTML tags can also be employed, surrounding the variable(s) in the Content Template, to add formatting to the column values.\n An example would be entering \n@First Name@ <b>(@Last Name@)</b>\n into the Content Template, which would result in Name values in the list view displaying in the format: FirstName \nLastName\nNote: Since the configuration of list views is performed by system administrators, any field can be selected to display in the list view. This means that if a field is selected for a given role's list view that has field permissions that deny visibility to that given role, that field will be visible to that role on that list view. The edit permissions set on the field permissions setting of custom fields will still hold sway, however.\nDefinition of Options Available on the Columns Tab\n \nNumber of Columns\n - This is the total number of columns visible in your list view. You can add or subtract the number of columns shown by editing this value and clicking out of the field.\nFor an optimal user experience, it is recommended to not exceed 4 columns, however you can exceed this limit.\n \nHeader Caption\n - You can choose the name of the columns in your list view using the Header Caption option.\n \nContent Template\n - This will display the \nvariable\n or variables you have selected using the Available Field List.\n \nAlign\n - This will determine the alignment of the values in your list view column. The options available are \"Left,\" \"Right,\" and \"Center.\"\n \nShift Column Position\n - This will move the currently selected column to the left or right, relative to the other columns.\nSort Order\nNow that the list view has been created and the fields that should be presented have been defined, you will define the Sort Order for your list view. Please see \nSetting the Sort Order on a List View\n for instructions.\nSee Also\n \nAjax Lookup\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Configuring_Ajax_List_Views&oldid=31654\n’ \nCategories\n: \nList Views\nGlobal Settings",
  "links": [
    "https://wiki.smartsimple.com/wiki/List_view",
    "https://wiki.smartsimple.com/wiki/Ajax",
    "https://wiki.smartsimple.com/wiki/List_view",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Standard_fields",
    "https://wiki.smartsimple.com/wiki/Custom_fields",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Variable",
    "https://wiki.smartsimple.com/wiki/Variables",
    "https://wiki.smartsimple.com/wiki/Setting_the_Sort_Order_on_a_List_View",
    "https://wiki.smartsimple.com/wiki/Ajax"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/e/ef/ConsolidatedAjaxListViewsonGlobalSettingsPage.png",
    "https://wiki.smartsimple.com/images/9/9c/AjaxLookup.png",
    "https://wiki.smartsimple.com/images/c/cd/AjaxListViewBuilderInitialView.png",
    "https://wiki.smartsimple.com/images/6/6f/AjaxListViewBuilder.png"
  ]
}