{
  "url": "https://wiki.smartsimple.com/wiki/Email",
  "title": "Email",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nUsage\n2.1\n \nSending Email in Bulk\n2.1.1\n \nEmail Broadcast\n2.1.2\n \nGroup Email\n2.2\n \nAutomation of Email\n2.2.1\n \nWorkflow Acknowledgement Tasks\n2.2.2\n \nReminder and Follow-Up Email\n2.3\n \nSending Ad Hoc Email\n2.3.1\n \nMessage Center\n3\n \nConfiguration - Essentials\n3.1\n \nEmail Domain\n3.1.1\n \nSending From a SmartSimple Domain\n3.1.2\n \nSending From Your Own Domain via SMTP Relay\n3.1.2.1\n \nTo Configure SMTP Relay in SmartSimple\n3.1.2.2\n \nTo Configure SMTP Relay in Your Mail Exchange Server\n3.1.3\n \nSending From Your Own Domain without SMTP Relay\n3.1.4\n \nWhere to Set the Email Domain\n3.2\n \nEmail Templates\n3.2.1\n \nCreating a New Message Template\n3.3\n \nSaving Email to the Platform\n3.3.1\n \nConfiguring Activity Types to Represent Email\n3.3.2\n \nEmail Anything Feature\n4\n \nConfiguration - Advanced\n4.1\n \nEmail Security\n5\n \nFrequently Asked Questions\n6\n \nSee Also\nOverview\nThe SmartSimple platform provides several features that support communication via email. These features range from the ability to send email in bulk to target audiences, automated email that send based on your workflow, as well as individually crafted ad hoc email. Configuration options are also available for you to personalize your email content, and the delivery of email, such as varying the from address that email is sent with. It should be noted however, that while the platform makes a best effort to send email as configured, there are limits and best practices that need to be observed in order to maximize the successful delivery of email. These limits and best practices are ever changing, as is the industry standards that they are designed to follow.\nUsage\nSending Email in Bulk\nEmail Broadcast\nThe Email Broadcast feature enables you to send email in bulk to your users. You can define the recipient list of a broadcast through the same search criteria available to you in the People list view. That is, you can select users according to attributes such as their user roles, or specific field values, or even the company categories, or specific field values of the parent company that a user resides within.\nLearn more about the \n Email Broadcast feature\n. \nGroup Email\nThe Group Email feature enables you to send email from a List View of records, targeted towards the users associated to these records. Currently, this feature is available from any UTA List View, or Organization List View. This lets you target a message to users that are associated by a specific role to a set of records that you can search based on any criteria available in the List View, such as type, status, or field value. The contents of the email also has context to the record, so you can include information from the record within your message. An example of this could be the sending of a reminder email to the owners of UTA records that are currently in a draft status, to remind them to submit their records.\nLearn more about the \n Group Email feature\n.\nGroup Email supports the use of pre-made \nEmail Templates\n.\nAutomation of Email\nWorkflow Acknowledgement Tasks\nWithin the Workflow automation module, is the ability to configure Acknowledgement type tasks. This grants the ability to trigger automated email notifications based upon the same conditions that a Workflow may trigger. This allows you great flexibility in sending email notifications based on a wide variety of criteria, targeted to any number of users associated to the record that the Workflow was triggered on, and with context to and ability to include information from the record too.\nLearn more about \nWorkflow Email\n.\nWorkflow Acknowledgement tasks support the use of pre-made \nEmail Templates\n.\nReminder and Follow-Up Email\nActivity records can be setup with a standard reminder email that is sent before a specified date time, or a standard follow-up email after a specified date time. These reminder and follow-up email settings are presented as standard fields that can be enabled on UTA Level 2, or Level 3 type records. After these fields have been enabled, users can then select whether they wish these email to be sent on a per-record basis by manually adjusting when they wish the email to be sent, relative to the value of the end date and time standard field of that record.\nSending Ad Hoc Email\nMessage Center\nUsers can send individual ad hoc email to other users simply by clicking on their email address when viewing their user profile. This will launch the Message Center feature, that will allow you compose an email, and send to the target address through the platform.\nThe Message Center supports the use of pre-made \nEmail Templates\n.\nConfiguration - Essentials\nEmail Domain\nEmail by default is sent out from the platform using a SmartSimple-managed domain. While the platform offers the option to configure email to be sent with a from address of your corporate domain, care must be taken to avoid having these email be regarded as spam. For the best results for email delivery, only the following configuration options are recommended.\nSending From a SmartSimple Domain\nConfigure email with a from address of a SmartSimple-managed domain. This will be the most reliable method of sending email. Email configured in this manner will be relayed via SmartSimple-managed mail exchange servers*. It should be noted that these domains are not monitored, and are not configured to receive mail. You may use an alias of your choice in the form of \nalias\n@\nsmartsimpledomain\n, e.g. acme-recruitment@smartsimplemailer.com, but we suggest a general alias such as donotreply, e.g. donotreply@smartsimplemailer.com.\n* \nNote: if you are subscribed to SmartSimple's Private Cloud offering, and self-host your own infrastructure, your environment may not be configured to relay email through SmartSimple-managed mail exchange servers, and this configuration option may not be applicable to you.\nThe following table lists the SmartSimple-managed domains available for your use, as well as the geographic location that the email will be routed from.\n Domain\n Geographic Region\n @smartsimplemailer.ca\n Canada\n @smartsimplemailer.eu\n European Union\n @smartsimplemailer.com\n United States\nSending From Your Own Domain via SMTP Relay\nYou may configure email with a from address of your own corporate domain, but when doing so you should also configure the SMTP relay function in the SmartSimple platform, to relay the email through your corporate mail exchange system for successful delivery of email. This will require the ability on the part of your mail exchange system to accept SMTP relay, and accept email relay from the SmartSimple platform. If you configure email within the SmartSimple platform to send with a from address of your own corporate domain, but do not have SMTP relay configured, there is a high likelihood that the email will be designated as spam, and not be delivered to the recipient.\nTo Configure SMTP Relay in SmartSimple\nThe configuration of SMTP relay functionality can be found in the Global Settings -> Communications tab. When this feature is configured, all subsequent email generated by the platform will be routed through the specified server. It is important, when leveraging this feature, to also have configured, everywhere in the platform that allows you to specify the from address of an email, an appropriate email address in order for the platform to successfully relay email to the specified mail exchange server. The following table describes the settings available for configuration with SMTP relay.\n Setting\n Description\n Server\n (Required) the web or IP address of the external endpoint of your corporate mail exchange server to connect to, e.g. smtp.samplecompany.com.\n User Name\n (Optional) a username for the account that the SmartSimple platform will authenticate against your corporate mail exchange server. This attribute is optional if you are using source authentication rather than account-based authentication.\n Password\n (Optional) the password for the above user, if a password is configured.\n Port\n (Optional) the port to connect to on the destination server, e.g. 587, (defaults to 25 when left blank).\n Encryption\n (Optional) enable or disable transit encryption, and specify the version.\nTo Configure SMTP Relay in Your Mail Exchange Server\nPlease refer to any documentation provided by the vendor of your mail exchange server for specific instructions on how to enable SMTP relay functionality. Some general points to consider during setup are listed below.\n Determine the method of authentication, and whether basic authentication with username will be used.\n Verify the permissions of the account used for the relay functionality. Is the account able to send email to external entities/domains? Is the account able to send email from other internal accounts? Consider the scenario where users may use the SmartSimple platform to send ad hoc email with the from address set to their individual email address.\n Consider any sending limits that may be imposed by your mail exchange server, and compare this against the sending behaviour of your SmartSimple system.\nSending From Your Own Domain without SMTP Relay\nThis configuration is not recommended as it will result in email being sent by the SmartSimple platform via the local mail server of the application server, and has a high likelihood of being designated as spam.\nWhere to Set the Email Domain\nDue to the highly configurable nature of the SmartSimple platform, there are several different areas that allow you to specify what from address an email is composed with. The below table describes where to find each of these settings and what they control.\n Setting\n Description\n Global Setting -> Security -> Password and Activation Policies -> Activation Emails\n The address associated with email related to user creation and password management activity.\n Global Setting -> Communications -> Email Options and Security -> Enable Default From Address\n The default address associated with automatic system generated email, e.g. system alerts, MFA verification during authentication.\n Global Setting -> Users -> Signup Pages\n The address associated with initial welcome email related to each individual user signup page.\n Global Setting -> Workflows -> Workflow Tasks (of type Acknowledgement)\n The address associated with email sent by Workflow automation tasks.\n Global Setting -> Email Broadcasts\n The address associated with each email broadcast template.\nEmail Templates\nAdministrators can configure pre-made templates for their end users, in order to provide consistent branding, or initial text content, which may then be selected when composing an email to pre-populate the email contents.\nLearn more about \nformatting email\n.\nCreating a New Message Template\n Open the \nMain Menu\n, then under the \nCommunication\n category, select \nEmail\n.\n Navigate to the second tab labelled \nTemplates\n. Any templates that already exist in the system will be listed and be available for editing.\n In order to create a new template, click the \n+\n icon on the top left.\n \n \n Setting\n Description\n \nName\n Message template name as it will appear on the template list.\n \nType\n Two types are available: \nEmail Template\n and \nEmail Signature\n.\nEach user can have an \nEmail Signature\n that will be automatically appended to the bottom of each message that they create.\n \nCategory\n You can select from one of the following options: \n \nGeneral:\n Email Template will be available in all contexts.\n \nUTA Level 1:\n Email Template will only be available when sending an email from a UTA.\n \nLevel 2 & 3:\n Email Template will only be available when sending an email from a UTA Level 2 or 3.\n \nContact:\n Email Template will only be available when sending an email from a contact record.\n \nPrivate/Public\n Select private if this will just be a template for use by yourself, or public if you wish to make this template available to other users. This option is not visible to users who do not have the manager permission for creating an Email Template.\n \nRole Allowed\n Select from available system roles to determine who has visibility of, and may use this Email Template.\n \nDefault Attachment\n Select an attachment to always include when using this template to compose an email.\n \nSubject\n The default subject line to use for the email.\n \nBody\n The default body to use for the email.\nSaving Email to the Platform\nConfiguring Activity Types to Represent Email\nEmail may be saved to the platform in the form of activity records.\nLearn more about \nIntegrating Email with the UTA\n.\nEmail Anything Feature\nWith the Email Anything feature, the platform can generate unique email addresses that are mapped to individual records. Any emails sent to these unique email addresses, are then processed by the platform to be attached to the record as a sub activity. This allows you to track all email communications surrounding a particular record as activities within the platform.\nLearn more about the \n Email Anything\n feature.\nConfiguration - Advanced\nEmail Security\nTo configure access permissions surrounding email functionality, including access to specific email features, as well as granular settings within email functions to restrict which user roles a user can include as an email recipient, see our \nEmail & Email Broadcast Security page\n.\nFrequently Asked Questions\nSee Also\n \nEmail & Email Broadcast Security page\n \nMessage Queue\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Email&oldid=41162\n’ \nCategories\n: \nEmail\nCommunications",
  "links": [
    "https://wiki.smartsimple.com/wiki/Overview_of_the_Email_Broadcast_Application",
    "https://wiki.smartsimple.com/wiki/Group_Email",
    "https://wiki.smartsimple.com/wiki/Integrating_Email_with_the_UTA",
    "https://wiki.smartsimple.com/wiki/Email_Anything",
    "https://wiki.smartsimple.com/wiki/Email_%26_Email_Broadcast_Security",
    "https://wiki.smartsimple.com/wiki/Email_%26_Email_Broadcast_Security",
    "https://wiki.smartsimple.com/wiki/Message_Queue"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/8/86/Email_new_template_save_as.png"
  ]
}