{
  "url": "https://wiki.smartsimple.com/wiki/General_Data_Protection_Regulation_(GDPR)",
  "title": "General Data Protection Regulation (GDPR)",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nPlease see \nConfiguring Privacy, Confidentiality and Other Policies\n for related information. \nContents\n1\n \nOverview\n2\n \nFeature Descriptions and Requirements\n2.1\n \nPersonal Data Management Features\n2.2\n \nConsent and Compliance Features\n3\n \nGlossary for GDPR\n4\n \nSupport for Privacy Policies and Features\n5\n \nSee Also\nOverview\nOne of the largest aspects of \nSmartSimple\n's \nprivacy configuration\n is our compliance with the \nGeneral Data Protection Regulation\n (GDPR). The GDPR is an EU legislation that is designed to protect the fundamental rights of citizens and their personal data. This law ensures that people not only know where their private data is kept, but it also holds organizations accountable and transparent in their practices.\nEUGDPR.org\n lists the key changes brought about by the enforcement of the GDPR, which began on \nMay 25, 2018\n. As a directly binding regulation, the GDPR stipulates that controllers of personal data must put in place appropriate technical and organizational measures to implement its data-protection principles.\nThis article describes which features and policies \nSmartSimple\n has implemented into our platform to help you comply with the GDPR.\nFor more information about SmartSimple's implementation of GDPR-compliance, see \nour website\n. \nFeature Descriptions and Requirements\nSmartSimple has created two categories of features that are GDPR-compliant: features related to \nPersonal Data Management, \nand those related to \nConsent and Compliance. \nPersonal Data Management Features\nPersonal Data Management \nfeatures are focused on managing your data effectively and automating your data governance model. To make the most use of the following features, we recommend identifying all personal data fields in the system and organizing them into data categories. \nFeature\nDescription\nGDPR Regulation\nPersonal Data Field (Indicator)\nThis will indicate whether a field contains personal data and add a processing description.\nThis allows you to quickly differentiate between personal and non-personal \ndata fields\n, and allow \ninternal\n and \nexternal\n users to view the description. Adding an indicator makes it easier to ensure that \nall personal data fields \n are accounted for when erasing personal data, adding policies, enabling pseudonymization, or searching/reporting.\n \n(5)(2) Accountability\nData Categories\nOrganizing the data you collect into data categories such as the following: Contact Data, Financial Data, Highly Sensitive Data, etc.\nThis feature will allow you to tailor highly specific security and data retention policies to different classes of data. You are able to apply any number of policies to a category.\n \n(30)(1)(e) Categories of Personal Data\n \n(25)(2) Technical and Organisational Measures; demonstration of purpose\nData Retention Policies\nA data retention policy defines how \nlong\n your organization will need to retain the data of this category in the system before it is erased. A data retention policy can be placed on any field in the system, and the erasure will be completely automated. Retention is based on the number of months or days after a specific date.\n (5)(1)(e) Storage Limitation\n (5)(1)(b) Purpose Limitation\nData Security Policies\nA data security policy defines who can see and/or modify the data of this category in the system.\nSecurity policies support \nSmartSimple\n's \nrole-based security\n. We can configure your security policies to help you achieve the principle of \nprinciple limitation\n and \nintegrity and confidentiality\n by ensuring that only those who need to access data for legitimate, specified purposes will be allowed to do so.\n (5)(1)(b) Purpose Limitation\n (5)(1)(f) Integrity and Confidentiality\nPseudonymization\nPseudonymization\n allows you to mask personal data fields, so that the data you retain on an individual is rendered unidentifiable.\nPseudonymization allows for a nuanced approach to data management. Deleting a entire \nprofile\n and all the data associated with a person is often unnecessary and will create gaps in \nreports\n. Utilizing pseudonymization enables you to render specific \nfields\n unidentifiable, retaining the effectiveness of long-term reporting while meeting data retention requirements.\n (5)(1)(e) Storage Limitation\n (5)(1)(f) Integrity and Confidentiality\n (5)(1)(b) Purpose Limitation\nConsent and Compliance Features\nThese features are catered towards managing your data subject's consent, as well as managing your overall compliance.\nFeature\nDescription\nGDPR Requirements\nPersonal Data Field (Information & Access)\nIt is essential that the end \nuser\n understands \nwhy \nand \nhow \nyou will process their personal data in order for them to make an informed consent decision. \nThe \nPersonal Data Field Indicator \ngives you the ability to indicate any \nfield\n that will hold personal information and set a description of the uses of that field. \nWhen the user displays \nany page \nin the system that uses \npersonal information fields, \nthey have the ability to see all of the explanations that you have added. On their \nprofile\n, the user can view a list of personal data fields that you hold on them. \nThis feature is automatically available in every instance of SmartSimple. \n Informed consent\n Data subject's right to transparent information\n Information to be provided where data is collected from the data subject\n Right of access \nPolicy Consent\nAfter establishing a policy internally, you can enforce it by having your \nusers\n agree to it upon \nlogin\n. The policy can be set to mandatory, ensuring that if a user does not accept the policy, they will not be able to access the system or enter personal information.\nAny number of policies can be added, and they can be enforced one time, or at timed intervals. Once a user accepts a policy, the system will create a PDF of the acceptance with a time/date stamp, creating a fully auditable consent collection process. \n \n(7)(1)\n informed consent, demonstration of consent\n \n(2)\n Accountability\nCookie Policy\nCookie Policy is a feature to alert users to the use of cookies on the \nSmartSimple\n application. It will alert \nusers\n landing on the \nlogin page\n and require them to accept the use of cookies. \nWe have also introduced a policy template that you can use to create your own cookie usage policy within your \nPrivacy and Security Policies\n. \n Informed consent\nPersonal Data Erasure\nThe \npersonal data erasure \nis used in order to comply with requests to delete user data. This new feature can be enabled on \nUTA\n \nLevel 2\n \ntypes\n as an individual's data erasure request. \nWithin this \nLevel 2\n, an \nadministrator\n would then be able to review these Level 2 requests and have an option available that would delete the user \nprofile\n of the Level 2 owner.\nA certificate of data erasure is then created in order to reference this activity.\n Rights of the data subject\nRequest Tracker UTA\nThis is a customized feature that must be requested by the client to be configured into their specific instance of SmartSimple. \nWe are able to build a Request Tracker to help you manage Data Subject Requests, such as the following: Right of Access; Right to Rectification; Right to Erasure; Right to Restriction of Processing, etc. \n Obligations of the controller\n Rights of the data subject\nGlossary for GDPR\nTerm, Principle, or Abbreviation\nDefinition\nEEA\nEuropean Economic Area - \nbased on an international agreement in 1992, the EEA enables the extension of the European Union's single market to non-EU member parties. Membership has grown to 31 states as of 2016: 28 EU member states, as well as three of the four member states of the European Free Trade Association: Iceland, Liechtenstein, and Norway. The agreement is applied provisionally with respect to Croatia. Switzerland has not yet joined the EEA, but has a series of bilateral agreements with the EU which allow it to also participate in the internal market. \nEU\nEuropean Union\n - a political and economic union of 28 member states that are located primarily in Europe. \nGDPR\nGeneral Data Protection Regulation - \nThe GDPR 2016/679 is a regulation in EU Law on data protection and privacy for all individual citizens of the European Union (EU) and the European Economic Area (EEA). The GDPR was adopted on April 14, 2016 and became enforceable beginning May 25, 2018. \nGDPR Principle\nDescription\n(5)(1)(b) Purpose Limitation\nArticle 5 \nof GDPR: Principles relating to processing of personal data \n1. Personal data shall be: \nb) collected for spescific, explicit, and legitimate purposes, and not further processed in a manner that is incompatible with those purposes; further processing for archiving purposes in the public interest, scientific, or historical research purposes or statistical purposes shall, in accordance with Article 89(1), not be considered to be incompatible with the initial purposes ('purpose limitation') \n(5)(1)(e) Storage Limitation\nArticle 5 \nof GDPR: Principles relating to processing of personal data \n1. Personal data shall be: \ne) kept in a form which permits identification of data subjects for \nno longer than is necessary \nfor the purposes for which the personal data are processed \n(5)(1)(f) Integrity and Confidentiality \nArticle 5 \nof GDPR: Principles relating to processing of personal data\n1. Personal data shall be: \nf) processed in a manner that ensures appropriate security of the personal data, including protection against unauthorised or unlawful processing and against accidental loss, destruction, or damage, using appropriate technical or organisational measures ('integrity and confidentiality') \n(5)(2) Accountability \nArticle 5 \nof GDPR: Principles relating to processing of personal data\n2. The controller shall be responsible for, and be able to demonstrate compliance with, \nparagraph 1\n ('accountability') \n(7)(1) Informed consent, demonstration of consent\nArticle 7\n of GDPR: Conditions for consent\n1. Where processing is based on consent, the controller shall be able to demonstrate that the data subject has consented to the processing of his or her personal data.\n(25)(2) Technical and organisational measures - purpose\nArticle 25 \nof GDPR: Data protection by design and by default \n2. The controller shall implement appropriate technical and organisational measures for ensuring that, by default, only personal data which are necessary for each specific purpose of processing are processed. \n2. The controller shall implement appropriate technical and organisational measures for ensuring that, by default, only personal data which are necessary for each specific purpose of processing are processed.\nThat obligation applies to: \n the amount of personal data collected\n the extent of their processing\n the period of their shortage\n their accessibility \nIn particular, such measures shall ensure that by default personal data are not made accessible without the individual's intervention to an indefinite number of natural persons.\n(30)(1)(e) Categories of Personal Data\nArticle 30 \nof GDPR: Records of processing activities\n1. Each controller and, where applicable, the controller's representative, shall maintain a record of processing activities under its responsibility. That record shall contain all of the following information: \ne) where applicable, transfers of personal data to a third country or an international organisation, including the identification of that third country or international organisation and, in the case of transfers referred to in the second subparagraph of Article 49(1), the documentation of suitable safeguards \n(89)(1) Safeguards and Pseudonymization \nArticle 89 \nof GDPR: Safeguards and derogations relating to process for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes \n1. \n1\n Processing for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes, shall be subject to appropriate safeguards, in accordance with this Regulation, for the rights and freedoms of the data subject.\n2\n Those safeguards shall ensure that technical and organisational measures are in place in particular in order to ensure respect for the principle of data minimisation.\n3\n Those measure may include \npseudonymization \nprovided that those purposes can be fulfilled in that manner. \n4\n Where those purposes can be fulfilled by further processing which does not permit or no longer permits the identification of data subjects, those purposes shall be fulfilled in that manner. \nSupport for Privacy Policies and Features\nIf you have any inquiries about the GDPR, the implementation of any of these features, and/or \nSmartSimple\n's \nprivacy policies\n, please feel free to reach out to us via our \nsupport team\n. \nSee Also\n \nConfiguring Privacy, Confidentiality and Other Policies\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=General_Data_Protection_Regulation_(GDPR)&oldid=39466\n’",
  "links": [
    "https://wiki.smartsimple.com/wiki/Configuring_Privacy,_Confidentiality_and_Other_Policies",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Configuring_Privacy,_Confidentiality_and_Other_Policies",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Standard_Field",
    "https://wiki.smartsimple.com/wiki/Internal",
    "https://wiki.smartsimple.com/wiki/External",
    "https://wiki.smartsimple.com/wiki/Data_Categorization_and_Policies",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Role_Based_Security",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/Reports",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/Configuring_Privacy,_Confidentiality_and_Other_Policies#Policy_Details",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Login_Page",
    "https://wiki.smartsimple.com/wiki/Login_Page#Agreeing_to_Cookies",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Login_Page",
    "https://wiki.smartsimple.com/wiki/Login_Page#Privacy_and_Security_Policies",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/Level_Two_Entities",
    "https://wiki.smartsimple.com/wiki/Types",
    "https://wiki.smartsimple.com/wiki/Level_Two_Entities",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Profile",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/How_the_SmartSimple_Support_Desk_Works",
    "https://wiki.smartsimple.com/wiki/Configuring_Privacy,_Confidentiality_and_Other_Policies"
  ],
  "images": []
}