{
  "url": "https://wiki.smartsimple.com/wiki/How_the_SmartSimple_Support_Desk_Works",
  "title": "How the SmartSimple Support Desk Works",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nWhat is the role of the Support Desk?\n2\n \nContact Information\n3\n \nCommunity Portal\n3.1\n \nInside the Community Portal\n4\n \nWhat the Support Desk Does\n4.1\n \nTicket Service Levels\n5\n \nWhat other support options are available through the SmartSimple Community?\n5.1\n \nPremium Support\nWhat is the role of the Support Desk?\nThe role of the Support Desk is to be your first point of contact for anything \nSmartSimple\n related. If you have a question, have an idea for a new feature, or need a resolution to a problem, then we are the place to start.\nContact Information\nIt is our goal to provide you with timely and complete answers to your questions or concerns and to ensure that you are getting the most out of the \nSmartSimple\n platform within your organization.\nYou can connect with us through any of the following channels:\n \nPhone (Canada and United States):\n (+1) 416-591-1668\n \nPhone (Canada and United States) Toll Free:\n 866-239-0991\n \nPhone (Europe):\n 353(0) 1 554-7428\n \nEmail:\n \nsupport@smartsimple.com\n \nDirect:\n From the Help menu within \nSmartSimple\n, just select the Support Request option\nYou may also contact our live agents who provide round-the-clock technical support 24 hours a day, 5 days a week. You have access to live support during the following hours: \n \nGMT: \n11pm Sunday - 1am Saturday\n \nEST: \n7pm Sunday - 9pm Friday\n \nPST: \n4pm Sunday - 6pm Friday\n \nAEST: \n9am Monday - 11am Saturday\nContact Live Agent here\nCommunity Portal\nCurrent clients may log tickets through their own \ninstance\n using our \nCommunity Portal\n function. The Community Portal is a dashboard that simplifies the process of managing your tickets and connecting with SmartSimple. \nTo enter the Community Portal:\n1. Click the 9-square menu icon on the top right of your page:\n2. Under the heading \nHelp,\n select \nSupport.\n3. Press \nEnter\n to launch the \nCommunity Portal.\nInside the Community Portal\n \nBelow is a list of activities that can be performed from within the Community Portal. \nTopic\nActivities\nTicket Information\n Create tickets\n View all active tickets\n Close resolved tickets\n View enhancements\n Export ticket information\nCommunity Features\n View upcoming \nWebinars\n Read community news\n View your event registrations\nLinks to Access\n Live Chat \n Access to SmartSimple Forums\n \nDiscussion Boards\n Access to the SmartWiki\n Link to \nSmartSimple Youtube\nWhat the Support Desk Does\nThe \nSmartSimple\n Community Support Desk provides first level support to clients plus a triage of the issue to determine if it needs to be redirected to other specialists within the company. You can anticipate the Community Support Desk will be able to answer questions related to:\n Accessing your organization's copy of \nSmartSimple\n.\n Logging into the system (including lost \npasswords\n, etc).\n All standard features and functions within the system.\nThe Community Support Desk will generally not be able to directly assist you if the issue is related to:\n Your organization's specific processes.\n Industry related issues.\n In-depth technical issues.\nFor these types of issues the Community Support Desk will redirect to the appropriate industry or technical specialist.\nIn all cases a ticket number is issued and an email sent to you confirming that the issue has been logged, even if the issue was resolved on the first call. Where the ticket cannot be resolved on the first call the issue will be managed by Community Support Desk personnel - even if other specialists are involved.\nTicket Service Levels\nThe Service Levels determine the classification and process of each Support Ticket:\nSeverity of Impact\nDescription\nExample\nSupport Process\nCritical \nIssues relating to system availability or performance preventing usage or access to the system as a whole or to its primary functionality.\nServer Unavailable\n This critical impact ticket was raised for an issue that directly affected system availability for multiple users.\n Client was unable to log into their SmartSimple \ninstance\n and was receiving an error message stating that the server was unavailable.\nClient promptly contacted SmartSimple Support and explained the situation with a screenshot of the error message.\nSupport immediately actioned the issue with our development team and was able to restore service after a brief outage.\nHigh\nIssues relating to system availability or performance preventing usage or access to the system as a whole or its primary functionality. \nUser Unable to Submit Application\n This high impact ticket explained that an end user was unable to submit their application.\n This was an issue for a specific end user; no other users were affected by the same issue.\nClient promptly emailed SmartSimple Support with the user's name, email, application ID, and grant program. \nSupport checked the relevant application and determined a portion of the budget had not been completely properly. The end user was notified and the application was successfully submitted.\nMedium\nIssues that prevent a subsection of the system processes from working for all users or configuration changes that need to take place in a timely manner.\nPayment Activities Not Saving\n This medium impact ticket stated that changes made to Payment Activities (\nLevel 3 Entity in the UTA\n) were not being applied after saving.\n This issues prevented some system features from behaving as the client had intended.\nThe client submitted a ticket explaining which grant the error was applicable to, which level of activity, the details of the issue, and a specific example with the application ID. \nThis issue was resolved once Support notified the client that these activities were meant to be created through an automated process (called \nBatch Create Payment\n) and not created manually, which is why they were experiencing the issue. The automated process was utilized to create the payment activity and the client was able to continue their work. \nLow\nGeneral questions relating to configuration.\nMake Report Exportable\n This low impact ticket was submitted asking that we assist a client with making an existing report exportable.\nThe client contacted Support with the process they were attempting to do, the relevant IDs, and what outcome they wanted. \nSupport checked the report and made the requested changes in the \nbackup instance\n. Once the client confirmed the changes resulted in the desired export ability, they were applied to production.\nWhat other support options are available through the \nSmartSimple\n Community?\nWe provide several methods for becoming more familiar and increasing your knowledge of the \nSmartSimple\n platform outside of our Community Support Desk. They are:\n \nSmartSimple Wikipedia (Wiki)\n – This is our very own online \nSmartSimple\n encyclopedia. The easiest way to find the information you need would be to search by the 'key words' of the topic that you are trying to gather more information on. Or you can browse the Wiki by category or view the index alphabetically.\n \nSome quick Wiki tips!\n When searching 'key words' try to keep the words to a minimum and try to avoid using long phrases or sentences.\n Search on the key points rather than more general topics, so if you are looking for information on creating and making your own reports search on words like 'create report' or 'report builder'.\n Most important of all, we strive to keep the Wiki up to date so if you can’t find something in the Wiki then let us know and we will help you find it or add it to our list of topics to update.\n \nOnline training sessions\n - We continually offer online training sessions that are available for anyone that uses \nSmartSimple\n. They are categorized into Basic, Intermediate, Advanced and Open to best suit your current knowledge of the \nSmartSimple\n platform. Please contact the Community Support Desk to find out more information or schedule a session.\n \nMobile Support\n - We also offer a unique type of onsite support. We are continually looking at the types of requests and tickets that come in through the \nSmartSimple\n Community Support Desk. If we see an opportunity that would benefit your organization to have some additional onsite support then we will reach out and schedule an onsite visit with our mobile support and make sure you are getting the most out of \nSmartSimple\n.\nPremium Support\nSmartSimple's \nPremium Support Services\n provide you with a Dedicated Support Representative (DSR) who will handle all of your support requests directly and will have in-depth knowledge of your SmartSimple system. You'll also benefit from an optional monthly call with our Director of Customer Experience to discuss any questions about system functionality, training, or configuration. \nWhile \nEssential Support\n, also known as our Technical Community Support, comes standard in all of our Service Level Agreements (SLAs), \nPremium Support Services\n offer enhanced access to our support team. \nItem\nTechnical Community Support\nPremium Support\nLive Agent\nGeneral client support group on rotation\nNamed Dedicated Support Representative (DSR)\nDirector Level Access\nUpon request or escalation\nRegular meetings and on-demand access consultations\nConfiguration Services\nAt additional fee as estimated\nIncluded (up to 4 hours per request)\nTraining\nAt additional fee as estimated\nIncluded (up to 3 hours per quarter)\nFee\nIncluded in licensing\nPlease contact your Account Manager\nYou may contact your Account Manager for more details about Premium Support Services. \n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=How_the_SmartSimple_Support_Desk_Works&oldid=43658\n’ \nCategories\n: \nSystem Management\nHelp Desk\nSmartSimple",
  "links": [
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Password",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Payment_Scheduler",
    "https://wiki.smartsimple.com/wiki/Backup_Server_and_Testing_Instances",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/b/be/Community_portal.png"
  ]
}