{
  "url": "https://wiki.smartsimple.com/wiki/Impact_Map",
  "title": "Impact Map",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguration - Essentials\n2.1\n \nSettings Explained\n2.2\n \nMap Theme Styles\n3\n \nConfiguration - Advanced\n3.1\n \nSee Also\nOverview\nThe Impact Map is a feature that can be used to plot records from a UTA on a map interface to display locations from the UTA records.\nThis feature provides a unique method for visualizing your data using geomapping functionality, commonly used for displaying locations of grant impact.\nIn order to configure an Impact Map, you will need administrator access to the UTA that will be used for generating the locations on the map.\n \nSample Impact Map Display.\nConfiguration - Essentials\n Choose the UTA the map will be associated with based on the types of records you want to present on the map.\n An Impact Map can be created using either Level 1 or Level 2 records in the UTA.  \n Level 1 records will be displayed on the Impact Map using the location of the organization (standard field: client) associated to the record.\n Level 2 records may be displayed on the Impact Map using a unique address that will be defined using Geocode Field Mapping settings.  See 'Configuration - Advanced' for additional steps that are required.\n In order for records to be plotted on the map, the use of the standard fields 'Latitude' and 'Longitude' must be enabled on your records.  Review your records' standard fields, and enable these fields if not completed previously.\n Note: The values for Latitude and Longitude must be stored to the record by either saving the record or using the 'Retrieve Latitude/Longitude' workflow task type.\n In the UTA Configuration Settings, navigate to the Level 2 tab and select the 'Impact Map Settings' link.  \n Create a new map using the (+) Create New Map button in the menu.  Assign the map settings based on the available parameters listed in the 'Settings Explained' section below.\n Once you have entered all of the settings for the map, save the map.  \n Click the 'Generate HTML and JSON files' button to create the required files that will be stored to your selected SmartFolder.  The HTML file URL will be accessible in the Impact Map configuration page.  This can be referenced for navigating to the map, and can be utilized in portal design by referencing the relative URL in a custom page or custom portal section (Example: /files/368847/f304276/11_impactmap.html).\nSettings Explained\nSetting\nDescription                \nName\nThe name of the map you are creating.\nDescription\nUsed for storing additional detail about the map.\nType Filter\nFilters the records being plotted on the map based on the record type.\nType Filter\nFilters the records being plotted on the map based on the record type.\nStatus Filter\nFilters the records being plotted on the map based on the record status.\nAmount Field\nThe field that will be used in an aggregate sum displayed on the map (Grant Total: $###).\nZoom Level\nThe level of zoom defined for loading the page on the Zoom Center you select.\nZoom Center\nThe location on the map that the map will default in loading.\nAuto Zoom\nThis option will automatically load the map zoomed in on the area where records exist.  If selected, the Zoom Level and Zoom Center are not utilized.\nMap Theme\nThe style of the map that will be displayed.\nMarker URL\nThis can be utilized to reference an image file for use as the map markers in place of the default Google Maps marker.  This is not required if you want to use the default marker.\nInformation Fields\nSelect the fields from the UTA record that you want displayed in the information box that will be displayed when selecting a marker on the map.\nInformation Template\nThis can be utilized if you plan to use a custom template for the Information Fields display on the map.  This is not required.\nKML\nYou can add references to KML files for your map so that KML overlays can be applied to the map.  This is not required.\nSmartFolder\nYou must select a SmartFolder where the map files will be stored to within your SmartSimple instance.\nMap Theme Styles\nBlue Water\n \nSample Impact Map Display.\nFacebook\n \nSample Impact Map Display.\nLight Grayscale\n \nSample Impact Map Display.\nGolden Brown\n \nSample Impact Map Display.\nRetro\n \nSample Impact Map Display.\nConfiguration - Advanced\nBy creating a Level 2 Impact Map, you have the flexibility to present a unique address for your location, but also have the ability to present multiple locations for a single Level 1. For example, if you have a Level 1 Grant that occurs in multiple locations, you can create multiple location Level 2 activities to plot multiple points on the Impact Map.\nOne approach for creating your Level 2 location activities is the use of an Advanced Data Table custom field on your Level 1 record which is mapped to create Level 2 records. With this approach, you can enter multiple locations in the Advanced Data Table field, and each will create a Level 2 record automatically. See \nCustom_Field_Type:_Special_-_Advanced_Data_Table\n for steps on Managing Level 2 / 3 Activities with a Section.\nWhen creating an Impact Map using Level 2 records, you will need to take several additional configuration steps that are not required for Level 1 record maps.\n Ensure that the 'Latitude' and 'Longitude' standard fields are enabled on your Level 2 object in your UTA.  Navigate to your Standard Fields list for your Level 2 object and save the 'Latitude' and 'Longitude' fields if they have not been enabled previously.\n Create custom fields on your Level 2 object for storing the address that will be plotted on the Impact Map.  These may include fields to capture Address 1, Address 2, City, State Country, Postal Code.  You must separate each attribute into a distinct field.\n Geocode Field Mapping must be established on your Level 2 object.  The Geocode Field Mapping feature allows for the calculation of latitude and longitude based on addresses entered against level 2 custom fields.\n Navigate to your UTA configuration settings, view the Level 2 object tab, and click on the the link labeled \nGeocode Field Mapping\n.\n Define the Level 2 custom fields that will be used for each defined address component.\n \nAddress Mapping\n In order for the Level 2 record to store the latitude and longitude for the location, the Level 2 record must be saved after the address details have been entered in the address custom fields. Alternatively, you may use a workflow on the Level 2 record that uses the 'Retrieve Latitude/Longitude' workflow task type. This workflow task will automatically calculate the latitude and longitude based on the custom field address values. The workflow must be triggered at a point in time after the address values have been entered in the Level 2 record.\nSee Also\n \nKML\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Impact_Map&oldid=43290\n’ \nCategories\n: \nTools\nGeocoding",
  "links": [
    "https://wiki.smartsimple.com/wiki/KML"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/9/90/Map_Sample.png",
    "https://wiki.smartsimple.com/images/4/42/Blue_Water.png",
    "https://wiki.smartsimple.com/images/5/55/Facebook.png",
    "https://wiki.smartsimple.com/images/0/0c/Light_Grayscale.png",
    "https://wiki.smartsimple.com/images/a/a2/Golden_Brown.png",
    "https://wiki.smartsimple.com/images/e/e1/Retro.png",
    "https://wiki.smartsimple.com/images/1/18/L2AddressMapping1.png"
  ]
}