{
  "url": "https://wiki.smartsimple.com/wiki/List_View_Overview",
  "title": "List View Overview",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguration—Essentials\n2.1\n \nExample of List Views\n2.2\n \nSystem Views and Personal Views\n2.3\n \nOrganizations and Users List Views\n2.4\n \nList Views in a Universal Tracking Application\n2.5\n \nConfiguring List Views\n2.5.1\n \nProperties\n2.5.2\n \nColumns\n2.5.3\n \nSort Order\n2.5.4\n \nExport\n2.5.5\n \nQuick Edit\n3\n \nConfiguration - Advanced\n3.1\n \nCombining Filters and List Views\n3.2\n \nGlobal Settings - System Filters\n3.3\n \nBatch Update Buttons\n3.4\n \nEnabling Batch Update Permissions\n3.5\n \nGroup Email\n3.5.1\n \nGroup Email for Organizations and Users List Views\n3.5.2\n \nGroup Email for UTA List Views\n3.5.3\n \nSending a Group Email\n3.6\n \nConfiguring Interactive List View Charts\n3.6.1\n \nHow to Configure Interactive List View Charts\n3.6.2\n \nUsing the Interactive List View Chart\n3.6.3\n \nInteractive List View Chart Types\n4\n \nHelpful Tips with List Views\n4.1\n \nMaking List View Searches Faster\n4.2\n \nAccessing the List View Configuration Page\n4.3\n \nUsing Reports vs List Views\n5\n \nSee Also\nOverview\nList views are the part of the SmartSimple interface that combine similar records in a vertically scrolling list. The \nList View \nallows you to define which \nstandard fields\n and \ncustom fields\n are displayed when viewing a list of records. List views are configurable, so that you can define and customize such factors like the sequence in which records are displayed, the colour formatting of certain records, the number of records that are displayed, and more. \nList views apply to every object level in the SmartSimple system: users, organizations, or any kind of \napplication\n. Within each of the list views, you can create and combine \nfilters\n to customize the results of your list views. \nFeatures of List Views: \n Up to 30 columns of records\n Dynamic Filters — create and combine filters, narrow down by type or status, control date/time options, etc\n \nDownload Files\n option — download all records from a list view, including attachments\n SmartCard Indicator — collect groups of objects into different \nSmartCard\n that can be easily shared with other users \n Group Email — send a group email; for example, mass email a list of applicants from approved applications from a previous year \n Formatting Options — drag and drop sequence of records, format colour and text boldness, group fields to display in a single cell, etc\n Multiple View Options — change list views into dashboards, interactive charts, graphs, etc\n \nExport to Excel\n — easily export list views to Excel for record-keeping sheets\n \nExport to MS Word\n — easily export list views to Word for documentation\n Portal Shortcuts — use list view aggregations to display on your \nPortal\n as a shortcut \n Batch Updates — enable a Batch Updates button to modify all records in a list view at once \n ... and much more! \n For first-time users, it is highly recommended to test List View modification on the Backup Server first. \n See: \nBackup Server and Testing Instances\nConfiguration—Essentials\nA typical external user is unable to edit list views, although they may select between varying list views to change their screen. Only users with the role of \nSystem Administrator\n are able to edit list views. \nNote:\n A \nDefault \nList View should always remain in the system as a generic list of basic details, with no filter assigned to allow free searching. \nExample of List Views\nFor example, clicking on \nOrganizations \nfrom the main menu will display a list view of organization records in your SmartSimple system: \n \nIn the above example, the following fields have been selected for display: \n Organization Name, Address, City, State, Phone Number, Primary Contact, Website, and Status (inactive/active) \nEach field in this list is able to be sorted differently (default, ascending, descending) by changing the value of the \nSort By\n dropdown box to the right of each field. \n \n \nThe list can also be filtered by using the \nBasic Search\n panel which is at the right of the list view, or the \nAdvanced Search\n panel which, when selected, will open as a modal window where you can customize your search. \n \nNote: \nList views will default to the last set of search criteria used. For example, if you perform a search within \nPeople \nfor contacts with the last name \"Smith,\" the next you log back in and view your contacts list, SmartSimple will remember your search and present the last set of search criteria, in the same \nsort order\n. \nA user can modify their current list view by selecting the \nList View Options \nicon on the top right. \n \n \nThis will open a modal window that allows the user to select or de-select certain fields to be shown in their current list view. The benefit of this feature is that each list view can display a different combination of fields, both \nstandard\n and \ncustom\n. \n \nOther options to modify list views can be accessed through the top buttons available on a list view. \n \nThe above example shows the following buttons from left to right: \nList View Button\nFunction\nNew \nThe new button, marked by a \n+ \nicon, allows you to create a new record in that list view. \nEx: \nIn a list view of organizations in a SmartSimple system, you will be able to create a new organization. \nReload\nClicking the reload button will refresh the page. \nList View Options\nCurrent - \nAllows you to select and de-select which columns you want visible in the list view. \nGlobal \n-\n \nSmartCard Indicator: \nToggling this on allows a list view to be added to a \nSmartCard\n for easy storing and sharing of resources to customized groups of users. You will be able to use the SmartCard function after you save this setting by highlighting the \nstar icon \nthat will appear on the right side of the record in a list view. \n \nOpen in Modal Window: \nThis function is specific for records on list view within another record. Toggling this function on will allow the associated records to appear in a modal window, so that a user is able to easily access and look into the records without having to leave their original list view page. \n \nRecords Per Page: \nThis function allows you to choose how many records you want displayed in a list view page. The minimum option is 10 and the maximum option is 100. Remember that more records on a page might increase the page's loading time. \nBatch Update\nThe \nBatch Update \noption allows you to update selected fields of the records on a list view at once. \n \nNote: \nThis option is often only available to System Administrators. Learn how you can \nenable Batch Update permissions\n. \n \nTip: \nBatch update buttons\n are recommended because the default batch update button more easily allows for accidental deletion. However, you can always \nrestore deleted records\n for up to one year. \nExport\nThe \nExport \nfunction, demarcated by a \nright arrow icon, \nallows you to export the records on the list view to Excel, \nSmartFolders\n, or another Internet-enabled folder. For more, see our \nExporting List Views\n section. \nList View Options\nThe List View options function is demarcated by a \nlist icon\n and the label \nDefault \nor a customized name.\n \nClicking this icon will open a drop down consisting of the available List Views, which can be toggled between for differing list views of the records. \n There will be a check mark next to the list view that you are currently on\n The \nwrench icon \nnext to each list view will open it up in Edit Mode\n The \ncog icon \nnext to the label \nSystem List Views \nwill open up all the available system list views as a list \nSystem Views and Personal Views\nThere are two types of list views: \nSystem Views\n Belong to a specific \nUser Role\n \n All users in that role will have the option to select this List View\n \nNote: \nMultiple System Views can be defined for each role\n Useful for \nPortals\n, \nreporting\n, dashboards, etc\nPersonal Views\n Only visible to the user who creates them\n \nNote: \nMultiple Personal Views can be defined for each user\n Making a Personal View public will not enable further functionality with that List View\nTo toggle between differing Lists Views, including between System and Personal List Views, simply select the \nlist chart icon \nabove your list view. A drop down list will appear that has both the available System and Personal List Views for each user. Each List View is labelled by the user who originally created them.\nTo edit these List Views, simply select the \nwrench icon \non the left. The details of that list view will be displayed. \n \n \nOrganizations and Users List Views\nBelow are examples of what Organizations and Users List Views look like. \n \nAbove: \nA list of all the users in the SmartSimple system. \n \nAbove: \nA list of all the organizations in the SmartSimple system. \nList views of both users and of organizations can be accessed from the 9-square menu icon on the top right of your page.\n \nUnder the heading \nOrganizations, \nselect \nPeople \nfor a list view of users, and \nOrganizations \nfor a list view of organizations. \nTo configure the list views of users and organizations, follow these steps: \n1. Click the 9-square menu icon on the top right of your page.\n2. Under the heading \nConfiguration, \nselect \nGlobal Settings.\n3. Under the heading of either \nOrganizations \nor \nUsers, \nscroll down to \nList View Settings. \nList Views in a Universal Tracking Application\nWithin the \nUniversal Tracking Application\n, the \nSettings \npage allows you to define the list view for Level 1, Level 2, and Level 3 records, as well as the Accounts and/or Contacts section on the Level 1 records if the Contacts/Accounts \nStandard Fields\n have been enabled. \n \nNote: \nThe List View defined for Level 2 will apply both to the list view on the Level 2 tab and to the list of associated Level 2s at the bottom of a Level 1 record, if shown. This will appear similarly for the Level 3 list view that is listed at the bottom of a Level 2 record. \nTo configure a list view of an application, open the application and select the \ncog icon \non the top of the page that enters \nConfiguration Settings.\n \nIn \nConfiguration Settings,\n the List Views will be available under the appropriate tab depending on the Level of the entity. The \nLevel 1 Entity\n will be available on the first tab \nafter\n the \nGeneral\n tab, and so on. The nomenclature will differ depending on the labels associated with that application.\n \nConfiguring List Views\nClicking into a specific List View will open up the details for that List View. The menu for configuring list views is displayed at the top of the page with different tabs:\n \nEach tab allows different editing functions. Each tab and its functions will be explained in detail below.\nProperties\n \nFunctions of Properties: \nFeature\nDescription\nView Name\nThe name of the list view is editable. Give your list view a distinct name that you will be able to remember and associate with that list view. \n \nNote:\n Best practices for naming convention is to make it consistent across the system. Example: \nRolename - Criteria Summary \ncan be applied to all View Names, creating names such as \nStaff - This Year Approved Applications \nDisplay Order\nEnter a \ndisplay order\n. This will define which list view will be the default for users who possess multiple roles. List views with lower display order numbers will be displayed \nbefore\n those with higher display orders. \nEx: \nIf you want your \nDefault List View \nto show up first on the list of list view options, you could set its display order to 1 (or any other amount that is lower than all other list view display orders). \n \nNote: \nDisplay order can be internally reordered by clicking on the cog icon when accessing a record in list view. \nRole Permission\nSet which \nroles\n you want to have access to this list view. Setting roles is helpful if you know that multiple users will access what you're creating a list view of - for example, you can select \nEveryone\n, or \nEmployees \nonly. If it is a list view containing information only pertinent for \nSystem Administrators, \nfor example, then you can set that role and restrict this view from others. \nFilter Option\nSelect which Filter you want to set on this list view. Filters can be saved and stored through \nAdvanced Search\n, and are labelled by their creators. They can be used as System Filters or Personal Filters. \nView Style\nList \n- The typical list view display, where records are displayed horizontally by their associated details and vertically to each other\nGrid \n- Records are displayed in a grid-like style, with each record displayed in a square. Ideal for records with uploaded images. \nTree \n- Records are displayed in a hierarchical manner where associations between each other are displayed \n Each record can be treated as a parent, where you can expand and open up any files uploaded, activities and users attached, etc\n \nEx: \nOpening up an organization record in an \nOrganization Tree List View \nwill display the contacts within that organization \nCard View Style (Mobile/Grid)\nNote: \nThis feature should only be used if you have enabled the \nGrid View Style \nChoose to display uploaded images on each record as \nFull, Large, \nor \nSmall \nand/or \nAbove, Left,\n or \nRight \nof text\nTip: \nEnsure that there is a sufficient amount of images uploaded for the records in order for the \nCard View Style \nto look reasonable; otherwise, records without images will show up as a blank square. \nManifest as Tab\nDifferent list views will appear as a separate tab that can be toggled back and forth, rather than the user having to select the specific List View from a drop down list. \nNote: \nThis option is not always recommended because of its overuse of screen real estate.\nHide Filter Search Text\nThis option will not display the Filter Search Text in a list view; for example, if a System Administrator sets a specific Filter on a list view but does not want users to know what that filter is, you may select this option. \nDefault Buttons\nUseful for lists where you would need to do a lot of batch updates. Buttons available are under the \nFeature Options \nheading. \nFeature Options: \nOpen in Edit Mode\n: When records are opened, they will default into Edit Mode as opposed to View Mode.\n This feature ensures security standards as only one user may have concurrent editing access to a record: if an applicant is currently editing their work, and an internal user has the same record open in Edit Mode, it will present as locked by \nx\n user. Opening in View Mode is therefore helpful at certain application stages. \nEnable\n \nQuick Edit: \nList View will be configured with the \nQuick Edit\n feature enabled; fields of records can be edited directly from their List View. \n \nTip:\n The split screen function which can be found on the top right of the list view page works well for quick editing, as it allows you to open into each record without having to repeatedly closing and opening windows. \nSplit screen icon: \n(To get out of split screen and back into single screen mode, simply select the same icon which will now have a single square in it.) \nEnable Row Clickable: \nEach row will act as a clickable button to open the referenced record easily. \nEnable File Download: \nDisplays a download option to allow downloading of files from \nsingle file\n or multiple file fields on the selected records. \n The download button will appear on the top right, above the list view. \n The download option allows the function to run in the background while users can navigate other parts of the SmartSimple system; once their downnloaded files complete the downloading process, they will receive a notification. \nEnable Map Panel: \nTakes each record on a list and plugs in the associated client's address to create a geographical visual of where the clients are. This feature converts address details into latitude and longitude coordinates and integrates with Google Maps. \nMarked as Configuration Only: \nThe option for the list view is excluded from the drop down for \nUniversal Tracking Applications\n. Useful for when building multiple list views for an external portal; the list views are accessible only through the cog wheel at the top of the list views drop down. \nTranslated Data Language\nSelect which language you would like the records' data to show up in. \nColumns\n \nThe \nColumns\n tab allows you to visually configure the available columns to a List View. The \nstandard\n and \ncustom\n fields that you want to be displayed in your list view are defined here. The maximum is 30 columns to a list view, but best practice is to only display up to 10 columns, as otherwise the user will have to scroll back and forth horizontally and it is a less presentable record, as the platform is responsive on all devices including mobile screens. \n \nNote: \nA single column can contain multiple field values which can help accomodate the 10 column best practice limit. \nYou may \nDrag and Drop \ncolumns to reorder them, and by clicking the \nX \non the top right of each column you can delete them from the List View. \nList views are highly configurable: you may bring in fields from different areas such as Applicant Fields, Organization Fields, and so on. They will all be displayed underneath the \nFields \nheading and can be scrolled through. \nBy clicking into a cell, you will see the configuration options below.\nIn this example, clicking into the \nOrganization\n cell will highlight the \nOrganization\n standard field and open up configurable options for the user to fill in.\n \nColumn Configuration Option\nDescription\nHeader Caption\nThis will appear as the column's label.\nContent Template\nThis displays the variables for each column's information. Note that multiple standard fields can be added in a single column; the content template will reflect how many fields are in a single column by including the variable for each added field.\n \nTip: \nDo not enter HTML into the content template. It will not appropriately render and will instead appear as tags in text. \nEx: \nA bold \nName \nlabel will appear as \nName\n in order to prevent injectable malicious HTML. \n \nNote: \nVariables cannot be typed into the content template; they can only be selected from the variable list. \nText Align\nYou may choose whether you want the text in a column to align on the \nLeft, Right, \nor \nCenter.\nFont Colour\nSelect which font colour you want the column's information to appear in. This is helpful for columns where you would like to draw the user's attention to, such as the amount requested in a grant, or the status of an application\nBold Text\nAllow the column's information to appear bold.\nShow Total\nToggle on this option for numerical information in which the column should display a total amount. This option is only relevant for numeric fields, and most commonly used for currency fields.  \nShow Open Button\nThis will enable an open button in that column so that the user can open into that record.  \n \nTip: \nThe open button is preferable over \nEnable Row Clickable \n(from \nProperties tab\n) when a client frequently uses \nbatch update\n as it enables less back and forth and accidental clicks. \nMultiple values can be added in each column. Once you click a field, a new \nleft arrow icon\n will appear on the right of the other standard fields. To add another field into one column, select that icon.\nIn this example, the \nPrimary Contact\n is added to the same column as the \nOrganization\n name, so that they will appear together in the List View.\n \nOn the right, you will see that the variable for the \nPrimary Contact\n will show up in the \nContent Template\n box. To make the Primary Contact information appear below the Organization name, simply format the Content Template that way.\n \nTo clear a column with multiple values, click the \nX \nbutton on the top right of the column box. To remove a single field from a column with multiple values, select the \nleft arrow icon \non the right side of that field from within the \nFields \nlist. \nOnce you are done configuring your List View, you can select the \nCopy \nbutton at the bottom of the page in order to copy the List View as a \nSystem \nor \nPersonal View. \nIt is best practice to begin by making a copy, particularly if working from the \nDefault List View, \nin order to not lose changes and to leave the original view as is. \n Remember, making your list view a \nSystem List View \nwill allow other users in your SmartSimple copy to use this list view. Making it a \nPersonal List View \nwill mean that only you have access to it, although you can choose to make it public so that others can view it; further functions, however, cannot be undergone even with a Personal List View that is made public. \n \nSort Order\n \n 1. Click the \nAdd\n button to add rows to the Sort Order.\n 2. Choose a field that the list view should be sorted by, by default. \n 3. Choose the \nDirection\n in which the sort should occur:\n \nAscending\n will sort the selection from A to Z alphabetically or 0 to 9 numerically.\n \nDescending\n will sort the selection from Z to A alphabetically or 9 to 0 numerically.\nNote\n: The \nSort Order\n options only define the \ndefault \nsort order for the list view. The list view can always be re-sorted by using the \nSort By\n feature within the list view.\nExport\nThe \nExport \ntab will display all the functions and options available to users for exporting their list views. A user is able to export a list view with the \nExport button \non the top right of their list view. \n \nEnabling the Export button will allow you to export into \nExcel, \nthe default exporting program. \nIf you want to export into an Internet-specific folder, such as a Configuration or \nSmartFolder\n, you can select that from the drop down menu. You can look up specific folders that currently exist in your SmartSimple system by selecting the \nBinoculars icon. \n \n \n \nUpdate Status After Export: \nEach exported record will be updated to the specific status. \n \nTrigger Workflow After Export: \nEach exported record will trigger the specified workflow. \n For more information: \nWorkflows Overview\n \n \n \nIn the next sections of the Export page, you can customize the settings for exporting to Excel. \nTip: \nThe default settings in the system are normally sufficient. \nNote: \nExcel exportation will \nnot\n maintain personalized formatting done on the \nColumns \ntab, including for instance colour formatting, line breaks where different fields have been included in one cell, and so on. However, once you have exported to Excel, users can freely pivot and customize the formatting on the Excel records. \n If you would like more information on \nMS Excel Settings, \nsee \nPositioning Exported List View Results in your Excel Spreadsheet\n \nMS Word Settings: \nEnter semicolon-delimited list of \nMS Word Merge field names\n (\nfieldname1;fieldname2;fieldname3\n) \nCustom Export Settings:\nCustom Export Setting\nDescription\nHeader\nDefine the text and column settings that will appear above the main body of the exported list view\nRecord Template\nDefine the columns from within the list view that are to be exported\nFooter Template\nDefine the text that will appear below the main body of the exported list view\nDefault Filename\nDefine the name of the exported file\nExport Values Only\nWill strip out any formatting (ex: commas, currency, decimal places) associated with the selected field\nQuick Edit\nThe quick edit tab allows you to enable particular fields for \nQuick Edit\n, allowing users using the list view to edit fields on a record directly. \n \nConfiguration - Advanced\nCombining Filters and List Views\nFilters\n are created through \nAdvanced Search\n functionality. You are able to use detailed operators that can restrict the search results of a list view: for example, you can drill down list views by status or type, by numeric or alphanumerically created conditions, and so on. The combination of these search conditions are called a \nFilter \nand can be saved into the system for permanent use - either in another search for your own use, for combining with list views, or for the availability of other users who may benefit from seeing the results of your specified conditions. \nTo combine filters with a specific list view, simply enter the \nConfiguration Mode \nof a list view. See \nAccessing the List View Configuration Page\n if you need to learn how to access the configuration mode of a list view. \n Filters must be first created through Advanced Search prior to combining them into a list view. \nUnder the \nProperties \ntab of the list view configuration page, click into the text box labelled \nFilter Option, \nwhich will allow you to choose from all of the available system list views.\nAfter you have selected your filter, press \nSave. \n(You may also \nCopy \nthis Filter + List View combo as a system or personal list view, if you wish to.) \nWhen you access a recordset with this list view, you will now see that the filter appears already populated in the Advanced Search box and that those fields are not further editable. \nGlobal Settings - System Filters\nBy looking into the \nSystem Filters \nsection of the system in the \nSystem Administrator\n role, you are able to pinpoint exactly where \nfilters\n are being used on list views. You are also able to edit the filters associated with particular list views at once by clicking into the List View Name and using the \nEdit Filter \nfield. \nThis area of the system is extremely useful as it can inform a SysAdmin if a list view is external facing and the impact on users in changing or deleting the list view. Similarly, before deleting filters it is best practice to know where they are kept in the system, which users have access to them, if they are in use on a portal, etc. \n Deleted filters or list views cannot be restored; they must be entirely rebuilt. \nTo reach the \nSystem Filters section, \nfollow these steps: \n1. Click the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nConfiguration, \nselect \nGlobal Settings.\n3.. Under the first tab, \nSystem, \nand the subheading \nSystem Configuration, \nselect \nSearch Filters.\n \n4. Above the list of filters is a look up box titled \nShow Filters For. \nBy clicking into this, you can toggle between which system list views you would like to know the filters for. You may choose between specific UTA list views (which will then be further subdivided by Levels), overall user list views, organization list views, or transaction list views. \n \n5. Clicking the \nName \nof a filter will open a modal window that allows you to \nEdit Filter.\n \nThe window will display the filter name, the associated filter that can be edited, and the associated list views. \n Clicking on the \nEdit Filter \nbutton will bring you to the list view page and the advanced search box that has the filter components. \n Clicking on any of the \nAssociated List Views \nwill bring you to the specific list view in \nConfiguration Mode. \nBatch Update Buttons\nFor more information on Batch Update Buttons, see \nBatch Update\n. \nOn list views related to \nUniversal Tracking Applications\n (that is - \nnot\n Organizations or Contacts List Views, like those we have been working with), \nBatch Update Buttons \ncan be enabled. Once you are in configuration mode for a List View, you will see a fifth tab on the menu that will allow you to create Batch Update Buttons. Clicking on this menu will open up a list of available Batch Update buttons. To create a new button, click the \n+ \nicon. \n \nThe criteria to define for each button is explained below: \nDisplay Order\nThis determines the position at which the Batch Update button will display in the drop down list of available Batch Update buttons. A lower numerical amount (ex: 1) will ensure that this specific Batch Update button appears first on the list.\nButton Type\nBatch Update \n- This will enable an option to mass update all selected records at once.\nCopy \n- This will create a duplicate copy of the information of selected records.\nButton Name\nProvide a name for your button. \nEx: \nThe name for a button that changes the status for grant applications from submitted to approved can be appropriately named \nApproved. \nButton Label\nProvide a label for your button; typically, it is the same as the name. \nIcon\nAn icon is extremely useful to draw attention to the button and to communicate its use to users. \nEx:\n A dollar sign icon for an \nApproved \nbutton for grant applications. \nDescription\nAlways write a brief description so that other System Administrators and users can understand the functionality of the button. \nView Roles\nThis criteria is particularly important as it will determine who is able to access this button when on the specified List View. Clicking into the text box for \nView Roles \nwill allow you to select which \nroles\n would be able to view the Batch Update button.\nOption\nSelect from a number of types of what you want your button to perform. A common use case is for the \nOption \nfunction to depend on \nStatus - \nfor example, on a List View of grant applications, this Batch Update button will change the status of all selected records at once.\n Other options: Archiving, updating \nCustom Fields\n to predefined or custom values on either common or Type-specific fields, etc\nValue\nThe value corresponding to the option that you have chosen for your Batch Update button. For example, if your \nOption \nfunction was \nStatus, \nthen your \nValue \nwould be chosen from a list of available statuses in your system, such as \nApproved, Declined, Submitted,\n and more. \nOn other list views (such as for Organizations and Contacts, rather than \nUniversal Tracking Applications\n, you will see an icon to the top right of the list view that enables \nBatch Updates. \n \nIf using \nStatus\n for your Batch Update button, once you save the button an option for writing a confirmation message will appear. This is not mandatory, but often helpful for users as they can see the batch update progress and confirmation at the top of the screen, but may not be aware of the ramifications: leaving a note on the function of the button will help them decide whether they want to use the Batch Update button or not. Batch Update buttons work based on \nRole Based Security\n. \nNotes\n:\n Batch update functionality can also be used to run template formulae, but will override all logic restrictions and trigger workflows\n Batch update buttons are available on \nUTAs\n of all levels\n If there are automated processes that may be triggered by a batch update, best option is to open any affected record when in the \nSystem Administrator\n role and select \nOptions\n >> \nWorkflow History\n to view the process of triggers.\n If ever in doubt, run the Batch Update Button on your \nBackup Server and Testing Instance\n. It is best practice, although not mandatory, for Batch Update buttons to provide one valid progression - e.g. a list view with a predefined filter of all applications in pending approval status, where the last step is to approve them simultaneously and for all notifications to go out at the same time.\nEnabling Batch Update Permissions\nUsually, batch update is permitted to users in a \nSystem Administrator\n role. There might be another role that should have the batch update function available to them, such as the Program Manager specific to a \nUTA\n for programs. \nTo enable batch update permissions for UTA List Views, you must go to the specific \nUTA\n. \n1. Click the 9-square menu icon on the top right of your screen.\n \n \n2. Under \nApplications, \nclick to the specific UTA you are looking for, or find it under \nConfiguration \n>> \nTracking Applications. \n3. Select the \ncog icon \nat the top if you are on the specific UTA's page, or select the \npencil icon \nnext to the specific UTA if you are on the \nTracking Applications \nlist. \n \n \n \nOR \n \nBoth methods will display the details of that UTA. \n4. Under the tab \nSecurity, \nselect \nFeature and Function Permissions. \n \n 5. The ability to enable batch update for certain roles should appear as the first line. Click into the text box in order to look up which roles in the system you would like to make the Batch Update functionality available to. Remember, best practice is to only make this function available to \nSystem Administrators\n. \n \n 6. Click \nSave.\nTo enable Batch Update Permissions for Organizations and Contacts List Views:\n1. Click the 9-square menu icon on the top right of your screen.\n \n2. Under the heading \nConfiguration,\n select \nGlobal Settings\n.\n3. Under the tab \nSecurity,\n select \nSystem Feature Permissions\n.\n \n4. The Enable Batch Update option should be listed first.\n \nClick into the text box in order to look up which roles in the system you would like to make the Batch Update functionality available to. Best practice is to make this function only available to System Administrators.\n6. Click \nSave\n.\nGroup Email\nThe \nGroup Email \nfunction is available for List Views and must be separately enabled.\nThe group email function is helpful because it gives you the ability to send batches of information to an assigned group in a pre-branded template - including attachments - in a single step, without having to re-enter information for each individual recipient. \nThis can be done for individual records by selecting the roles within a record you'd like to communicate with, and can be sent from almost any screen within a record where there's a list of contacts.\nChoose the specific records, contacts, or organizations under the group email option and the template you'd like to use. You also have the option to include attachments as required.\nOnce you have everything set up, you can preview the email before hitting \nSend. \nRemember, the default \"from\" email address will be from the particular administrator logged in as the sender, but that can be easily changed under \nGlobal Settings >> Security >> Email Settings. \n \nGroup Email for Organizations and Users List Views\n1. Click the 9-square menu icon on the top right of your page.\n \n \n2. Under \nConfiguration, \nselect \nGlobal Settings.\n3. Under \nSecurity, \nselect \nEmail Settings. \nEmail Settings\n have a number of functions and options.\nSecurity\nEnable Role Restrictions \n- Define which \nroles\n are able to end to other roles, and restrict the type filtering used when searching for recipients\nDisable From Address -\n Managers are only able to set the From address field to a value other than their own email address\nRecipients Under Association Company\n - Allow \nassociated\n users to be recipients to an email\nEnable on Behalf Of - \nSend emails from csr360@smartsimplebk.com on behalf of the From Address specified\nEnable Reply-To - \nSend emails with Reply-To set to the From Address specified\nEnable Default From Address - \nThis email address will be set as the default From Address when composing an email\nEmail Broadcast Manager Roles\nSelect which roles are able to have manager permissions for emails. These permissions include the disabling or changing of the From Address for emails and more. \nRestrict Email Access\nSelect which roles do not have email access for your SmartSimple system.\nRestrict Instant Message Access\nSelect which roles do not have \ninstant message\n access for your SmartSimple system.\nFailed Email Alert\nWrite the default failed email alert template, including the From and To Address, the subject name, the body content, and the frequency. \nGroup Email for UTA List Views\nGroup Email \nfor UTA List Views must be enabled from the specific UTA itself. \n1. Select the UTA that you want to enable Group Email for from the 9-square menu icon. \n3. Once the UTA records are displayed, select the \ncog icon \non the top of the UTA page to enter \nConfiguration Mode.\n \n4. Once you are in \nConfiguration Mode, \nselect the tab \nSecurity.\nNote: \nIf you want to set Email Role restriction, toggle on the \nEnable Email Role Restriction \nfeature. This means that on the current UTA records, users can only email those who their role allows. This is set in conjunction with \nRoles and Security Settings\n. \n \n \n 5. To \nEnable Group Email \nfor that UTA, select \nFeature and Function Permissions.\n \n \n6. Going on the second tab (labelled differently depending on the \nLevel 1 Entity\n for that UTA), scroll down until \nEnable Group Email. \n \n The \nquestion mark icon \nnext to the title will give you tips on how to use Logic, should you wish to configure Group Email through that route.\n The \nRole \ntext box will allow you to click in and select which roles will have \nGroup Email \nfunctionality for that UTA.\n7. Click \nSave. \nFor \nLevel 2 Entities\n (and Level 3 or higher), this feature can be enabled following the same process. Simply click onto the next tab, which will be labelled differently depending on your UTA.\nSending a Group Email\nOnce you have enabled Group Email permissions either on a specific UTA or for specific roles for Organizations and Users List Views, the group email icon should now appear when you access that list view.\n \nIf no records are specifically checked, the system will assume this function should apply for all records.\nClicking on this icon will open up a modal window to allow you to check which user roles should act as recipients.\n \nAfter selecting which user roles should act as recipients, click \nNext\n.\nThe Template and Modify Message window will appear.\n \nHere, you can click into and modify the \ntemplate\n, From Address, CC Email Address, Subject, and Attachment fields.\nYou can also modify more advanced options for the group email, including whether you would like to save the email as an Event, whether you want to add unique recipients, and whether you want the formatting for the email body to be in HTML or plain text. The preview will appear below.\nFor more information, see the \nGroup Email\n page and the \nEmail Category\n pages. \nConfiguring Interactive List View Charts\nSmartSimple empowers you to create \ndynamic \nand \nimpactful \ncharts directly from your current list view without needing to use Report Builder. This feature provides the ability to see the data as tables or charts, as well as being able to drill down into the data for a more granular view. \nList View Charts instantly aggregate your data without any need to re-input information. \nFor example, if you are a Grants Manager program, you might choose to see grants aggregated by status represented in a chart - you can then drill into the charts to see the grants of a specific status further aggregated by type, then flip the view to table and click directly into a specific grant. \nFeatures of List View Charts: \n Immediately downloadable in .png, .jpeg, .pdf, or .svg\n 7 descriptive and colourful chart types available\n Chart by status, type, or another value of your choice\n Toggle easily between chart and table view \n Can go directly into the object from a table view\n Eliminates need for reporting processes \n Great for granular views of data \n Useful for on-the-fly presentations or meetings \n \nHow to Configure Interactive List View Charts\nIf your list view does not already exist, then create a list view with the data that you want to chart. Depending on what type of data you would like to visualize (ex: contact information, grants information, etc) then you can access the configuration mode of list views from various parts of the system. See \nAccessing the List View Configuration Page\n for a table of how to access different list views for configuration.\nIf you do not know how to make a list view, see \nList View Overview#Configuring List Views\n for an explanation of all the different functions available with list views.\nThe list view of a UTA \nLevel 1 Entity\n is shown below.\n \nNote\n: If your list view is only going to be used for charts, check \nConfiguration Only\n at the bottom of the \nProperties\n page. This feature hides this list view from the \nView\n list, but you can still pick it to view when configuring a \nportal\n.\n \nAfter configuring your list view, click the \nSave\n button so that it is stored in the system.\n1. Next, click the 9-square menu icon on the top right of your page.\n \n2. Under the heading \nConfiguration'\n, select \nRoles & Security.\n3. Select \nUser Roles.\n4. Select the \nEdit\n button (pencil icon) next to the desired role whose portal you want to display your chart on.\n \nNote\n: You can tell if a user role has their \nportal\n activated if there is a black dot aligned with the portal column.\nNote\n: The first row, \nCommon,\n is the option to modify the menu and portal items for all users rather than to undergo this process based on role-specific functionality. The common portal is beneficially used for basic menu items that do not have advanced security permissions or role-based visibility.\nThe \nPortal \nconfiguration will be displayed as a tab on the left side menu. If this tab does not automatically appear, ensure that your \nAdvanced Options \n(top right of page) is toggled on, and click \nSave \nto refresh the side menu. \n \n \n5. On the role's portal page, select the \n+\n icon under the heading \nMain Menu.\n This will create a new component for the main page that this role sees.\n \n6. Fill out the caption and description of the main menu item you want to add. When selecting \nContent Type,\n ensure that you select the \nSections\n option. All other content type options will not allow you to create an interactive chart.\n \n7. After clicking \nSave,\n a new heading titled \nSections\n will appear below. Click the \n+\n icon to create a new section.\n \n8. This will bring you to a page to fill out regarding the section containing the list view you want to appear as an interactive chart. Fill in the name and other details, but ensure that your \nType\n is selected as \nChart.\n Click \nSave\n.\n \n9. The chart settings will appear at the bottom of the page.\n \nChart Setting\nDescription\nChart List View\nClick into the text box in order to select from the available system list views to display in chart form.\nChart List View Filters\nClick into the text box in order to select from the available system list view filters that will modify what data is displayed in chart form.\nChart Title\nPopulate the chart title - go with a naming convention that concisely describes what the chart is visualizing (ex: Grants Funded by Amount).\nThe title will appear on the rendered chart above the visualization of data.\nChart Type\nSelect the chart type you wish to use. The current options include: \n Bar\n Horizontal Bar\n Pie\n Donut\n 3D Bar\n 3D Pie\n 3D Donut\nX-Axis\nSelect the list view column that should appear as the x-axis of the chart. The columns available are the \nStandard Fields\n associated with that list view.\nY-Axis\nSelect the list view column that should appear as the y-axis of the chart. The columns available are the \nStandard Fields\n associated with that last view.\nNote: \nIf the Aggregation Type is Sum or Average, then the y-axis \nmust\n be a numerical value.\nX-Axis and Y-Axis Label\nProvide appropriate labels for the x-axis and the y-axis. These labels will appear rendered on the chart next to the respective axis.\nAggregation\nSelect the aggregation type from the available options: \n \nSum: \nProvide a sum of all values in the column selected as the y-axis for each grouping defined in the column selected in the x-axis.\n \nAverage: \nProvide an average of all values in the column selected as the y-axis for each grouping defined in the column selected in the x-axis.\n \nCount: \nProvide an overall count of records for each grouping defined in the column selected in the x-axis.\n \nNone: \nNo aggregation of data will be displayed. \nEnable View Options\nToggling on Enable View Options will allow the user to choose explicitly between which views he wants to see the data in (list, table, chart, etc). \nToggling on this option will allow another option, \nShow Search Panel on List View, \nto appear. Toggling on Search Panel will allow the user to use \nBasic Search\n and \nAdvanced Search\n on the list view they access from the chart.\n10. When you are done configuring your interactive list view chart, click \nSave. \nPreview the portal in order to ensure that the chart appears correctly. \nUsing the Interactive List View Chart\nWhen you enter the SmartSimple system from a user account associated with a specific role, the first page that you enter into is the role-based portal. (Alternatively, it could be the Common Portal if the system is configured using the Common Portal, or there may be elements from the Common Portal alongside elements of a role-specific portal.) \nThe interactive list view charts, if they are configured, will appear on the portal. \nIn the below example, a \n3D Pie \nChart using list view information of grants by state is shown on the portal. \n \nYou can enter into a record by clicking its column/slice (depending on which Chart Type is displayed). This will open a list display of all the associated records in that column.\nTo further utilize the interactive list view chart, simply click on the icon buttons that appear on the top right of the visual.\n \n \nThe left button allows you to \nView All Data \nin the standard list view. The right button allows you to view the data as a \nTable.\nClicking on the \nView All Data Button \nwill open new buttons in the list view format. If you select a record, or several records, more buttons will appear that have the same functionality as on a normal list view: batch updates, delete, send email, etc. The outer two buttons will always allow you to toggle between \nTable View \nand \nChart View. \n \nOn the left side of the interactive chart is another \nthree line icon \nthat, when clicked, will give options for \nprinting \nand \ndownloading \n(as .png, .jpeg or .svg image, or as PDF document).\n \nInteractive List View Chart Types\nThe different view types for how the information from the Interactive List View Chart is displayed are visually shown below: \n \nChart\n: Displayed as a chart (\nChart Type - Bar) \n \n \nList View\n: Displayed as a basic list  view. \n \n \nTable\n: Displayed as tabular data.\n \n \nHelpful Tips with List Views\nMaking List View Searches Faster\nSome common tips for reducing the load time on a list view when performing searches are:\n Instead of searching “All Columns”, search a specific column (field) by using the column selector dropdown.\n Reduce the amount of columns displayed in the list view. Less columns are easier to read and digest (7 - 8 columns or less is recommended for ideal usability).\n Add specific status/type filters (only search for records of a specific status and type).\n Archive older records that may not be relevant.\n Avoid \nDisplay Text and Variable\n fields in list views. You can pull organization and user information directly into the list view without using display fields.\n If you have a lot of records and you don’t need sorting, counts, or real time results, you can turn on the \nEnable Quick Load\n feature located in the list view settings.\n Adjust the Personal Setting called \nList View Records Per Page\n. Example \n20\n records will load faster than \nAll\n records.\nAccessing the List View Configuration Page\nMost list views can be edited on the fly, by clicking the \nwrench icon \nnext to the name of the list view.\n \nClicking the wrench will bring you to the \nconfiguration\n page for that record. \nBelow is a guide for the alternate methods of accessing the configuration pages for the list views of various \nentities\n. \nThe nomenclature of your headings may differ depending on your SmartSimple instance. For example, the tab names of Level 1 entity settings will differ depending on the purpose of your UTA. Level 1-3 Entities normally fall in chronological left to right order after the General tab when you are accessing the Configuration Settings of a UTA. \nTo Configure the List View For:\nGo to: \nContacts, System-Wide\nGlobal Settings\n > \nUser\n > List Views \nOrganizations, System-Wide\nGlobal Settings\n > \nOrganizations\n > List Views\nLevel 1 Entities\n within a \nUniversal Tracking Application\n1. Go into the Configuration Settings of a UTA (\ngear icon\n) \n2. Choose the List Views hyperlink under the Level 1 Settings tab \nLevel 2 Entities\n within a UTA \n1. Go into the Configuration Settings of a UTA (\ngear icon\n) \n2. Choose the List Views hyperlink under the Level 2 Settings tab \nLevel 3 Entities\n within a UTA\n1. Go into the Configuration Settings of a UTA (\ngear icon\n) \n2. Choose the List Views hyperlink under the Level 3 Settings tab \nAssociations\nGlobal Settings\n > \nAssociation Settings\n > List Views\nWorkflow Requests\nSee \nWorkflow Requests List View\n \nTransactions\nGlobal Settings\n > Transactions > List Views\nUsing Reports vs List Views\nWhen is it appropriate to use a List View, and when is it appropriate to build a report? \nA \nreport\n is needed if your situation includes\n at least one\n of the following criteria: \n You need more than 30 columns\n You need formula or calculations\n You need more complex aggregations, than a simple total (e.g. count distinct, minimum, maximum, sum, group by, total by)\n You need an \nOData connection\n or you need to link multiple datasets that are not automatically connected (e.g. multiple \nUTAs\n)\nNote:\n \nReports\n are more sensitive because: \n only 5 criteria are permitted compared to limitless criteria on a List View\n requires more knowledge of SQL and reporting (although fine if a user is familiar with MS Access or Tableau, as it uses the same principles)\n less dynamic\nFor more insight into the functionality of list views and reports within \nSmartSimple\n, please see our \nList View and Reports - Why?\n page. \n  \nSearch Panel Options\n      \nDetermining the Application Tabs Displayed to the User\n  \nSee Also\n \nPortals\n \nReports\n \nList View and Mixed Record Type\n \nPreparing Existing Word Template for List View Export\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=List_View_Overview&oldid=41038\n’",
  "links": [
    "https://wiki.smartsimple.com/wiki/Standard_Field",
    "https://wiki.smartsimple.com/wiki/Custom_Fields_Overview",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Filter",
    "https://wiki.smartsimple.com/wiki/Download_files_from_List_View",
    "https://wiki.smartsimple.com/wiki/Exporting_List_View_Results_to_Microsoft_Excel",
    "https://wiki.smartsimple.com/wiki/Exporting_List_View_Results_to_Microsoft_Word",
    "https://wiki.smartsimple.com/wiki/Portals",
    "https://wiki.smartsimple.com/wiki/Backup_Server_and_Testing_Instances",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Sort_By",
    "https://wiki.smartsimple.com/wiki/Basic_Search",
    "https://wiki.smartsimple.com/wiki/Advanced_Search",
    "https://wiki.smartsimple.com/wiki/Sort_by",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/SmartCard",
    "https://wiki.smartsimple.com/wiki/List_View_Overview#Enabling_Batch_Update_Permissions",
    "https://wiki.smartsimple.com/wiki/List_View_Overview#Batch_Update_Buttons",
    "https://wiki.smartsimple.com/wiki/Restoring_Deleted_Records",
    "https://wiki.smartsimple.com/wiki/SmartFolders",
    "https://wiki.smartsimple.com/wiki/List_View_Overview#Export",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/Portals",
    "https://wiki.smartsimple.com/wiki/Reports",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Display_order",
    "https://wiki.smartsimple.com/wiki/Display_order",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/Advanced_Search",
    "https://wiki.smartsimple.com/wiki/Quick_Edit",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/List_View_Overview#Properties",
    "https://wiki.smartsimple.com/wiki/Sort_By",
    "https://wiki.smartsimple.com/wiki/Workflows_Overview",
    "https://wiki.smartsimple.com/wiki/Positioning_Exported_List_View_Results_in_your_Excel_Spreadsheet",
    "https://wiki.smartsimple.com/wiki/Quick_Edit",
    "https://wiki.smartsimple.com/wiki/Filter",
    "https://wiki.smartsimple.com/wiki/Advanced_Search",
    "https://wiki.smartsimple.com/wiki/List_View_Overview#Accessing_the_List_View_Configuration_Page",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Filter",
    "https://wiki.smartsimple.com/wiki/Batch_Update",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Role_Based_Security",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Backup_Server_and_Testing_Instance",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Global_User_Administrator",
    "https://wiki.smartsimple.com/wiki/Email_%26_Email_Broadcast_Security",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/Association_Settings",
    "https://wiki.smartsimple.com/wiki/Using_Instant_Messaging",
    "https://wiki.smartsimple.com/wiki/Roles_and_Security_Settings",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Level_2_Entity",
    "https://wiki.smartsimple.com/wiki/Creating_Message_Templates",
    "https://wiki.smartsimple.com/wiki/Group_Email",
    "https://wiki.smartsimple.com/wiki/List_View_Overview#Accessing_the_List_View_Configuration_Page",
    "https://wiki.smartsimple.com/wiki/List_View_Overview#Configuring_List_Views",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Portals",
    "https://wiki.smartsimple.com/wiki/Portals",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Standard_Fields",
    "https://wiki.smartsimple.com/wiki/Basic_Search",
    "https://wiki.smartsimple.com/wiki/Advanced_Search",
    "https://wiki.smartsimple.com/wiki/List_View_Overview#Configuring_List_Views",
    "https://wiki.smartsimple.com/wiki/Entity",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/User_%26_Contact_Settings",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Company_%26_Account_Settings",
    "https://wiki.smartsimple.com/wiki/Level_1_Entity",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/Level_2_Entity",
    "https://wiki.smartsimple.com/wiki/Level_3_Entity",
    "https://wiki.smartsimple.com/wiki/Associations",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Association_Settings",
    "https://wiki.smartsimple.com/wiki/Workflow_Requests_List_View",
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Odata_Overview",
    "https://wiki.smartsimple.com/wiki/Universal_Tracking_Application",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/List_View_and_Reports_-_Why%3F",
    "https://wiki.smartsimple.com/wiki/Search_Panel_Options",
    "https://wiki.smartsimple.com/wiki/Search_Panel_Options",
    "https://wiki.smartsimple.com/wiki/Determining_the_Application_Tabs_Displayed_to_the_User",
    "https://wiki.smartsimple.com/wiki/Determining_the_Application_Tabs_Displayed_to_the_User",
    "https://wiki.smartsimple.com/wiki/Portals",
    "https://wiki.smartsimple.com/wiki/Portals#List_View_and_Mixed_Record_Type",
    "https://wiki.smartsimple.com/wiki/Adding_Form_Fields_to_a_MS_Word_Document#Preparing_Template_for_List_View_Export"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/c/c1/ListViewExample.png",
    "https://wiki.smartsimple.com/images/7/7c/Alphabetical_order.png",
    "https://wiki.smartsimple.com/images/8/87/Basic_vs_advanced_search.png",
    "https://wiki.smartsimple.com/images/c/c8/Listviewoptions_button.png",
    "https://wiki.smartsimple.com/images/6/65/Listviewoptions_list.png",
    "https://wiki.smartsimple.com/images/2/21/List_view_buttons.png",
    "https://wiki.smartsimple.com/images/b/b3/ChangeListViews.png",
    "https://wiki.smartsimple.com/images/5/5f/PeopleList.png",
    "https://wiki.smartsimple.com/images/9/9e/Organization_List.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/6/6e/Config_settings.png",
    "https://wiki.smartsimple.com/images/7/7f/Listview_settings.png",
    "https://wiki.smartsimple.com/images/d/d9/Default_list_views_menu.png",
    "https://wiki.smartsimple.com/images/8/82/Display_Properties.png",
    "https://wiki.smartsimple.com/images/0/0b/Split_screen_icon.png",
    "https://wiki.smartsimple.com/images/a/a6/Download_files_button.png",
    "https://wiki.smartsimple.com/images/5/5a/Columns_List_View.png",
    "https://wiki.smartsimple.com/images/e/ee/List_view_configuration.png",
    "https://wiki.smartsimple.com/images/c/c1/Insert_to_current_column.png",
    "https://wiki.smartsimple.com/images/7/73/Insert_to_current_column_2.png",
    "https://wiki.smartsimple.com/images/5/57/Copybutton_for_list_view.png",
    "https://wiki.smartsimple.com/images/9/99/Sort_order_for_list_views.png",
    "https://wiki.smartsimple.com/images/0/04/Export_button.png",
    "https://wiki.smartsimple.com/images/6/65/Enable_export.png",
    "https://wiki.smartsimple.com/images/1/1d/Excel_export_settings.png",
    "https://wiki.smartsimple.com/images/1/13/Quick_edit_for_list_viw.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/a/a8/Search_filters.png",
    "https://wiki.smartsimple.com/images/9/93/Show_filters_for.png",
    "https://wiki.smartsimple.com/images/9/90/Edit_filter.png",
    "https://wiki.smartsimple.com/images/7/7b/Batch_update_buttons.png",
    "https://wiki.smartsimple.com/images/3/3a/Batch_update_button.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/6/6e/Config_settings.png",
    "https://wiki.smartsimple.com/images/d/dc/Edit_buttons.png",
    "https://wiki.smartsimple.com/images/0/0c/Feature_n_function_permissions.png",
    "https://wiki.smartsimple.com/images/7/72/Enable_batch_update_permission.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/d/db/Sys_feature_permissions.png",
    "https://wiki.smartsimple.com/images/7/72/Enable_batch_update_permission.png",
    "https://wiki.smartsimple.com/images/a/ab/Email_from_address.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/6/6e/Config_settings.png",
    "https://wiki.smartsimple.com/images/e/e5/Screenshot_32.png",
    "https://wiki.smartsimple.com/images/0/0c/Feature_n_function_permissions.png",
    "https://wiki.smartsimple.com/images/9/9e/Screenshot_33.png",
    "https://wiki.smartsimple.com/images/6/6c/Group_email_icon.png",
    "https://wiki.smartsimple.com/images/9/9f/Group_email_step_2.png",
    "https://wiki.smartsimple.com/images/c/cb/Group_email_template.png",
    "https://wiki.smartsimple.com/images/d/d3/Interactive_List_View_Charts.gif",
    "https://wiki.smartsimple.com/images/e/e0/Ichart-list-view-column.png",
    "https://wiki.smartsimple.com/images/f/f0/Ichart-list-view-properties.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/5/55/Portal_activated.png",
    "https://wiki.smartsimple.com/images/2/2d/Portal_side_menu.png",
    "https://wiki.smartsimple.com/images/d/d9/Add_main_menu_portal.png",
    "https://wiki.smartsimple.com/images/3/3e/Sections_portal.png",
    "https://wiki.smartsimple.com/images/5/58/Add_section_portal.png",
    "https://wiki.smartsimple.com/images/4/4b/Add_chart_portal.png",
    "https://wiki.smartsimple.com/images/f/f3/Chart_settings.png",
    "https://wiki.smartsimple.com/images/9/99/Portal_pie_chart.png",
    "https://wiki.smartsimple.com/images/7/7f/List_view_view_options.png",
    "https://wiki.smartsimple.com/images/f/fd/List_view_options.png",
    "https://wiki.smartsimple.com/images/8/80/Portals_print.png",
    "https://wiki.smartsimple.com/images/e/e8/Ichart-list-view-defaultChart.png",
    "https://wiki.smartsimple.com/images/c/c3/Ichart-list-view-defaultLV.png",
    "https://wiki.smartsimple.com/images/5/5a/Ichart-list-view-defaultTable.png",
    "https://wiki.smartsimple.com/images/1/1c/Edit_list_viewes.png",
    "https://wiki.smartsimple.com/images/c/ca/Previous.png",
    "https://wiki.smartsimple.com/images/c/c4/Next.png"
  ]
}