{
  "url": "https://wiki.smartsimple.com/wiki/Login_Page#Privacy_and_Security_Policies",
  "title": "Login Page",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguration - Essentials\n2.1\n \nCreating a New Login Page\n2.2\n \nLogin Page Branding\n2.3\n \nMultiple/Switching Languages\n2.4\n \nCreating a Routing Page\n2.5\n \nAgreeing to Cookies\n2.6\n \nPrivacy and Security Policies\n2.7\n \nForgot Password\n3\n \nConfiguration - Advanced\n3.1\n \nCAPTCHA on the Login\n3.2\n \nPopup Blocker Check\n3.3\n \nAlternate Login Pages\n3.4\n \nFailed Login Log\n4\n \nSettings Explained\n4.1\n \nGeneral Tab\n4.1.1\n \nPrivacy Policies\n4.1.2\n \nLinks\n4.1.3\n \nPage Formatting\n4.2\n \nRouting Page Tab\n4.3\n \nTemplate Tab\n5\n \nAlternate Login Page Settings\nOverview\nThe Login page allows a user to gain access to your SmartSimple System. The user will authenticate on this page, typically by entering a username and password. You will need \nGlobal Administrator\n access to setup or edit login pages.\nThe login page is used to:\n Authenticate the user\n Switch languages\n Direct people to a \nsignup page\n via the (routing page)\n Ask the user to accept the use of cookies\n Enforce agreement of your systems \nprivacy and security policies\n.\n Reset your password\nThis article will show you how to setup and modify login pages within your system and we will look at other related settings.\n \nIn the above example the login section and the language drop down that enables you to switch to the other language specific login pages are both highlighted.\nConfiguration - Essentials\nCreating a New Login Page\n1. Click on the \nMenu\n icon on the top right of your page.\n2. Select \nGlobal Settings.\n3. Click on the \nBranding\n tab.\n4. Click on \nLogin Pages.\n \nThe link to create and edit login pages.\n5. The list of login pages available in your system will be displayed under the \nPrimary\n tab; if there are none, the list will be empty.\n \nThe list of login pages.\n6. Staying on the \nPrimary\n tab, click the \nNew Login Page\n button which looks like a \n+\n icon in the action bar to create a new Login Page.\n \nThe new login page button.\n7. Select the desired language\n8. Modify the settings on the \nGeneral\n tab as needed and press \nSave\n.\nLogin Page Branding\nThere are several settings under \nPage Formatting\n to control the look of the background image and its positioning. Note, background images should be something generic like a solid block of color, a pattern or photo. Avoid graphic elements like logos that must be visible as the same image will be used across all devices, screen sizes and both in portrait and landscape so clipping will occur. The recommended dimensions of background images are 1920 x 1280 with 72 pixels per inch (PPI). You can also adjust the opacity and color of the panel.\nMultiple/Switching Languages\nAdministrators may create a separate login page for each language they want to support. Administrators will choose the desired language for a login page when they create a new login page.\nIf you have more than one language login page, the user will see a select one drop down in the top right of the screen as long as you have set the \nPage Layout\n setting to \nDefault\n, alternately you may chose \nCustom\n and add the sample template. The user can choose their desired language from this drop down. The language the user chooses will follow through after login. \nIf you choose to have a single login page for all users instead of separate login pages per language, then upon login users will be directed to the language they last chose within the platform.\nAdministrators can choose which language login page is the default via a toggle on the settings page for the desired login page. This determines which language login page will be displayed if a user goes to \nhttps://youralias.smartsimple.com/\n without specifying a language ID.\nYou can also send your users a direct link to a specific language login page by adding \n?&lang=\n to the login page URL. For example the URL to a Spanish login page would look as follows where 14 is the language id\n https://myalias.smartsimple.com/s_Login.jsp?&lang=14\nCreating a Routing Page\nRouting pages are created to direct (guide) the end user to the appropriate page which is typically a \nSignup page\n.\nWhen a user navigates to a login page they will click a button which is typically labeled register on the login page and that will take the user to an intermediary (routing) page where they can see the list of available signup pages.\nRouting pages are recommended if you have:\n Multiple signup pages to register different kinds of organizations and users\n Multiple signup pages for different languages\n Multiple eligibility questionnaires\n \nThe routing page takes users to the signup page that is right for them.\n \nHow the configuration page for a routing page looks.\n \nTo create a routing page\n Go to \nMenu\n Icon > \nGlobal Settings\n > \nBranding\n tab > \nLogin Pages\n link > edit the desired login page > \nRouting Page\n tab.\n Under \nRouting Links\n press the \nAdd Link\n button (looks like a plus sign \"+\") to add a new link.\n For \nTitle\n enter some text to indicate the kind of signup page you will link to. Example Individual, Domestic Organization, International Organization, etc.\n For \nDescription\n enter some text to help people choose the correct signup page. Example, \nFor applicants who are not associated with an organization\n.\n For \nURL\n enter the URL to your signup page or use the \nURL Lookup\n to find it. If you paste the Page URL of your signup page into a routing page, make sure you use the relative path. Relative paths will resolve correctly and work on production as well as development and backup Environments. Example: \n/s_csignup.jsp?token=XVtQHUUGYVpQRhRRXxNRS1BWZEl2HnFsFA%3D%3D&ptoken=XVtQC1oGYVpQRhRRXxNRS1BWZEl2HnFsFQ%3D%3D\n Press \nSave\n.\nAgreeing to Cookies\nCookies are small pieces of data stored on a user’s computer by their browser.\nDepending on your jurisdiction you may be required to notify your users of the use of cookies.\nLearn more about cookies and the EU cookie directive in this \nWikipedia article on cookies\n.\nThe first time a user comes to your system they will be presented with an alert explaining that SmartSimple Cloud uses cookies. It also states that by using the system they are consenting to the use of cookies. The user can click \nOK\n to accept or navigate away. There is also a link to a longer description which explains what cookies are being used and why.\n \nThe Cookies acceptance alert shown to all users first time they visit your system.\nPrivacy and Security Policies\n \nMain Article: \nConfiguring Privacy, Confidentiality and Other Policies\n:\nWithin your system you will need to set up Privacy and Security Policies. You will set these policies up for several language and country combinations. Typically, a privacy policy will say what type of information you collect, why it is collected, how it is collected , what you will use the information for, who will have access to the information, how users will be notified of changes to the policy and who to contact regarding privacy concerns.\nBy default, the login page will have a button called \nPrivacy & Security Policies\n in the main panel below the email and password inputs. This link will display any policies you have set up for the \nDefault Country\n (default country is a privacy country option that is generally used for all countries if the user has not logged in or if there are no country-specific policies). After the user has logged in, and if the user has a country specified in their profile then the user will be able to see their specific countries/language policies in the header if they have been configured.\nIf you have chosen a date for \nEnforce User Acceptance\n the user will be brought directly to your policies upon login and the user will be forced to accept the policies in order to use the system. A record of that acceptance is also recorded and retrievable.\nIf you are using \nDefault\n for the \nPage Layout\n setting, you also have the option to \nHide\n the \nPrivacy Policies\n on the login page.\nForgot Password\nA forgot password link appears by default on the login page.\nUsers can enter an email and the system will email instructions to the user if that email address has been registered and given system access. \nIf you do not receive an email within a few minutes check your spam/junk mail folder.\nThe account recovery email sent to users can be configured by doing the following:\n Go to \nMenu\n icon > \nGlobal Settings\n > \nSecurity\n Tab > \nPassword and Activation Policies\n link > \nActivation Emails\n tab > scroll down to \nPassword reset\n.\n Modify the content as desired.\n Press \nSave\n.\nConfiguration - Advanced\nCAPTCHA on the Login\nIf you enter the wrong email and password into the login page twice you will see a CAPTCHA. CAPTCHA stands for \"Completely Automated Public Turing Test to tell Computers and Humans Apart”. It is used in this case to verify that the user is a person and not an automated program attempting to login.\n \nCAPTCHA displayed after wrong email and password combination entered\nYou can choose Google reCAPTCHA or alternate CAPTCHA or specify alternate CAPTCHA only for users in countries that are unable to communicate with CAPTCHA servers because of government policy. This is done by selecting a country such as China in the \nCountries Using Alternate CAPTCHA Service:\n setting.\nThis setting can be found at \nMenu\n icon > \nGlobal Settings\n > \nSecurity\n tab.\nPopup Blocker Check\nThe login page can be configured to check whether users have a pop-up blocker enabled if you are using a custom page template. If the user does have a popup blocker enabled they will receive a warning with a suggestion that they disable their pop-up blocker.\nTypically we leave this check disabled and do not warn users that they are using a pop up blocker.\n \nWarning message displayed on login page when a pop-up blocker is detected\nIf you choose you can enable this check and warning message by doing the following.\n Go to \nMenu\n icon > \nGlobal Settings\n > \nBranding\n tab > \nLogin Pages\n link > edit the desired login page.\n Make sure \nPage Layout\n is set to \nCustom\n.\n Go to the \nTemplate\n tab.\n Inside the \nLogin Page Template\n text area search for \ndisabled=\"disabled\"\n (If you don't see it add the sample template).\n Remove the \ndisabled=\"disabled\"\n text.\n Press \nSave\n.\nAlternate Login Pages\nThe \nAlternate \ntab from the Login Page list view is used to create and edit multiple custom login pages with a specific instance URL.\nIf you are on the \nAlternate\n tab, when you click the \nNew Login Page\n button that looks like a \n+\n icon in the action bar then you will create a New Alternate Login Page.\nAlternate login pages work differently then Primary login pages, so you can’t reuse the code from the Primary login pages. Alternate login pages also require more customization and the users are required to enter a long url to use these\n https://myalias.smartsimple.com/welcome/MyFolder/?u=1 \nFailed Login Log\nIf a user attempts to log in and fails, you can see a list (audit log) of the user names (the email they entered), their IP addresses, and the time.\nTo see the Failed Login Log go to \nMenu\n icon > \nGlobal Settings\n > \nSecurity\n tab > \nPassword and Activation Policies\n > and click on \nFailed Login Log\n in the left navigation.\nAlso, in the left navigation at this location, you can see locked accounts and other settings related to failed login attempts.\nSettings Explained\nGeneral Tab\nThe following settings are available on the \nGeneral\n tab:\nSetting\nDescription\nLanguage\nEach login page must have a single language which you can select from the dropdown.\nIs Default Login Page\nBy default, when a user goes to your system's URL without the Language ID, they will be directed to the \nEnglish US\n language login page. If you want users to go to a different language login page by default, toggle this setting on for the login page with your desired language. Note: only one login page can be set as the default.\nPage Layout\nLeave this setting on \nDefault\n unless you specifically need to customize the HTML to your login page as it will ensure you will always have the latest and greatest looking login page. If you choose \nCustom\n you will get a \nTemplate\n tab where you can modify the underlying HTML of the login page. Note if you opt to go custom, you may need to manually update your login pages to take advantage of improvements or changes in functionality.\nPage Title\nThis is the title your browser displays on it’s title bar or page tab. This text is used to populate the title tag in the HTML of the login page. Typically your organization's name is entered into this field.\nLogin Title\nText entered here appears above the area where you authenticate. Typically the word \"Login\" is entered into this field.\nContent Title\nText entered here appears above the custom message on the right area of the screen. Typically this is replaced with something like \"Welcome to XYZ\".\nContent Text\nText entered here appears below the content title. Typically this area is used to describe who you are, what you do and what the system is used for. Example: \"XYZ group provides grants to non-profits in the USA. Register to gain access to the system and apply for funding.\"\nLogout Redirect URL\nThis is the page the user gets redirected to once they logout. Enter a URL such as \nhttps://www.smartsimple.com/\n or leave it blank to have the user redirected back to your system’s login page by default.\nPrivacy Policies\nThis section is only visible if you chose a \nPage Layout\n of \nDefault\n.\nSection\nChoose to show or hide the \nPrivacy Policies\n for your system on the login page only.\nSection Title\nThis input only appears if you are using the \nDefault\n page layout with privacy policies on. Typically people enter \"Learn more about our\".\nButton Label\nThis input only appears if you are using the \nDefault\n page layout with \nPrivacy Policies\n on. Enter the name you want to give the button that will open your systems policies that you define. Typically people enter \"Privacy and Security Policies\" for the button text.\nLinks\nThis section is typically used for giving people the ability to self-register and gain access to your system.\nLink Section\nThe \nNone\n option provides no links to a signup page and hides this section. Users cannot self-register and must be created and activated in your system via a different methodology, such as an autoloader, importing or manual creation by internal staff.\nThe \nUse Routing page\n option is best if you have multiple signup pages often for different types of users and organizations. The routing page will display a list of signup pages so the user can be directed to the signup page that is right for them. Learn more about \nrouting pages\nThe \nCustom URL\n option is best if you only have one signup page. If you choose this option you will be able to enter a label for the button such as \"Register here\" as well as the URL to the desired signup page. For the URL use the relative path to your signup page. This way the register button will work on production and backup and any staging servers you may have. Example:\n/s_signup.jsp?token=XVtQC1oGYFFaRhNaXxJaQVBRZEl8GnA%3D\nSection Title\nText entered here appears above the register buttons. Typically the text entered is \"New to the System?\".\nPage Formatting\nThe following settings are available on the \nGeneral tab\n, \nPage Formatting\n section:\nSetting\nDescription\nBackground Image\nThe image uploaded will appear behind the content of your login page (in the background). Upload an image in JPG or PNG format with a resolution of 1920 x 1080 or higher but try to optimize the image to keep the file size low.\nClick the \nBrowse\n button which looks like a folder icon to select a file from your computer and click the \nUpload\n button which has an \nupwards arrow \nto upload the image file.\nBackground Position\nSelect how the image will render at different resolutions by choosing where to anchor the image vertically and horizontally. For example if you choose \nTop\n and \nLeft\n as the position, then the top left area of the background image will always be visible on screen. Anything on the right/bottom of the image may be clipped and not display depending on screen size and aspect ratio of the image and the user's device.\nBackground Color\nAdjust this setting to change the color that will appear over the background image. Enter the desired hexadecimal value here without the # or use the color picker. Example, enter FFFFFF to have a white background. You must enter either 3 or 6 characters if you are manually entering the hexadecimal value.\nBackground Opacity\nAdjust this setting to change the opacity of the background color. For example \nHigh\n will make the color completely opaque and you will not see the background image. \nLow\n will make the background color completely transparent revealing the background image as uploaded. Something in between \nLow\n and \nHigh\n will create a translucent layer of color over the background image.\nPanel Color\nSelect the color of the login panel that appears behind the content such as the username and password but in front of the background color and image. \nPanel Opacity\nSelect the level of opacity for the panel that appears behind the login content such as the username and password. \nLow\n will make the panel transparent, \nHigh\n will make the panel opaque.\nFont Color\nSelect the color used for all text that appears on the panel. Example '\nContent Title, Content Text, Section Title, \n etc. Note you must make sure there is enough contrast between the foreground text and the panel or background image. Typically text is black on a white panel or white on a black panel.\nRouting Page Tab\nThe following settings are available on the \nRouting Page\n tab:\nSetting\nDescription\nPage URL\nThis area displays the direct link to the routing page and gives you a preview button so you can see how the routing page looks without logging out.\nButton Label\nThe text entered here will be used as the label for the button that will open the \nRouting Page\n. This button is displayed on the login page. Typically you will enter the text \"Register\".\nHeader Title\nThe text entered here will appear at the top of the routing page. Typically you will enter something like \"Registration Options\".\nIntroduction Text\nThe text entered here will appear under the title but before the list of signup pages. Typically you will enter something like \"I am applying as:\".\nTrailing Text\nThe text entered here will appear under the list of signup pages. Typically you will leave this blank however you may want to add contact information here in case the user needs assistance.\nRouting Links\nThis dynamic section enables the administrator to add links to their desired signup pages onto the Routing Page.\nTo create a new link, click the \nAdd\n button which has a \n+\n icon.\nEach routing link has the following settings\nSetting\nDescription\nTitle\nText entered here will appear in bold for each link. Typically you would enter a few words like Individual, International Organizations, Domestic Organizations.\nDescription\nText entered here will appear below the title and is used to clarify what kind of user should click this link. Example \"For applicants who are not associated with an organization\".\nURL\nThe relative URL to the desired signup page.\nTemplate Tab\nThe following settings are available on the \nTemplate\n tab:\nSetting\nDescription\nSample Template\nClicking this link inserts the HTML, CSS and other code which is used to render the login page. Typically you would only use a custom template if you wanted to add some functionality that is not typically used or you wanted to radically customize the look and structure of the login page.\nLogin Page Template\nYou can enter your custom code into this text area or modify the existing content added by clicking the sample template link. Although you can enter your own code here we generally don’t recommend it. If you do add your own code here make sure your code meets accessibility guidelines and make sure it is responsive (works on all devices including mobile).\nAlternate Login Page Settings\nSettings from Alternate login pages which are typically only used in special circumstances\nLogin Page Name\nName of the virtual alias login page\nDescription\nDescription of the virtual alias login page that is not exposed to end users.\nScope Organization\nLookup that allows the virtual alias login page to be restricted to users in the selected organization.\nVirtual Folder Name\nEnter a name which will appear in the login URL and be used to differentiate logins.\nWeb Alias\nEnter the desired alias you want instead of using the instance-defined alias.\nPersistent Cookies\nEnable or disable persistent cookies. Rather than having to log into your system each time you open your web browser, a \"cookie\" can be installed on your computer that will automatically authenticate you, allowing you to bypass the login screen and having to re-enter your credentials.\nAttach User Identifier\nEncrypt URL\nEnable or disable the encryption of the URL\nLogout Redirect URL\nEnter URL for users to be redirected to upon logout. If left blank users go to the login page on logout.\nPrimary Role\nSelect from the available system roles to choose the primary default role that a user will have when they log in through this alternate login page. This function is used to force the user to see a specific Role based portal.\nLogin Type\nSelect from the desired options: All Users, Activated Users Only, No Access \nUser Field\nThis is the field that will be used on the login page to uniquely identify the specific user when they log in. This is typically set to \nEmail Address\n.\nPassword Field\nThis is the field on the login page that will be used for the password.\nLogin Error Message\nThis is the error message that will appear on the login page upon a failed login attempt.\nLogin Page Content\nClick the \nInsert Sample Template\n hyperlink to auto-populate the text window with a sample template for a login page. Otherwise, you can insert in your own customized content. Note that the Alternate login page content works differently than primary login pages so you cannot use the same template for both.\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Login_Page&oldid=41873\n’ \nCategory\n: \nInterface",
  "links": [
    "https://wiki.smartsimple.com/wiki/Signup_Page",
    "https://wiki.smartsimple.com/wiki/Configuring_Privacy,_Confidentiality_and_Other_Policies",
    "https://wiki.smartsimple.com/wiki/Signup_Page",
    "https://wiki.smartsimple.com/wiki/Configuring_Privacy,_Confidentiality_and_Other_Policies",
    "https://wiki.smartsimple.com/wiki/Signup_Page#Creating_a_routing_page"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/2/21/Example_of_login_page.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/9/94/Finding_login_pages_branding.png",
    "https://wiki.smartsimple.com/images/3/31/List_of_login_pages.png",
    "https://wiki.smartsimple.com/images/e/e2/New_login_page_button.png",
    "https://wiki.smartsimple.com/images/a/a5/Singup-routing.png",
    "https://wiki.smartsimple.com/images/a/a6/Login-Routing-Page.jpg",
    "https://wiki.smartsimple.com/images/4/4b/Cookies.jpg",
    "https://wiki.smartsimple.com/images/5/5b/Captcha-login.jpg",
    "https://wiki.smartsimple.com/images/9/9c/Popup-blocker.jpg",
    "https://wiki.smartsimple.com/images/0/09/Alternate_login_pages.png"
  ]
}