{
  "url": "https://wiki.smartsimple.com/wiki/Mike_Reid_and_Keith_Yau",
  "title": "Mike Reid and Keith Yau",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nWhen we started SmartSimple in the winter of 2002, some would say it was a bad time to start a software company but a wonderful time to play it safe and stay focused. However, we wanted to know the answer to a simple question coming out of the dot-com bust... What would business software look like in the future?\nWeb-based for sure, but also inclusive of many different peoples' needs, within any business process, and cost-effective too. We believed the \"big iron\" solutions practically destroyed the software business. So flexible, modular and economic became our mantra.\nVertical markets that have previously been under-serviced gravitated towards our solution and we started to gain traction. It actually took us a couple of years to figure out why things were working. We eventually discovered that these companies could find nothing that reflected their processes, so we started to finally prove our points around flexibility, modularity and economy.\nWe earned the business of very large organizations as they started to see the value of the solution; insurance companies in one vertical, major research organizations in another vertical. We never wanted to fight above our weight but we eventually moved from Bantamweight to Welterweight, still fast on our feet and ready to deliver a punch when required. We got our Irish office up and running with the help of an incredible team and now, with a strong entrance into the US in the spring of 2010, we are getting close to our vision of becoming a global business, fully connected, a regular Starship Enterprise with a fantastic crew from over 25 different counties.\nWhile we're still fascinated with the question of what comes next in the software industry, we're no longer looking to answer it, rather we're looking to deliver it.\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Mike_Reid_and_Keith_Yau&oldid=15714\n’ \nCategory\n: \nSmartSimple",
  "links": [],
  "images": [
    "https://wiki.smartsimple.com/images/7/70/Mike-keith-black-and-white-500w.jpg"
  ]
}