{
  "url": "https://wiki.smartsimple.com/wiki/Data_Categorization_and_Policies",
  "title": "Policy Field Sets and Policies",
  "content": "From SmartWiki\n(Redirected from \nData Categorization and Policies\n)\n Jump to: \nnavigation\n, \nsearch\nThis gives you the ability to create policy field sets and assign them to custom fields across your instance.\nYou can then create security policies and attach them to your policy field sets in order to control the visibility of field data across the entire instance.\nThis makes it easy for you to apply data access policies at a global level, for example if you have data sensitivity classes that apply across entire field sets.\nThese policies apply at the lowest level of security, such that no matter where data is accessed from--whether it's the object itself, a list view, or a report--the visibility of data will be controlled according to each field's categorization and policy and the end user's access level.\nContents\n1\n \nConfiguration - Essentials\n1.1\n \nCreating Policy Field Sets\n1.2\n \nCreating Data Policies\n1.2.1\n \nSecurity Data Policies\n1.2.2\n \nData Retention Data Policies\n1.3\n \nLinking Policy Field Sets and Policies\n1.4\n \nAdding Policy Field Set to Custom Fields\nConfiguration - Essentials\nThe process of configuring the Policy Field Sets and Policies involves the following steps . . .\n Creating Policy Field Sets\n Creating Data Policies\n Linking Policy Field Sets and Policies\n Adding Policy Field Set to Custom Fields\nCreating Policy Field Sets\n Go to \nGlobal Settings\n - Security tab.\n Click on the Policy Field Sets link. You will be brought to the Policy Field Set Settings page.\n Click on the \"New Policy Field Set\" button.\n You will be brought to the New Policy Field Set Settings page, which consists of the following settings:\n ID: unique ID automatically generated on Save\n Name: name used to identify the policy field set\n Description: description for the field set\n Type: select either Security or Data Retention\n Data Mask\n Populate the settings and click Save.\n The Policy Field Set Settings page refreshes and exposes 3 additional tabs:\n Standard Fields\n Custom Fields\n Linked Policies\nNOTE: If you return to the Policy Field Set Settings page then the field set will be listed, with an Edit button to allow updates to be made.\nCreating Data Policies\n Go to \nGlobal Settings\n - Security tab.\n Click on the Data Policies link. You will be brought to the Data Policy Settings page.\n Click on the \"New Data Policy\" button.\n You will be brought to the New Data Policy Settings page, which consists of the following settings:\n ID: unique ID automatically generated on Save\n Name: name used to identify the policy\n Description: description for the policy\n Policy Type: select either Security or Data Retention\n Additional settings will be exposed upon selecting a policy type\n Include Roles: lookup to select the roles that the policy should apply for\n Populate the settings and click Save. \n The Policy Field Set Settings page refreshes and the Linked Policy Field Sets tab is also exposed\nSecurity Data Policies\n Selecting the security policy type exposes the Action field, with the following options:\n Edit\n Edit (by Owner Only)\n Read\n Delete\n Forbidden\n View Encrypted Data\n Hide Data In Emulation Mode\nNOTE: If you return to the Data Policy Settings page then the category will be listed, with an Edit button to allow updates to be made.\nData Retention Data Policies\n Selecting the data retention policy type exposes the following options:\n Action\n Entity\n Trigger After\n Date Field to Compare\nLinking Policy Field Sets and Policies\nIf you are editing a Policy Field Set then you can link the current category with an existing Data Policy by going to the Linked Policies tab.\nIf you are editing a Data Policy then you can link the current policy with an existing Policy Field Set by going to the Linked Policy Field Sets tab.\nThe functionality for both tabs is the same and is as follows:\n Start typing the name of the Data Policy or Policy Field Set into the Ajax lookup field and selected from the returned results.\n Click on the Add button.\n The policy/field set will now be listed under the Linked tab.\nAdding Policy Field Set to Custom Fields\nGo to the Policy Field Set tab, which is available against all Custom Fields settings pages (and specific Standard Fields for Users), and start typing the name of the Policy Field Set into the Ajax lookup field. Selected from the returned results.\nThe policy/category will now be listed under the Policy Field Set tab.\nThe custom field will also appear under the Custom Fields tab for the associated Policy Field Set .\n abac ABAC Abac \n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Policy_Field_Sets_and_Policies&oldid=41218\n’ \nCategories\n: \nSystem Management\nCustom Fields\nSecurity",
  "links": [
    "https://wiki.smartsimple.com/wiki/Global_Settings",
    "https://wiki.smartsimple.com/wiki/Global_Settings"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/1/15/PolicyFieldSet001.PNG",
    "https://wiki.smartsimple.com/images/7/73/PolicyFieldSet002.PNG",
    "https://wiki.smartsimple.com/images/e/e8/DataPolicy001.PNG",
    "https://wiki.smartsimple.com/images/1/1a/SecurityDataPolicy001.PNG",
    "https://wiki.smartsimple.com/images/8/8a/DataRetentionPolicy001.PNG",
    "https://wiki.smartsimple.com/images/4/4e/LinkedPolicies001.PNG",
    "https://wiki.smartsimple.com/images/4/45/CustomFieldPolicy001.PNG"
  ]
}