{
  "url": "https://wiki.smartsimple.com/wiki/Privacy_and_Security_Policies",
  "title": "Privacy and Security Policies",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n1.1\n \nAbout Privacy Policies\n1.1.1\n \nWhat are privacy and security policies?\n1.1.2\n \nAre policies mandatory to have?\n1.1.3\n \nCan I use this feature to track other compliance activities?\n1.1.4\n \nWhat are the differences between the new privacy policies feature and the old one?\n1.2\n \nPolicy Life Cycle\n1.3\n \nHow Users Interact with Policies\n1.3.1\n \nLogin Pages\n1.3.2\n \nSignup Pages\n1.3.3\n \nOn Record Creation\n1.3.4\n \nViewing Accepted Policies\n2\n \nConfiguration\n2.1\n \nSetting Up a Global Policy\n2.1.1\n \nCreating a New Policy\n2.1.2\n \nCreating Policy Sections\n2.1.3\n \nAdding Permissions to a Policy\n2.1.4\n \nAttaching Policies to a Login Page\n2.2\n \nAttaching Policies to Other Collection Points\n2.2.1\n \nAttaching Policies to a Signup Page\n2.2.2\n \nAttaching Policies to a Level 1, 2 or 3 Type\n2.3\n \nActivating a Draft Policy\n2.4\n \nPeriodically Enforcing an Active Policy\n2.5\n \nEditing an Active Policy\n2.6\n \nExpiring a Policy\n2.7\n \nCreating Language Translations\n2.8\n \nViewing Policy Acceptance\nOverview\nThis article is about managing privacy and security policies within your SmartSimple system. Privacy and security policies are essential to aligning your system with regulation, mitigating risks, and fostering user trust by outlining how user privacy and data will be secured. In this article, you will learn to create and update policies, attach policies to collection points, and view policy acceptance. Privacy is a shared responsibility. To learn more, \nreview SmartSimple's own privacy policies\n.\nAbout Privacy Policies\nWhat are privacy and security policies?\nPrivacy policies outline how a website collects, uses, stores, and protects user data, providing visitors with the assurance that their personal information is handled with care and respect. Security policies, on the other hand, detail the technical and procedural measures implemented to defend against cyber threats and data breaches. Together, these policies protect users from identity theft, fraud, and other online risks. For example, SmartSimple has its own privacy and security policies which can be read in full at the \nTrust & Security Center on our website\n.\nAre policies mandatory to have?\nPrivacy and security policies may be mandatory by law depending on the end-user’s location. For example, the \nGeneral Data Protection Regulation (GDPR)\n is an information privacy regulation enacted by the European Union (EU) to protect individuals' privacy and personal data. The GDPR gives EU citizens more control over their personal data and sets strict guidelines for data processing and privacy practices for organizations operating within and outside the EU. Having privacy and security policies aligned with the GDPR is required for legal compliance and helps safeguard individuals' rights to privacy.\nCan I use this feature to track other compliance activities?\nThe privacy and security policies feature can be utilized to track and manage various other policies and compliance activities. For instance, you might opt to use this feature to monitor conflict of interest attestations or agreements to other terms and conditions.\nWhat are the differences between the new privacy policies feature and the old one?\nThe new privacy and security policies feature will be available starting July 2024. Policies created using the old feature must be recreated in the new privacy feature as they will not be migrated. You must opt in to use the new privacy and security policies feature.\nThe new feature includes the following enhancements:\n Added ability to attach policies to key interaction points (login, signup, and record creation) to ensure compliance\n Enhanced control over who sees which policies and when to ensure users only see relevant policies\n Easier language translation management to save configuration time and ensure users have access to policies in their desired language\n Added customizable acceptance options and behaviors giving you greater flexibility to meet your specific business needs\n Strengthened the process for policy revisions for improved compliance management\n User-friendly policy section builder for easier policy creation to increase administration efficiency without the need for technical skills\n Streamlined access to view user acceptance records for improved transparency and accountability\nNote:\n There is currently no mechanism to migrate existing policies into the new format. If you wish to keep using an existing policy, you'll need to recreate it using the new policy builder. Old policy acceptance data will still be retained.\nPolicy Life Cycle\nThere are three states in the policy life cycle:\n \nDraft Status\n - When a policy is first created, it will enter “Draft” status. In this status you may make changes to the contents of the policy freely.\n \nActive Status\n - Once a policy has been moved to the active status, its contents cannot be edited without creating a new policy version. While a policy may have several versions with each version containing different content, only one version may be active at a time. \nNote:\n For an active policy to be enforced, it must have an “Effective Date” set in the past.\n \nExpired Status\n - When a policy becomes unnecessary, it can be marked as \"Expired.\" An expired policy won't be enforced at any collection point. However, users can still see that they accepted the policy in the past by accessing the lock icon in the header labeled \"Privacy and Security.\" Expired policies can be reinstated with an “Active” status at any time without creating a new version.\nHow Users Interact with Policies\nUsers may encounter privacy and security policies in a number of collection points within your system depending on the configuration. As an example, let’s walk through some different areas of the system where the user may encounter a policy and be asked to accept it.\nLogin Pages\nBefore logging in, users may be able to preview specific policies based on configuration as seen below.\n \nA sample login page containing a link to view the organization’s privacy and security policies before logging in.\nNote:\n Since the user has not yet logged in, only policies without any role or country permissions will be visible to the user.\nAfter logging in, most systems require users to accept some policies before the user is granted access to the system. These policies typically outline the responsibilities and expectations of each party when using the system. Depending on the configuration, the end user will have the option to acknowledge, accept, or decline a given policy.\n \nA list of possible user policy options are available in the settings.\nSignup Pages\nUsers may be required to acknowledge or accept a set of policies before being shown the signup page form. This ensures the user is aware of the terms and conditions of using the system as well as how their data may be collected, used, and stored.\nOn Record Creation\nWhen a user creates a Level 1 record (such as when applying to a program), they may be prompted to accept or acknowledge a set of policies tailored to the Level 1 type being created. Similarly, when a user creates a Level 2 record (like a review), they may also be asked to accept or acknowledge a set of policies which may include a conflict-of-interest attestation. These policies will be displayed to the user before the user can fill out the form and will be shown each time the user creates a new Level 1, 2, or 3 record of a specific type.\nNote:\n If you are creating records using the web-enabled template page, the policies visible to the user cannot be determined by any user roles or country as the user cannot have any roles or countries attached to them when they are not logged in. To have policies displayed to a user who is not logged in, all permissions on the policy pertaining to user roles or countries must be left empty.\nViewing Accepted Policies\nUsers can view a list of accepted or acknowledged policies at any time by clicking on the lock icon labeled \"Privacy & Security\" in the global header. This list view displays the collection point, version, and the date when the policy was accepted. Additionally, users can open a PDF to view the contents of the policy as it was at the time of acceptance.\n \nUsers can click the lock icon in the global header to see a list of policies they have accepted or acknowledged.\nAdministrators can see who has accepted any policy at a given time by navigating to \nMenu Icon\n > \nGlobal Settings\n > \nSecurity\n tab > \nPrivacy and Security Policies\n > Edit the desired policy > Click on \"User Logs\" in the left navigation. Here you will see a list view of all users that have accepted a policy along with pertinent information and a PDF of what the policy contained at the time of acceptance. A search is also available to easily find users by name or email.\n \nAdministrators can see which users have interacted with a given policy by clicking the \"User Logs\" link the left-hand navigation.\nConfiguration\nIn this section, we will outline how to set up a new policy, how to manage policy enforcement and revisions, how to attach policies to various collection points, and how to view acceptance. You must be a Global Administrator to configure policies.\nNote:\n There is currently no mechanism to migrate existing policies into the new format. If you wish to keep using an existing policy, you'll need to recreate it using the new policy builder. Old policy acceptance data will still be retained.\nSetting Up a Global Policy\nCreating a New Policy\nTo establish a global privacy and security policy that all system users must accept, follow the steps below:\n Go to \nGlobal Settings\n > \nSecurity\n tab > \nPrivacy and Security Policies\n > Click the “New Policies” button (plus sign).\n Under the \nName\n field, give your policy a descriptive name such as “Privacy and Security Policy”. This name will be displayed to the end user.\n (Optional) If you have an existing policy number in a third-party system, you can enter the same policy ID under \nCustom ID\n for reference purposes.\n For \nEffective Date\n, schedule a date in the past to immediately activate this policy and force users to accept this policy at all collection points which we will set at a later stage. If you select a date in the future, policies will be automatically moved from “Draft” to “Active” status on that future date. An \nEffective Date\n is required to enforce an active policy.\n (Optional) If you need users to periodically re-accept this policy after a set interval of time on login only, specify a period under \nEnforcement Interval\n. By default, the interval is set to “None”.\n (Optional) For \nExpiry Date\n, schedule a date for the current version of this policy to expire. After this date, the status of this policy will change from “Active” to “Expired” and the policy will no longer be enforced.\n Under \nUser Policy Options\n, choose the compliance option that will be presented to the user. In this example, we will choose the second option (“Users must accept the policy to proceed”) since we want all users to have a choice to accept the policy, however, we will not allow them to use the system unless they consent to the terms of our policies.\n (Optional) Toggle on\n Enforce Scrolling\n if you want to force the user to scroll to the bottom of the policy before seeing the options to acknowledge, accept, and/or decline. Otherwise, the acceptance options will be immediately visible to the user and they will not be forced to read it.\n Click\n Save\n.\nCreating Policy Sections\nNow that we have created a policy, we need to add the content of the policy using the new policy builder.\n In the left-hand navigation, select “Policy Builder”. A policy can be built section by section, with each section getting its own independent permissions. This allows you to set up a single policy that can show different sections to different user roles if needed.\n To create a new section, click the “New Policy Section” button which looks like a plus sign.\n Provide a relevant title for the section under \nSection Header\n.\n Under \nContent\n, add the content for the first section of your policy. Then click \nSave\n.\n Repeat steps 2 to 4 adding additional sections and content as needed.\n (Optional) If a certain policy section should only be displayed to specific users and/or countries, navigate to the \nPermissions\n tab to define this in more detail.\nAdding Permissions to a Policy\nWhile each policy section can have its own permissions, you can also add permissions to the policy as a whole. To do this, navigate to \nGlobal Settings\n > \nSecurity\n tab > \nPrivacy and Security Policies\n > Edit the desired policy > \nPermissions\n tab.\nNote:\n A policy must not contain any role-based or country-based permissions in order to be visible to users not logged into the system.\nAttaching Policies to a Login Page\nOnce we have created a new policy and set up the appropriate permissions, we can attach the policy to a global location such as a login page. This will force all users who log in to the system to accept or acknowledge the policy before gaining further access. In this article, we refer to any location where a policy has been attached as a “collection point”. To attach a policy to a login page, follow these steps:\n Go to \nGlobal Settings\n > \nBranding\n tab > \nLogin Pages\n Edit the desired login page.\n Under the “Privacy Policies” section, add the new policy to the \nAttach Policies\n field.\n Click \nSave\n.\nNote:\n For a policy to be enforced at a collection point, it must have a status set to “Active” and it must have an \nEffective Date\n set in the past.\nAttaching Policies to Other Collection Points\nAttaching Policies to a Signup Page\nIf you have a specific policy for users to accept prior to registering, you can attach it to a user signup page. Navigate to \nGlobal Settings\n > \nUsers\n tab > \nSignup Pages\n > Edit the desired signup page > Under \nAttach Policies\n, select the desired policies and click \nSave\n. Now when a user navigates to the signup page, the specified policies will be displayed as part of the signup process. If the user signup page is attached to an organization signup page, the policies will also be displayed.\nAttaching Policies to a Level 1, 2 or 3 Type\nIf you want users to accept a policy upon creation of a Level 1, 2 , or 3 record of a specific type, you can navigate to the desired \nUTA Configuration Settings\n > Click the desired \nLevel\n tab > \nTypes\n > Edit the desired type > \nProcess\n tab > Under \nAttach Policies\n, select the desired policies and\n Save\n.\nNote:\n The policy will only be enforced when a user manually creates a new record of the specified type. Policies will not be enforced when records are created in bulk (such as a data import) or created in batch (such as using the \nAdvanced Data\n table).\nActivating a Draft Policy\nWhen a new policy or a new version of a policy is created, it is automatically set to “Draft” status.\nThere are two ways to activate a draft policy so the policy can be enforced:\n Click the \nActivate Version\n button in the submit bar of the policy settings page.\n Set an\n Effective Date\n in the future on the policy settings page. When the selected date is reached the policy will be automatically moved from “Draft” to “Active” status.\nNote:\n A policy must be in “Active” status, have an \nEffective Date\n set in the past, and be attached to a collection point before the policy will be enforced at the collection point defined.\nPeriodically Enforcing an Active Policy\nIn some scenarios, it may be advantageous to force users to re-accept the same policy after a set interval of time. For example, users may need to re-accept a policy on an annual basis. Instead of creating a new version of the policy each year, you can set an \nEnforcement Interval\n to automatically force the re-acceptance of a policy. For example, if users need to re-accept a policy on an annual basis, go to \nGlobal Settings\n > \nSecurity\n tab > \nPrivacy and Security Policies\n > Edit the desired policy > Under \nEnforcement Interval\n, select “Annual”. Currently, policies can be enforced periodically on an annual, quarterly, monthly, weekly, or daily basis.\nNote:\n The \nEnforcement Interval\n only applies to policies attached to login pages.\nEditing an Active Policy\nOnce a policy enters “Active” status, no changes can be made to the content within policy sections. If changes are needed, a new version of the policy must be created. To make changes to an existing policy, follow these steps:\n Go to \nGlobal Settings\n > \nSecurity\n tab > \nPrivacy and Security Policies\n > Edit the desired policy > Click the \nNew Version\n button in the submit bar.\n An alert will display warning you that a new version of this policy will be created in “Draft” status. Once the new version is activated, it will replace the previous version. Click “Yes” to proceed.\n A new version of the policy will be created in “Draft” status. Make the necessary changes to this version.\n Once you are happy with the changes, click the \nActivate Version\n button in the submit bar to replace the previous version.\nNote:\n Previous policy versions will continue to be enforced until a new version is moved to “Active” status.\nExpiring a Policy\nAn expired policy will no longer be enforced but may be activated again in the future. Acceptance data for an expired policy will still be available. For compliance reasons, there is no option to completely delete a policy.\nTo retire an active policy, go to \nGlobal Settings\n > \nSecurity\n tab > \nPrivacy and Security Policies\n > Edit the desired policy > Click the \nExpire Version\n button in the submit bar.\nCreating Language Translations\nTo create language translations of a policy, follow these steps:\n Go to \nGlobal Settings\n > \nSecurity\n tab > \nPrivacy and Security Policies\n > Edit the desired policy > Click the “Policies Translation Settings” button in the top action bar.\n Select the target language under the \nLanguage\n dropdown.\n Enter a translated title inside the \nName\n field.\n Click \nSave\n.\n Exit the translation modal and click the “Policy Builder” link in the left-navigation bar.\n Edit the desired policy section by clicking the pencil icon.\n Click the “Policies Section Translation Settings” button at the top of the modal window.\n Enter the relevant translated text and click \nSave\n.\n Continue to add text translations to the remaining policy sections.\nViewing Policy Acceptance\nUser acceptance logs can be accessed in three ways:\n Users can view a list of accepted or acknowledged policies by clicking on the lock icon labeled \"Privacy & Security\" in the global header. This list view displays the collection point, version, and the date when the policy was accepted. Additionally, users can open a PDF to view the contents of the policy as it was at the time of acceptance. Depending on configuration an administrator could emulate a user to see what that user accepted.\n Administrators can see who has accepted any policy, and when, by navigating to \nMenu Icon\n > \nGlobal Settings\n > \nSecurity\n tab > \nPrivacy and Security Policies\n > Edit the desired policy > click on “User Logs” in the left navigation. Here you will see a list view of all users that have accepted a policy, along with pertinent information, and a PDF of what the policy contained at the time of acceptance. A search is also available to easily find users by name or email.\n Administrators can see a list of all accepted policies by navigating to \nMenu Icon\n > \nGlobal Settings\n > \nSecurity t\nab > \nPrivacy and Security Policies\n > \nUser Logs\n tab.\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Privacy_and_Security_Policies&oldid=43055\n’ \nCategory\n: \nSecurity",
  "links": [
    "https://wiki.smartsimple.com/wiki/General_Data_Protection_Regulation_(GDPR)"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/9/95/2024-07-ticket-145858.png",
    "https://wiki.smartsimple.com/images/4/46/2024-07-ticket-145858-2.png",
    "https://wiki.smartsimple.com/images/1/16/2024-07-ticket-145858-3.png",
    "https://wiki.smartsimple.com/images/6/63/2024-07-ticket-145858-4.png"
  ]
}