{
  "url": "https://wiki.smartsimple.com/wiki/Report_Builder_(Neo)",
  "title": "Report Builder (Neo)",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n1.1\n \nVideo Introduction\n2\n \nConfiguration - Essentials\n2.1\n \nNavigating to Report Builder Neo\n2.2\n \nBuilding a Report Builder Neo\n3\n \nConfiguration - Advanced\n3.1\n \nShow or Hide Column Totals\nOverview\nThe \nReport Builder Neo\n is used to construct a report by selecting the required fields and setting the way the field should be used within the report. The Report Builder Neo allows for greater control of reports and features a more intuitive user interface.\n \n Report Builder Neo can only be used to create brand new reports. Existing reports cannot be updated to the new format. \nVideo Introduction\nConfiguration - Essentials\nNavigating to Report Builder Neo\n1. Click on the 9-square menu on the top right of your page.\n \n2. Under the \nTools\n menu, click on \nReports.\nThe reports that are available to you in your \nSmartSimple\n system will be displayed as a list.\n3. Click on the \n+ icon \non the top left of the page in order to create a \nNew Report.\n4. The \nNew Report \nform will be displayed. For the field \nReport Builder, \nselect \nNeo.\n The \nReport Builder Neo \nwill be selected by default unless you explicitly change it to \nClassic. \n Every time you create a report, you can choose whether you want the Neo or the Classic Report Builder functionality. \n5. After filling in the rest of the fields, click \nSave.\n The new report will be saved into the system.\n For more detailed instructions, see \nCreating a Basic Report\n. \n6. Once the report is created, the page will refresh and a \nfour square \nicon will appear at the top left, above the report name.\n \n \nClick on this icon to open up the \nReport Builder Neo. \nBuilding a Report Builder Neo\nThe \nReport Builder Neo \nallows you to manually build you a report. The empty report builder will look like this: \n \nThe leftmost pane gives you the option to select \ndatasets\n. The middle pane allows you to select the fields to be used. The user can select upto 100 columns for each report. Each report column consists of the following settings:\n \nDataset\n - Refers to the dataset selected in the dataset pane.\n \nField\n - The field you wish to display in this column. All fields from all selected tables will be displayed in the field list. Fields are sorted alphabetically by table name, and by field name.\n \nColumn Heading\n - The text you wish to appear above each column in the report.\n \nDate/Time Translation\n - Used to “extract” the day, month, week, or year from a date field for comparison purposes.\n \nGroup Options\n - Used in \nsummary reports\n to group by, sum, count, or calculate the average of the field. Also provides \n Total Group options\n for configuration of report groupings and easier retrieval of total rows.\n \nSort By\n - Determines the display order of the report results, \nAscending\n or \nDescending\n.\n \nAlignment\n - Determines the alignment of the column header and the column values. Options are \nLeft\n (the default setting), \nCenter\n and \nRight\n.\n \nFormula\n - Allows you to build out further complexity such as mathematical operators, concatenation, and supports MySQL syntax.\n \nDisplay\n - This flag is used to suppress the display of a field that you may need to use for criteria, but not display in the reports. For example, you may wish to produce a list of salaries over 100,000 per year and use the salary as criteria, but not show the result.\n \nCriteria\n - Sets the criteria for the records to be displayed in the report. There are ten rows for criteria.\nNote\n: If you have many custom fields, access the reports tab within the application you are creating the report from. If you are creating a report from a particular , access the reports tab from that UTA.\nThere is also a field name search box included within the data set field picker.  You can use this search box to narrow down your field set to those which include matches to a key word search.\nConfiguration - Advanced\nShow or Hide Column Totals\nThis enhancement adds the ability to show column totals in \nReport Builder Neo\n.\n1. Under the \nTools\n menu, select the \nReports\n option\n 2. Click on the \nNew Report\n hyperlink\n 3. Click on the \nReport Builder\n 4. Add a check mark to the \nShow Total\n option\n 5. Complete all necessary fields in the Report BuilderSh\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Report_Builder_(Neo)&oldid=39422\n’ \nCategories\n: \nReports\nHow\nReport Builder Neo",
  "links": [
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Reports#Creating_a_Basic_Report",
    "https://wiki.smartsimple.com/wiki/Report_Recordsets",
    "https://wiki.smartsimple.com/wiki/Creating_Summary_Reports",
    "https://wiki.smartsimple.com/wiki/Using_Total_Group_Options_in_Report_Builder",
    "https://wiki.smartsimple.com/wiki/Criteria"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/0/02/Neo_report_builder.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/d/d1/Report_builder_neo1.png",
    "https://wiki.smartsimple.com/images/4/4c/Report_builder_icon.png",
    "https://wiki.smartsimple.com/images/0/0c/Report_builder_new.png",
    "https://wiki.smartsimple.com/images/7/71/2014-07-15_15-52-13.png",
    "https://wiki.smartsimple.com/images/5/5d/Show_total_report_builder_neo.png"
  ]
}