{
  "url": "https://wiki.smartsimple.com/wiki/Reports",
  "title": "Reports",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n1.1\n \nReport Components\n1.1.1\n \nCharts\n1.1.2\n \nDashboards\n1.1.3\n \nTables\n2\n \nConfiguration - Essentials\n2.1\n \nPermissioning Reports\n2.2\n \nAccessing Reports\n2.2.1\n \nReport List Columns\n2.3\n \nCreating a Basic Report\n2.4\n \nEditing Reports\n2.4.1\n \nCopying a Report\n2.4.2\n \nReport Tabs\n2.5\n \nAdding a Table to a Report\n2.6\n \nLaunching the Report Builder\n2.7\n \nClassic Report Builder - Column Settings\n2.7.1\n \nClassic Report Builder Help Panel\n2.8\n \nReport Builder Neo - Column Settings\n2.8.1\n \nReport Builder Neo Help Panel\n2.9\n \nDeleting a Report\n2.9.1\n \nBatch Delete Reports\n2.9.2\n \nIndividually Deleting a Report\n2.9.3\n \nView Deleted Reports\n2.9.4\n \nRestore or Purge Deleted Reports\n3\n \nConfiguration - Advanced\n3.1\n \nAdvanced Settings of Reports\n3.1.1\n \nReport and Field Caching\n3.2\n \nInternet-Enabling Reports\n3.2.1\n \nLanguage Translation for Internet-Enabled Reports\n3.3\n \nReports vs List Views\n3.4\n \nSee Also\nOverview\nThe \nSmartSimple\n reporting system, an integral part of our business operating system, allows you to manipulate both the contents and the presentation of data contained in one or more of the SmartSimple tables. Unlike a table, reports present only the data that meets the criteria you define - they can also aggregate and display summarized data information. \nYou can utilize the functionality of reports in your \nSmartSimple\n \ninstance\n without additionally buying or installing software. Reports are completely created from within the standard \ninterface\n and are viewable from any \nbrowser\n, as well as via \nMicrosoft Word \nor \nExcel \nwith the appropriate SmartSimple \nplug-in\n. \nBenefits of Reports: \n Display data from one or more tables in one place\n Group-aggregate data from one or more tables\n Display the grouped data in a variety of different types of graphs\n Export the data into any file format that you wish OR \n Designate \nInternet-enabling\n so that the reports can be linked to public websites \n Group reports together as \ntabs\n, allowing similar topic-based reports to be found together\n Copy and modify built-in reports as the basis of your customized reports \nUser Role\n-based \nsecurity\n defines who can view the reports that you create from your system.\n You must be a user with SysAdmin privileges in order to create reports from your SmartSimple system. \nReport Components\nYou will encounter three major components in the reporting system: \n \nReports\n that are created from underlying \nSmartSimple\n database tables - you can connect the required tables to generate a report\n \nGraphs\n that you create yourself. These are based on existing reports and are used to display the report in a graphic format. \n \nDashboards\n that will display multiple charts on a single page\nThe following diagram shows the relationship between these three types of \nentities\n:\n \nCharts\nCharts are used to display the information from a report in an easy-to-read “graphic” format.\n You can create pie charts, bar charts, line charts, and table-type charts.\n You can create more than one chart type of each report and when displaying a report, choose from any of the charts associated with the report.\n Generally, you will choose a “summary” type report as the basis for the chart, as that type of information is more meaningful when displayed in this manner.\n A user can only access the chart if they have permission to see the report that the chart is based on. \nA \nuser\n can only access the chart if they have permission to see the report the chart is based on.\nDashboards\nA dashboard is a single page view of a set of charts.\n When the \nuser\n displays the dashboard, each report referenced by each chart is processed, and the current data is displayed in charts that are displayed on the dashboard.\n You can create multiple dashboards to show different sets of key indicators.\n A \nuser\n can indicate that a specific dashboard should be their \nhome page \nwithin \nSmartSimple\n, giving them an immediate view of key information from the system when they first log in.\n Each dashboard needs to be permissioned for the roles that you wish to be able to see the dashboard. \nTables\nIn order to make the creation of reports a little simpler, some of the \nSmartSimple\n tables are presented in a \ndenormalized\n format when using the \nReport Builder\n.\nFor example, the contact record does not contain the company name; these two tables are linked at the database level through the \nCompanyID\n field. So contact table does not contain the company name field but rather a key field that links to the company table.\nBut when you use the contact table within the \nReport Builder\n it will display a field \nCompany Name.\n This means that you can use this field without needing to link the two tables together.\nConfiguration - Essentials\nPermissioning Reports\nAccess to the \nreport-creation\n features is controlled by the \nrole\n-based manager permission. So you must be in a \nrole\n associated with this feature in order to create reports.\n Users who will only need to view reports do not need these manager permissions. \nYou must be a member of a \nrole\n with manager permission for \nReports\n if you wish to do any of the following actions: \n \nCreate\n new reports.\n \nEdit\n or copy existing reports.\n \nDelete\n existing reports, either individual or as batch deletes.\nTo permission which roles will have the ability to create, edit, and delete reports in your system, follow these steps: \n1. Click on the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nConfiguration, \nselect \nRoles and Security. \n \n3. Under the subheading \nSystem Security Settings, \nselect the hyperlink \nSystem Feature Permissions. \n4. Click into the tab labelled \nAction Permission. \n \n5. Scroll down until you see the field labelled \nReports - Manager. \nClick into the text box in order to select from a drop-down of \nuser roles\n that will have manager permissions for reports. \n \n You can also specifically permission which roles will have the ability to \nExport Data \nfrom reports. \n6. Click \nSave \nat the bottom of the screen when you are done. \nAccessing Reports\nA \nuser\n who is permissioned for report use can access the reports available to them. Follow these steps to access reports in your SmartSimple system: \n1. Click the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nTools, \nselect \nReports. \n \nThe list view of available system reports will be displayed. \n \n \nThe report window consists of the following sections along the top row of tabs:\n \nReports: \nThis displays a \nlist\n of your system's current reports that have been made available to you. \n \nGlobal Report Template\n: \nThis tab is used to define a customized HTML template for all reports.\n \nDashboards\n: \nThis tab is used to create a dashboard to display a set of charts.\n \nWeb Access Statistics\n: \nThis tab displays statistics on how often your web-enabled reports have been accessed.\n \nDeleted Reports: \nThis tab displays a list of any deleted reports in your system. \nYou can filter the results of your report list by choosing a \nCategory \nof reports - this can be found at the top right of your page. Any reports that have not been associated with a category will appear in the \nUncategorized \ncategory option. Clicking into the \nCategory \nfield will allow a drop-down list of available report categories to appear: \n \nYou can also search through reports manually by using the Search bar on the top right, just above the list view. If your results exceed the maximum amount of records displayed on a page, toggle between different pages by selecting the \nnext \nor \nback \narrow icons on the top right. The count of records that you are viewing out of the total will always be displayed next to these buttons.\nAny \nreports that have been Internet-enabled\n will have a black dot under the \nInternet Enabled \ncolumn to indicate so. \nReport List Columns\nEach report on the main list of reports will have buttons to the left of it that have several different functions.\n \nThe functions are described in the table below: \nRun Report \nClicking this icon will cause the system to run the report and display the results to you.\nCustom Export \n</span>\nClicking this icon will allow you to configure the information that you wish to export from your SmartSimple report to external applications such as \nMS Word, MS Excel, \nor \nQuickbooks. \nExport File \n</span>\nClicking this icon will allow you to export your SmartSimple report to external applications in a standard file format such as \nMS Word, MS Excel, PDF, HTML \nor more. There is less configurability available with the \nExport File \nfunction than the \nCustom Export \nfunction. \nEdit Report \nClick this icon in order to open the edit options for this report. If the report is a built-in report, you will be able to edit the report to see how it is constructed, but any modifications you make will not be saved to the built-in report. In order to customize a report you will have to make a copy of the built-in report and make further edits with the copy. \n Any reports that are \nnot \nenabled for certain features - for example, for \nFile Export \nor \nCustom Export \n- will have the corresponding button icon greyed out next to the report name. \n In order to \nenable \nthese features, simply click the \npencil icon \nnext to the report name, go to the appropriate tab of \nCustom \nor \nFile Export, \nensure that it is both enabled and set up to how you want it, then click \nSave. \nWhen you return to the list view of reports, the corresponding icon should now be clickable. \nThe columns on the \nlist view\n of reports are described in the following table: \nReport Number (#)\nThe index of the report on the page. Remember this page length, like all others, is set by your \nPersonal Settings\n - \nNumber of Records Per Page\n.\nReport Name\nThe name assigned to the report. An asterisk (*) is displayed in front of the \nName \nfield of any built-in reports.The narrative description of the report.\nReport Description\nThe narrative description for the purpose of the report. \nRoles\nThis will display a list of \nroles\n that will be able to display the report. You must add the required roles to this list in order to make it available to other users (to learn how to, see \nReport Tabs\n - the \nView Report \nfield is under the \nSecurity \ntab.\n If you are in a role with \nmanager permissions for reports\n, you are able to see all reports, even though the \nRoles \nfield may be blank. \nLast Updated\nThis will display a date and time stamp for when the report was last updated.\nModified By\nThis will display the name of who made the last modifications to this report.\nCreated By\nThis will display the name of who created the report initially.\nInternet Enabled \nIf the report is not Internet Enabled, the column will be blank. If the report is \nInternet Enabled\n, the column will have a black dot.\nReport ID\nSee \nDetermining the reportid\n. \nRemember: \nAny user will only be able to see the reports and functions that they have permissions to. If a user is permissioned to be able to create new reports, they will see a \n+ icon \non the top left that allows them to create a new report. \nCreating a Basic Report\nLearn how to create a basic report by following the steps below. Prior to these steps, you must first be in the \nReports \nlist view (read the \nAccessing Reports\n section if you need help). \n \nNote\n: If you have many \nCustom Fields\n, access the reports tab within the application you are creating the report from. If you are creating a report from a particular , access the reports tab from that UTA.\n1. Click the \n+ \nicon on the top left of the screen to \nCreate a New Report.\n2. The new report window is displayed: \n \nThe fields on the new report page are described below: \nReport ID\nThe unique ID assigned to the report, shown as a read-only field.\nBuilder Type\nWhen creating a report, users will have the option to choose between the \nNeo \nor \nClassic Report-Builder. \nNeo - \nSee for now, \nReport Builder (Neo)\n, a SmartSimple upgrade to the Reports tool that is meant to be more user-friendly and intuitive to use. \nClassic - \nSelecting the \nClassic \nbuilder type will enable a new tab called \nRecordsets\n to appear in the top row of tabs. This tab is used to select which tables are required in the report, the relationships between tables, and the primary table. The primary table determines how the data will be joined when multiple tables are selected. \nName\nThe name of the report will be displayed to any users who are accessing the report.\nDescription\nThe narrative description of the purpose of the report.\nCategory\nThe category you wish you associate with this report. Entering a unique category name will consequently create a new entry in the \nCategory \nfield in the main Reports list view. Entering an existing category name will display this report in the existing category.\nWhen you view the main \nlist view\n of reports, you will see a drop down at the top right with all of the system's available report categories.\nLock\nDo not build rebuild report - \nToggling on this option will indicate that the report should not be rebuilt. In the case of a custom \nReport Template\n, it will set off an alert when the \nReport Builder \nbutton is clicked. \nThe second tab following the \nGeneral \nsettings provides \nAdvanced \nsettings for how the report will be displayed, its external accesses, its caching options and more. For more information about the \nAdvanced \nconfiguration, please see our \nAdvanced Settings of Reports\n section. \nEditing Reports\nAfter clicking the \nSave \nbutton, the page will reload and save your report into the system. You will now be in the position to edit this report with more detailed configuration. \n \nThe \nBuilder Type \nwill no longer be modifiable once you have saved your new report. Furthermore, the main report information will now include the \nCreated By, Last Modified, \nand \nLast Modified By \nauto-populated fields. \nTo the right of the page will be the \nNotes\n tab that allows you to make new notes or see any existing notes that have been made on your report. \nYou will also be able to see the following new buttons at the bottom of the page: \nSave, Save As, Delete, \nand \nPreview. \n If you have not yet selected any table(s) nor fields from tables in your \nReport Builder, \nyou will not be able to see a preview of the report.\nCopying a Report\n The \nSave As \nbutton at the bottom of the \nGeneral Settings \npage when editing any individual report will enable a pop-up to appear that prompts you to enter the new name of your report. Once you insert a name and click \nOK, \nthe system will make a copy of this report under the new name, and the list of reports accessed from \nTools > Reports \nwill be updated with this new copy. \nWhen a report is copied, the configurations made in the Report Builder and on the Advanced, Security, File Export, Custom Export and Report Template tabs will be copied over to the new report. Sub-Report settings and Charts will not, however, be copied.\nReport Tabs\nIf you selected \nClassic Builder Type \nfor this report, the following tabs will appear after the \nGeneral \nsettings tab. \nRecordsets\nThis tab allows you to attach recordsets to your reports. \nAdvanced\nThis tab allows you to configure the \nadvanced settings\n of your report. \nSecurity\nThis tab allows you to permission the security of your report. A field labelled \nAllow View Report \nwill enable you to select which \nroles\n have permission to see this report in your system. \nSub-Reports\nThis tab allows you to build a \"nested\" report within the main report.\nFile Export\nThis tab allows you to the default export settings of the report.\nCustom Export\nThis tab allows you to create custom export settings for the report.\nScheduled Export\nThis tab allows you to schedule an export for a later date, which can be set to either \nFile Export \nor \nCustom Export.\nReport Template\nThis tab allows you to control the layout and formatting of your report.\nCharts\nThis tab allows you to create one or more charts to be associated with the report.\nEach \nClassic Report Builder \ntab will soon have its own subsection within this article for further explanation, if needed.\n \nNote: \nIn \nReport Builder Neo, \nthe only difference is that you will not see a \nSub-Reports\n tab. \nAdding a Table to a Report\nThe first step for constructing a report is always to add the tables required to the report on the \nRecordsets\n tab (right after the \nGeneral \ntab). \n1. As as an example, in the \nRecordsets \ntab, scroll down and set the \nPrimary table\n option for the \nContacts\n table.\nSelecting the primary table automatically selects that table for the report.\n2. Click the \nSave \nbutton at the bottom of the page. \n For more information about \nInner \nand \nOuter Join, \nsee \nthis article\n - however, the default when you add a table to a report is \nInner Join, \nand the \nOuter Join \nfunctionality is not necessary until you want to add multiple tables to a report. \nLaunching the Report Builder\nOnce you have \nSaved \nyour new report, a \nfour square icon \nwill appear at the top left of your page above the report name.\n \nClicking on this icon will launch a modal window that displays the \nReport Builder, \neither in \nNeo \nor \nClassic.\n It is highly recommended for all users to use the Report Builder Neo for easier and more intuitive functionality. \n Ensure that your \nBuilder Type \nis selected as \nNeo \nin order to launch the \nReport Builder Neo. \nClassic Report Builder - Column Settings\nIn the March 2020 upgrade, the ability to create classic style report was depricated. Existing reports will continue to function, but you will not have the ability to copy or create any new reports that use the classic report builder.\nReport Builder Neo \nis recommended for all users, please see the \nReport Builder Neo - Column Settings\n section of the page.\nEach column will consist of the basic construction of the report by selecting the required fields and setting the way that the field should be used within the report.\nEach report column consists of the following settings: \nColumn Heading\nThe text that you wish to appear above each column in the report. Initially, this will be set to the same name as the field, but you can edit the text if required. If you wish to change the text back to the \nField \nname, then click the button to the right of the column heading. \nRecordset\nThis refers to the recordset that has been selected in the \nRecordsets\n tab. If multiple recordsets have been selected to build your report, you can select which one you want to use as a table for your report from the drop-down when you click into the field box. \nType\nWhen a specific recordset has been selected, the \nType \nfield box will have a drop-down of corresponding types. Depending on what recordset it is, you can select the \ncategory\n, \nrole\n, \ntemplate\n, or \ntype\n from which your field will be derived.\nEx: \nIf the Recordset you selected was \nContacts, \nthe corresponding \nType \nwould be from the available system \nroles\n.\nField\nThe field you wish to display in this column. All of the fields from all selected tables will be displayed in the field list; fields are sorted alphabetically by table name and by field name.\nDate/Time Translation\nUsed to \"extract\" the day, month, week or year from a date field for comparative purposes.\nGroup By\nUsed in \nsummary reports\n to group by, sum, count, or calculate the average of the field. Also provides \nTotal Group options\n for configuration of report groupings and easier retrieval of total rows. \nSort By\nDetermines the \nsort order\n of the report results, either \nAscending \nor \nDescending.\nAlign\nDetermines the alignment of the column header and column values. Options are \nLeft \n(default), \nCenter \nand \nRight. \nCalculated Field\nThis option allows you to build out further complexity - for example, mathematical operators and concatenation. This field also supports MySQL syntax.\nShow\nChecking this option will show the specific field data. An example of when you might not want to enable \nShow \nis if you wish to produce a list of salaries over $100,000 a year and use the salary as criteria, but not show the result. \nLeft/Right Move Arrow Icons\n - These icons are displayed on the left and right of each \nShow \ncheck box and can be used to change the column order. \nShow Total\nChecking this option will display the total of all the data accumulated from this column. \nCriteria\n \nHere you can set the criteria for which records to be displayed in a report. There are 5 columns available for setting criteria, each separated by the \nOR \noperator. \n \nNote: \nIf you want to add more columns, click on the \nMore Columns \nbutton at the bottom of the page to add 25 more columns. \n There is a fixed limit of \n50 columns \nfor the \nClassic Report Builder. \nIf more columns are required, you will need to use two reports linked together - see \nMerge Sub-Reports\n. \n \nTip: \nThe \nbrowser\n \nMozilla Firefox \nwill load the Report Builder more efficiently than \nInternet Explorer. \nAt the bottom of the page are a row of buttons: \n \nBuild Query\nThis button is used to create your report based on the fields and criteria that you have selected in the Report Builder. When this button is clicked, the Report Builder will close and you will be brought back to the \nEdit Report \npage. \n The \nReport Template\n will also be rebuilt when this button is clicked; if custom work has been done on the Report Template prior to building this query, make sure to save your changes elsewhere first. \nClear All\nThis button will clear all of the fields including calculated fields and specified criteria in the Report Builder. You will be able to start again from scratch.\nMore Columns\nThis button will add another 25 columns to the Report Builder to a maximum of 50 for any new \nClassic \nreport. \nClassic Report Builder Help Panel\nAt the very bottom of the \nClassic Report Builder \ninterface is the \nHelp Panel \nwith an upwards arrow that will open up help options when clicked. \n \n \nThe \nHelp \nmenu consists of 6 tabs, each with helpful information corresponding to that tab's topic. \nOverview\nThis tab provides descriptions for all the components of the top panel of the Report Builder, including column fields and their descriptions.\nComparison Operators\nThis tab will describe how to set the basic criteria on logical tests.\n See Also: \nSetting Text Criteria – Logical Operators in a Report\nWildcard and Like Operators\nThis tab describes how to set \npartial criteria. \n See Also: \nUsing Wildcard Criteria in Reports\n, \nPrompting for a Criteria Using a Wildcard\nSpecial \nSmartSimple\n Criteria Values\nThis tab describes how to set criteria from user prompts and user attributes (such as user and company identifiers).\nDate Comparison\nThis tab describes how to set date- and time-based data. \n See Also: \nUsing Date Criteria\n, \nAccessing the Current Date in a Report\nCalculated Field\n \nThis tab describes valid mathematical expressions and functions, string functions, and logical statements for user in the \nCalculated Field\n section of the Report Builder.\nReport Builder Neo - Column Settings\nIf your new report has been saved under \nBuilder Type - Neo, \nthen the Report Builder that is launched will be the \nNeo \nrather than the \nClassic \nversion. \nThe \nReport Builder Neo \nwas introduced as an upgrade to our \nClassic \nReport Builder; it provides the following benefits: \n A more intuitive interface with higher degree of configurability \n Saving time and effort in creating targeted, impactful reports\n Uses your organization's language (the terminology related to your )\nThe primary upgrade in \nNeo \nis that it streamlines the process of \nfinding, selecting, \nand \nsetting up your information. \nThe Report Builder Neo can only be used to create new reports; any existing reports with the Classic Report Builder will not be able to switch to Neo. \n1. Click on the \nfour-square \nicon on the top left of your page to launch the \nReport Builder Neo. \n \n \n2. The \nReport Builder Neo \nwindow will open up as a modal window: \n \nIt will have the following functions and fields: \nNumber of Columns\nYou can add or subtract the number of columns you need for your report \nup to a maximum of 100. \nDataset\nClick the \n+ icon \non the top left of the Report Builder in order to add the primary dataset you will be using for your report. \n The \nprimary \ndataset will always be easily identifiable as once it appears on the left-hand dataset list in the Report Builder, it will appear with a \nstar \nnext to its name. \n You can create as many primary and secondary datasets as required to personalize each report you make. \nField\nThe field you wish to display in this column. \nColumn Heading\nThe text that you wish to appear above each column in the report. \nDate/Time\nUsed to \"extract\" the day, month, week or year from a date field for comparative purposes. The options are shown in the screenshot below: \n \nGroup Options\nUsed in \nsummary reports\n to group by sum, count, or calculate the average of the field. Also provides \nTotal Group Options\n for configuration of report groupings and easier retrieval of total rows. The options are shown in the screenshot below: \n \nSort By\nDetermines the \nsort order\n of the reports, either \nAscending \nor \nDescending.\nAlignment\nDetermines the alignment of the column headings and the column values - \nLeft \n(default), \nCenter, \nand \nRight. \nFormula\nThis field allows you to build out further complexity such as mathematical operators, concatenation, and supports MySQL syntax. \nDisplay\nChecking this option will allow you to display the data from this column in your report; if you do not want it to be displayed, but rather only set as a criteria, you can uncheck this option and the column data will be hidden from the resulting report. \nExample:\n You may wish to produce a list of salaries over $100,00 a year and use the salary as a criteria, but do not want to show these results. \nShow Total\nChecking this option will display the total of all the data accumulated from that column. \nCriteria\nHere, you can set the criteria for which records to be displayed in a report. There are 5 columns available for setting criteria, each separated by the \nOR \noperator.\n The \nReport Builder Neo \nhas the \nDrag and Drop\n functionality to re-order the display view of columns in a report and to input fields into the appropriate columns. \n The Report Builder will automatically note which base dataset your columns relate to. \nYou can also use the \nSearch \nfunctionality in the dataset field picker in order to narrow down your fieldset to those which include matches to a word search. Simply click on the \nFields \ntab, and insert your search into the search box: \n \n \nReport Builder Neo Help Panel\nSee the \nClassic Report Builder Help Panel\n. \nDeleting a Report\nThe user must be permissioned to be able to delete a report in order to do so. \nBatch Delete Reports\n1. Click on the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nTools, \nselect \nReports.\n3. Check the box on the left of all report names for the reports that you wish to delete. \n4. A \ntrashcan \nicon will appear in the top left row of buttons once at least one report has been selected. Click on this button to \nbatch delete \nall of your selected reports.\n \n5. A confirmation message will pop-up on your screen. Click \nYes \nto confirm the deletion. \nThe reports will be deleted and your list view of reports will refresh to display these changes. \nIndividually Deleting a Report\n1. Click on the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nTools, \nselect \nReports.\n3. Click on the \npencil icon \nnext to the name of the report that you want to delete to go into \nEdit \nmode for that report. \n4. The report details will be displayed, and at the bottom will be a \nDelete \nbutton among a row of other buttons. Click on the \nDelete \nbutton.\n \n5. A confirmation message will pop-up on your screen. Click \nYes \nto confirm the deletion.\nThe report will be deleted. Your page will refresh and you will be brought back to the list of reports, now updated to reflect your deletion.\nView Deleted Reports\nIn order to see which reports have been deleted from your system, either by you or another user, you can always click onto the last tab in the \nReports \nsection of the system, titled \nDeleted Reports.\n \nNote: \nOnly a user with \nSystem Administrator\n privileges can view the \nDeleted Reports \ntab. \n \n \nThe list of deleted records will have columns that include \nwho \ndeleted the report (\nDeleted By \ncolumn) and \nwhen\n (\nDeleted Date \ncolumn, presented as a date and time stamp).\nRestore or Purge Deleted Reports\n You must have SysAdmin privileges in order to view or modify already deleted reports. \n 1. Click on the 9-square menu icon on the top right of your page.\n \n \n2. Under the heading \nTools, \nselect the hyperlink \nReports.\n3. The list view of reports will be displayed. Click into the last tab, labelled \nDeleted Reports. \n4. The list of deleted reports in your system will be displayed.\n5. Select the checkbox on the left of the report name of the report that you would like to either \nRestore \nor \nPurge.\nOnce you click this checkbox, two buttons will appear on the top left of your page underneath the tab labels. The \nreload \nbutton will allow you to restore the deleted report so that it will once more be accessible, viewable, and modifiable in your system. The \ntrashcan icon \nwill allow you to permanently delete this report, so that it is not accessible even from the \nDeleted Reports \ntab. \n \n \n \nNote: \nIf you choose to permanently delete a report, a pop-up confirmation message will appear. Click \nYes \nto go through with this purge. \n Any reports that have been deleted for over one year will be automatically purged. \nConfiguration - Advanced\nAdvanced Settings of Reports\nThe second tab on the \nNew Report \npage is labelled \nAdvanced. \nThis tab will display all the advanced settings that can be configured for the report.\n \nThe options for the \nAdvanced\n tab are described in the table below:\nCriteria Text\nText used to prompt the \nuser\n when they are \nrequired to enter\n some \ncriteria\n values. This setting will also specify the introduction text, as well as labels for \nCustom Fields\n. Labels are defined by a hyphen (-) preceding the label (\nex: \n\"-First Name\") and are applied to the criteria fields in the other that they are entered.\nView Mode\nList View\n - \nSelecting this option will allow all the records to appear in a list.\nSingle Record View - \nSelecting this option means that each report will be displayed one at a time. \nExternal Access\nInternet Enabled\n - \nToggling on this function will generate a \nURL\n that allows the report to be accessed over the internet without the need for a user to log into the system. This setting is useful for creating \npublic \nreports. \nOData Connector\nToggling on this option will use Open Data Protocol to simplify data-sharing across disparate applications in enterprise, Cloud, and mobile devices.\n This feature will only appear for \nNeo Reports\n; it is not available for new \nClassic Reports. \nDisable Global Template\nToggling on this option will disable the \nGlobal Report Template\n (a personalization of HTML header/footer for all system-based reports) for this specific report. \nInteractive View Display\nNone \nDisplay Link to Interactive View - \nOpen Report Directly in Interactive View -\nTotal Label\nProvide a name for the \nTotal \ncolumn. See \nUsing Total Group Options in Report Builder\n for more./ \nEnable Translation\nAllows report headers and associated charts to use translation options in the system's \nLanguage Library\n.\n See \nUsing Language Translation in Reports\n for more. \nEnable Straight Join\nSee \nStraight Join\n.\nEnable Pivot View\n Enables pivot functionality; this means that when grouping by two different columns, you now have the option to perform an aggregate function and pivot the grouped columns across the x-/y-axis.\n \nThis example report is using \"Pivot View\" with the data grouped by \"type\" and \"status\". The user can choose which group options they wish to view via the drop down.\nMerge Sub-Reports\nMerging of two \nClassic builder type reports \nNo Name URL Parameter\nSee \nEnable URL Parameter Encryption\n. \nHide Custom Export\nThis will hide the ability for a user to \nCustom Export\n this report by hiding the custom export icon \n.\nHide File Export\nThis will hide the ability for a user to \nFile Export\n this report by hiding the export icon \nReport and Field Caching\nScrolling further down the \nAdvanced Settings \ntab will allow you to modify the functionality of caching for reports and field. \n \nReport Caching\nCaching Options: Enable - \nEnabling caching is a useful function that can help improve loading time and reduce the processing load on the server. This function is best for complex reports and reports that are accessed regularly. \n \nDo not \nenable general caching for reports that \nprompt the user for criteria\n. \nCaching Options: Cache By User - \nCaching by user\n must be used for\n when a report includes \ncriteria\n to filter based on the user that opens the report (i.e. =@userid@). \nCache Life Span - \nEnter an appropriate cache life span in minutes. Therefore, rather than re-creating the report each time it is run, caching stores the results for the duration specified in this field. The first time a report is viewed, it will be created by querying the database and live data will be displayed. Anyone viewing the report after this and \nwithin \nthe life span will see a snapshot of the report from the cache. \n Changes to underlying data will not be reflected in the report during the \nCache Life Span. \n The report will be updated only once the life span has expired. \n In general, \nSub-Reports\n should not be cached, though the parent report can be cached if appropriate. \nField Caching\nFrequency - \nThe frequency of field caching can be set as follows:\n \nDisabled: \nDefault setting; indicates a report will not run on an automated schedule\n \nDaily: \nThe report will run every morning. \n \nWeekly: \nThe report will run every Sunday.\n \nMonthly: \nThe report will run on the first of every month. \nIdentifier Column - \nSelect a report column from those available in the \nReport Builder\n that will uniquely identify the record to update. This is the \nmatch field \nas it indicates the field that allows the system to know which record to update. \nColumn Field Value Column - \nSelect a report column from those available in the \nReport Builder\n for the data that you wish to store; this acts as a \nsource field \nas the setting represents the values that the system will use to update the \nCustom Field \nspecified in the next field. \nCustom Field - \nSelect a dataset-specific \nCustom Field\n to where the dataset will be stored. This is the \ndestination field \nas the custom field will be updated each time that the report is run. \nLast Run - \nThis will display a date and time stamp of the last time that the field caching/scheduled report was run. \nInternet-Enabling Reports\nThe ability to \nInternet Enable \na report is useful because it will make that report public, presenting real-time reports on the Internet - it generates a \nURL\n relating to that report that can then be linked to your website, or sent as a link in an \nemail\n or \nemail broadcast\n or other communication method. \n The person who clicks the link does \nnot \nneed to have login access to your \nSmartSimple\n system. \n Once the link is clicked, the report is processed and the results are displayed accordingly. \nThe following steps are for reports made with Report Builder Neo, although the Classic Report Builder undergoes a very similar process for Internet Enabling reports. \n1. Once you have the \nReports \nsection of your system open (see \nAccessing Reports\n if needed), click on the \npencil icon \nnext to a specific report name to \nEdit \nit. \n2. Click on the second tab labelled \nAdvanced\n. \n3. Look for the field \nExternal Access. \nToggle \non \nthe \nInternet Enabled \nfeature. \n \nAccess Key\nIf you want to password-protect your Internet-enabled report, write in a customized access key that the user must have in order to see the results of the report, even if they have access to the URL. \n The access key will append itself to the URL of the report. \n By allowing people to view an Internet-enabled report specifically with an access key, you can remove access easily by simply changing the access key. \nURL\nThis is the conventional URL that will display the results of the report on the \nbrowser\n that the user is using, as a web page.\nExport URL\nThis URL, when inputted into a \nbrowser\n, will enable the report to be downloaded onto the receiver's computer, and can be opened in a number of different file formats that they can select from.\nExport URL-XML\nThis URL, when inputted into a \nbrowser\n, will enable the report to be downloaded onto the receiver's computer in an \nXML\n \nformat. \n The \nURLs\n for reports that are Internet-enabled are automatically generated. Simply copy and paste them to use it.\n4. Click \nSave. \n \nNote: \nYou can always tell whether a report is properly Internet-enabled if it has a \nblack dot \nin the \nInternet-Enabled \ncolumn on the main reports list view, found from \nTools > Reports. \nSee screenshot below. \n \nLanguage Translation for Internet-Enabled Reports\nUsers can now add a parameter to the Internet Enabled URL of all reports so the results and column headers can be made language-specific, if corresponding translations have been configured for the fields.\nThe parameter used is \nlang\n followed by the ID of the \nlanguage\n that the report should be translated into.\nIn the example below the parameter \nlang=2\n is used to translate the report into French.\nhttps://test.smartsimpleqa.com/ex/ex_viewreport.jsp?key=&token=%40GgUNSxoaeFxbSxRdSRxRRVdQZFB3H3Q~&lang=2\nReports vs List Views\nIn terms of displaying data, \nSmartSimple\n offers numerous methods to do so. In particular, \nlist views\n \nand \nReports \nare two of the most popular and highly configurable functions. A critical question is therefore \nwhen \nis it appropriate to use a list view, and when is it appropriate to build a report? For more in-depth information, see our \nList View and Reports - Why?\n page. \nBenefits \nThings to Note\nA report is needed if your situation includes \nat least one \nof the following criteria: \n You need more than 30 columns\n You need formulae or calculations \n You need more complex aggregations than a simple total (e.g. count distinct, maximum, sum, group by, total by) \n You need an \nOData\n connection or you need to link multiple datasets that are not automatically connected (e.g. multiple \nUniversal Tracking Applications™s\n) \nReports are more sensitive because of the following: \n Only 5 criteria are permitted compared to the limitless criteria on a \nlist view\n \n Requires more knowledge of SQL and reporting - although if a user is familiar with \nMS Access \nor \nTableau, \nthis is definitely sufficient, as the programs use the same principles \n Less dynamic visibility \nSee Also\n \nList View and Reports - Why?\n \n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Reports&oldid=41879\n’ \nCategory\n: \nReports",
  "links": [
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Instance",
    "https://wiki.smartsimple.com/wiki/Interface",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/Exporting_Reports",
    "https://wiki.smartsimple.com/wiki/Internet_Enabled_Reports",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/Role_Based_Security",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Entity",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Report_Builder_(Neo)",
    "https://wiki.smartsimple.com/wiki/Report_Builder_(Neo)",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/List_View_Overview",
    "https://wiki.smartsimple.com/wiki/Global_Report_Template",
    "https://wiki.smartsimple.com/wiki/Creating_a_Dashboard_to_Display_a_Set_of_Charts",
    "https://wiki.smartsimple.com/wiki/Web_Access_Statistics",
    "https://wiki.smartsimple.com/wiki/Internet_Enabled_Reports",
    "https://wiki.smartsimple.com/wiki/List_View_Overview",
    "https://wiki.smartsimple.com/wiki/Personal_Settings",
    "https://wiki.smartsimple.com/wiki/Reports#Report_Tabs",
    "https://wiki.smartsimple.com/wiki/Reports#Permissioning_Reports",
    "https://wiki.smartsimple.com/wiki/Internet_Enabled_Reports",
    "https://wiki.smartsimple.com/wiki/Determining_the_reportid",
    "https://wiki.smartsimple.com/wiki/Reports#Accessing_Reports",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/Report_Builder_(Neo)",
    "https://wiki.smartsimple.com/wiki/Recordsets",
    "https://wiki.smartsimple.com/wiki/List_View_Overview",
    "https://wiki.smartsimple.com/wiki/Report_Template",
    "https://wiki.smartsimple.com/wiki/Reports#Advanced_Settings_of_Reports",
    "https://wiki.smartsimple.com/wiki/Notes_Overview",
    "https://wiki.smartsimple.com/wiki/Recordsets",
    "https://wiki.smartsimple.com/wiki/Reports#Advanced_Settings_of_Reports",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/File_Export",
    "https://wiki.smartsimple.com/wiki/Custom_Export",
    "https://wiki.smartsimple.com/wiki/Report_Template",
    "https://wiki.smartsimple.com/wiki/Building_Sub-Reports",
    "https://wiki.smartsimple.com/wiki/Reports_Based_on_Multiple_Tables_-_Overview#Inner_and_Outer_Joins",
    "https://wiki.smartsimple.com/wiki/Reports#Report_Builder_Neo_-_Column_Settings",
    "https://wiki.smartsimple.com/wiki/Reports#Report_Builder_Neo_-_Column_Settings",
    "https://wiki.smartsimple.com/wiki/Recordsets",
    "https://wiki.smartsimple.com/wiki/Client_Categories",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/Template",
    "https://wiki.smartsimple.com/wiki/Type",
    "https://wiki.smartsimple.com/wiki/User_Role",
    "https://wiki.smartsimple.com/wiki/Creating_Summary_Reports",
    "https://wiki.smartsimple.com/wiki/Using_Total_Group_Options_in_Report_Builder",
    "https://wiki.smartsimple.com/wiki/Sort_By",
    "https://wiki.smartsimple.com/wiki/Calculated_Field",
    "https://wiki.smartsimple.com/wiki/Criteria",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/Report_Template",
    "https://wiki.smartsimple.com/wiki/Setting_Text_Criteria_%E2%80%93_Logical_Operators_in_a_Report",
    "https://wiki.smartsimple.com/wiki/Using_Wildcard_Criteria_in_Reports",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Using_Date_Criteria",
    "https://wiki.smartsimple.com/wiki/Accessing_the_Current_Date_in_a_Report",
    "https://wiki.smartsimple.com/wiki/Calculated_Field",
    "https://wiki.smartsimple.com/wiki/Calculated_Field",
    "https://wiki.smartsimple.com/wiki/Creating_Summary_Reports",
    "https://wiki.smartsimple.com/wiki/Using_Total_Group_Options_in_Report_Builder",
    "https://wiki.smartsimple.com/wiki/Sort_By",
    "https://wiki.smartsimple.com/wiki/Criteria",
    "https://wiki.smartsimple.com/wiki/Display_order#Drag_and_Drop_Re-Order_Fields",
    "https://wiki.smartsimple.com/wiki/Reports#Classic_Report_Builder_Help_Panel",
    "https://wiki.smartsimple.com/wiki/User",
    "https://wiki.smartsimple.com/wiki/Prompting_for_Criteria_in_Reports",
    "https://wiki.smartsimple.com/wiki/Criteria",
    "https://wiki.smartsimple.com/wiki/Custom_Fields",
    "https://wiki.smartsimple.com/wiki/List_View_Overview",
    "https://wiki.smartsimple.com/wiki/Internet_Enabled_Reports",
    "https://wiki.smartsimple.com/wiki/URL",
    "https://wiki.smartsimple.com/wiki/Odata_Overview",
    "https://wiki.smartsimple.com/wiki/Global_Report_Template",
    "https://wiki.smartsimple.com/wiki/Using_Total_Group_Options_in_Report_Builder",
    "https://wiki.smartsimple.com/wiki/Language_Library",
    "https://wiki.smartsimple.com/wiki/Using_Language_Translation_in_Reports",
    "https://wiki.smartsimple.com/wiki/Straight_Join",
    "https://wiki.smartsimple.com/wiki/Enable_URL_Parameter_Encryption",
    "https://wiki.smartsimple.com/wiki/Custom_Export",
    "https://wiki.smartsimple.com/wiki/File_Export",
    "https://wiki.smartsimple.com/wiki/Prompting_for_Criteria_in_Reports",
    "https://wiki.smartsimple.com/wiki/Building_Sub-Reports",
    "https://wiki.smartsimple.com/wiki/Field_Caching",
    "https://wiki.smartsimple.com/wiki/Report_Builder",
    "https://wiki.smartsimple.com/wiki/Report_Builder",
    "https://wiki.smartsimple.com/wiki/Custom_Field",
    "https://wiki.smartsimple.com/wiki/URL",
    "https://wiki.smartsimple.com/wiki/Email",
    "https://wiki.smartsimple.com/wiki/Overview_of_the_Email_Broadcast_Application",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/Reports#Accessing_Reports",
    "https://wiki.smartsimple.com/wiki/Reports#Advanced_Settings_of_Reports",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/Browser",
    "https://wiki.smartsimple.com/wiki/URL",
    "https://wiki.smartsimple.com/wiki/Language",
    "https://wiki.smartsimple.com/wiki/SmartSimple",
    "https://wiki.smartsimple.com/wiki/List_View_Overview",
    "https://wiki.smartsimple.com/wiki/List_View_and_Reports_-_Why%3F",
    "https://wiki.smartsimple.com/wiki/Odata_Overview",
    "https://wiki.smartsimple.com/wiki/UTA",
    "https://wiki.smartsimple.com/wiki/List_View_Overview",
    "https://wiki.smartsimple.com/wiki/List_View_and_Reports_-_Why%3F"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/3/33/Reporting-componets-800w_%282%29.jpg",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/d/d5/Roles_and_security_from_menu.png",
    "https://wiki.smartsimple.com/images/7/7e/Action_permission.png",
    "https://wiki.smartsimple.com/images/5/5e/Reports_manager_permissions.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/9/94/Report.png",
    "https://wiki.smartsimple.com/images/7/72/Report_list.png",
    "https://wiki.smartsimple.com/images/d/d2/Reports_category.png",
    "https://wiki.smartsimple.com/images/f/fa/Buttons_for_reports.png",
    "https://wiki.smartsimple.com/images/9/92/NewRunReportIcon2.png",
    "https://wiki.smartsimple.com/images/1/16/ReportCustomExportIcon.png",
    "https://wiki.smartsimple.com/images/4/4e/ReportFileExportIcon.png",
    "https://wiki.smartsimple.com/images/a/a7/ReportEditIcon2.png",
    "https://wiki.smartsimple.com/images/c/cf/New_report_pag.png",
    "https://wiki.smartsimple.com/images/7/70/Editing_reports.png",
    "https://wiki.smartsimple.com/images/9/98/Tble.png",
    "https://wiki.smartsimple.com/images/4/4c/Report_builder_icon.png",
    "https://wiki.smartsimple.com/images/1/1c/Classic_report_builder.png",
    "https://wiki.smartsimple.com/images/4/4b/Reps6.png",
    "https://wiki.smartsimple.com/images/4/4d/Report_builder_classic_buttons.png",
    "https://wiki.smartsimple.com/images/4/49/Report_builder_classic_help.png",
    "https://wiki.smartsimple.com/images/4/4c/Report_builder_icon.png",
    "https://wiki.smartsimple.com/images/0/0c/Report_builder_new.png",
    "https://wiki.smartsimple.com/images/3/39/Report_neo_date_time.png",
    "https://wiki.smartsimple.com/images/6/6f/Report_neo_group_by.png",
    "https://wiki.smartsimple.com/images/c/cb/Report_builder_neo_search_field_box.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/e/e6/Batch_delete_repeorts.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/b/bc/Delete_report.png",
    "https://wiki.smartsimple.com/images/2/2a/Deleted_reports_section.png",
    "https://wiki.smartsimple.com/images/5/5e/052919_MenuIcon.png",
    "https://wiki.smartsimple.com/images/6/66/Restore_or_purge_deleted_reports.png",
    "https://wiki.smartsimple.com/images/0/0f/Advanced_report_functions.png",
    "https://wiki.smartsimple.com/images/0/01/2019-05-ticket-85865-1.png",
    "https://wiki.smartsimple.com/images/1/16/ReportCustomExportIcon.png",
    "https://wiki.smartsimple.com/images/4/4e/ReportFileExportIcon.png",
    "https://wiki.smartsimple.com/images/d/d8/Report_more_advanced.png",
    "https://wiki.smartsimple.com/images/d/d9/Report_internet_enable.png",
    "https://wiki.smartsimple.com/images/4/4f/Internet_enabled_report.png"
  ]
}