{
  "url": "https://wiki.smartsimple.com/wiki/Single_Sign-On",
  "title": "Single Sign-On",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nSAML 2.0\n2.1\n \nPrerequisites\n2.2\n \nService Provider Configuration - SmartSimple\n2.2.1\n \nMandatory Settings\n2.2.2\n \nAdditional Settings\n2.2.2.1\n \nUser Creation Option (JIT Provisioning)\n2.2.2.2\n \nOptional Attibutes\n2.2.2.3\n \nRole Mapping\n2.2.2.4\n \nMulti Environment Support\n2.2.3\n \nX.509 Certificate on the SP-Initiated SSO\n2.3\n \nIdentity Provider Configuration - Client-Side System\n2.3.1\n \nActive Directory Federation Services (ADFS)\n2.3.2\n \nAzure Identity Provider\n2.3.3\n \nOKTA\n2.4\n \nSAML Assertion Example\n2.5\n \nSAML Authorization Request Example\n3\n \nAdding URL Redirect in the Login Page\n4\n \nTroubleshooting\n5\n \nExpected Behaviour for Role Mapping\n6\n \nExample of SSO configuration in SmartSimple\n6.1\n \nConfiguration for SSO in production instance\n6.2\n \nConfiguration for multi-environment SSO\n6.3\n \nConfiguration for two IdP within production instance\nOverview\nSmartSimple provides Single Sign-On (SSO) integration through \nSAML 2.0\n. It should be noted that SSO is just a subset of federated identity management, as it relates only to authentication, and not account management or synchronization with SmartSimple.\nImplementation of SSO requires configuration both within SmartSimple and within the system that will provide the authentication.\nSmartSimple's implementation of SSO acts as the \nService Provider\n and assumes the client has the infrastructure and resources to host, configure, and manage the \nIdentity Provider\n service. Please contact your account manager or \nSmartSimple Support\n for further information.\nSAML 2.0\nSmartSimple supports SAML (\nSecurity Assertion Markup Language\n) 2.0 as the Service Provider through our own proprietary implementation of this standard.\nIdentity Provider-initiated authentication is supported, meaning the end user will first authenticate on the client-side system/infrastructure and then be forwarded to SmartSimple. The client Identity Provider service will construct a base64-encoded SAML assertion and send this to the user's browser. The user's browser will then relay this assertion to the SmartSimple server for SSO authentication.\nAfter the November 2022 upgrade, Service Provider-initiated authentication is now supported. The Service Provider sends the SAML Authorization Request message and forwarding the user to the client Identity Provider service for authentication. The end user will login from the client-side Identity Provider. After the end user has been authenticated, the client Identity Provider service will redirect them back to the SmartSimple instance along with a base64-encoded SAML assertion response. The user's browser will then relay this assertion to the SmartSimple server for SSO authentication.\nPrerequisites\n You must provision your own Identity Provider service, third-party or otherwise, for use with this feature. Enabling and maintaining the Identity Provider is your responsibility.\n You must provide SmartSimple with a public key in base64-encoded X.509 Certificate format for digital signature validation.\nService Provider Configuration - SmartSimple\nWithin SmartSimple, SSO settings are accessed through the \nGlobal Settings\n →\n Integration\n \ntab.\n \nNavigating to the SSO configuration.\nYou will be redirected to the List View of the SSO configuration page. Click on the “+” icon to create a new SSO configuration on the instance:\n \nSSO configuration settings.\nMandatory Settings\n \nSSO Alias\n - used to identify the SSO connection and should be configured by default to be 'SAML2'. If multiple SSO connections are to be configured then you may include an additional element on the client-side assertion named 'SSOModule' to specify the SmartSimple connection by matching a unique \"SSO Alias\" value.\n \nUnique Identifier Field (UID)\n - used to identify the user account and needs to be an attribute that is unique to each user in SmartSimple. The value for the attribute \"NameID\" from the SSO assertion should match the value from the field selected in the dropdown list.(typically e-mail address or employee ID).\n \nX509Certificate (SAML2 Only)\n - the signing certificate to be provided by the client. The formatting of this should be the certificate value without the \"begin certificate\" and \"end certificate\" header and footer lines. Also, depending on how the client-side system sends this value within the SAML assertion the certificate value will typically be formatted to just a single line but could also be multiple lines and so must be entered into SmartSimple in the same format.\n \nTimestamp Time Zone\n - used to read the incoming SSO message timestamp from Identity Provider configured time zone.  Default value is \"--UTC/GMT--\". Settings will need to be adjusted when the error \"SAML response expired\" is found in the log file during debug mode.\n \nThird-Party Identity Provider\n- specify what SSO authentication method is used  (Identity-Provider initiated  or  Service Provider-initiated)\n \nEndpoint\n - specify the redirect IdP-initiated or SP-Initiated endpoint.  This redirect will be rendered in the \nLogin Page\n.\n It is also recommended to disable the Session Timeout Alert setting within the \nGlobal Settings\n → \nSecurity\n \nsection as that feature would not be applicable to users logged in through single sign-on.\n By default, SSO acts as an additional method of authentication. If you wish to enforce the use of SSO, and restrict the regular username and password authentication, you can do so with the \nGlobal Settings\n → \nIntegration\n → \nEnforce SSO\n setting which allows you to restrict a set of user roles to only be able to login through SSO.\nAdditional Settings\n \nBypass Two Factor Authentication\n - \nBypass Two Factor Authentication\n when logged in with SSO\n \nEnable Debug Mode\n - When enabled, it ignores the SSO time stamp and output SSO assertion message in the \nCongifuration Error Log\n \nDefault Landing Page\n - used to specify an initial landing page within SmartSimple instance. This should be a relative path (e.g. /iface/ex/ax_index.jsp).\n \nLogout Redirect URL\n - redirect url when SSO users logout\n \nEnable Logout Assertion\n - will send a logout assertion to the Identity Provider to log out of that session\n Additional settings for \nEnable Logout Assertion\n:\n \nAssertion Target URL\n - target site url\n \nAssertion Private Key\n - private key to establish connection with the target site.\nUser Creation Option (JIT Provisioning)\nWhen users need to be created on the fly after SSO authentication, the following configuration settings are available:\n \nCreate New User on No Match\n– when enabled, it will create new user when no matching is found and will allow login for new user upon successful authentication\n \nDefine User Roles Through Custom Attribute\n– when enabled, it will use the SSO assertion “Roles” attribute to define users’ system roles.\n \nDefault User Role When No Matching Role Found \n*\n– selected role from this dropdown will be assigned to new created users only if “Roles” attribute in the assertion is empty, excluded or if the role name value does not match any existing role in your SmartSimple instance.\n \nDefault New User Status \n– assigned user’s status for new users only\n \nCreate New Organization When No Match Found \n– when enabled, it will create a new parent organization when no matching organization exists your SmartSimple instance.\n \nDefault Organization \n*\n– assigned user’s parent organization for new users\n \nDefault New Organization Status\n– assigned parent organization’s status for new organizations\n* \n- mandatory fields when creating users thru SSO.\nIn addition, optional attributes can be added in the assertion to create the user and these standard fields (First name, Last name, Email) will be populated.\nIf the selected Unique Identifier Field (UID) is not the standard email address, the custom field selected will also be populated in the JIT provisioning.\n \nSSO User Creation Settings.\nOptional Attibutes\nThe following optional attributes can be used in the assertion. Please note that they are case sensitive and should be labelled exactly.\n \nSSOModule\n - used to specify the SmartSimple SSO connection when there are multiple connections configured. i.e. \"SAML2\" for prod, \"SSOBK\" for backup instance, \"SSODEV\" for dev instance, \"SSOTest\" for test instance. Note that the attribute name and attribute value are case sensitive \n \nEmail\n \nFirst name\n \nLast name\n \nDepartment\n - used to update the user's organization. This will attempt to match an organization by name and will move the user to that organization if found.\n \nRoles\n - used to update the user's roles in SmartSimple for new users. This should be a comma delimited list of SmartSimple user roles (by name) to be assigned to the user.\n \nLanguage\n - used to specify the initial language displayed to the user. This should be an integer value that corresponds with a language ID value in SmartSimple (e.g. 1=English).\nRole Mapping\nApply Role Mapping to new and existing users to control user roles within your SmartSimple system. Define the list of system roles you wish to be monitored upon each SSO authentication by a user. With external role mapping enabled, a user's roles within the system will be adjusted according to the role attributes explicitly provided by the assertion. Based upon the role mapping below, the user will be provisioned with all the roles as defined by the assertion attributes, and will also be stripped of any roles that they may currently possess that are listed in this setting but were not defined in the assertion attributes system.\n \nRoles to be Monitored \n– define the list of system roles you wish to be monitored upon each SSO authentication by a user\n \nMapping \n– map all roles indicated above to the external role name from the client Identity Provider service\nDetailed expected behaviour of this settings can be found in Section 4\nExample of attribute values in\n \nRoles\nExample 1 - Attribute format from ADFS\n<Attribute Name=\"Roles\">\n<AttributeValue>Role 1</AttributeValue>\n<AttributeValue>Role 2</AttributeValue>\n</Attribute>\nExample 2 - Attribute format from Azure\n<Attribute Name=\"Roles\">\n<AttributeValue>Role 1,Role 2</AttributeValue>\n</Attribute>\nMulti Environment Support\nWhen you have multiple environments with unique SSO configurations (such as production, testing, development and backup), group them under the same MES group identifier. This will give you a consistent configuration of your login page across multiple environments. The system will then detect and render the appropriate SSO login link using the MES Environment Identifier.\n \nMES Group Identifier\n – assign the same MES Group Identifier name to the SSO configuration for your development, production, testing and backup environments.\n \nMES Environment Identifier \n– enter the domain of the SmartSimple environment that will display tis SSO service endpoint on the login page i.e. alias.smartsimple.com or  alias.smartsimplebk.com\nAdditional settings to be configured is from the main login page (\nWaffle\n → \nGlobal Settings\n → \nBranding\n → \nLogin Pages\n) under the Single Sign-On section, select the MES Group Identifier from the dropdown list, and add button label i.e. \nEmployee Login\n.\nX.509 Certificate on the SP-Initiated SSO\nIn the July 2023 upgrade, a new feature to support X.509 signing certificate for single sign-on (SSO) authorization requests has been added.\nIf you are using a service provider-initiated SSO, a signed authentication request embedded with the signed value and the X.509 certificate will be sent to the identity provider (IdP).\nThe new setting is located at Global Settings > Integrations tab > Single Sign-on > Edit a SP-initiated SSO and toggle on Sign authentication request sent to identity provider (IdP).\nIdentity Provider Configuration - Client-Side System\nThe elements required for setup of the client-side identity provider connection are listed below.\n Unique user identifier - within the SAML assertion, this value can be sent in the standard element: \"NameID\"\n Assertion Consumer Service URL - this will be equal to '/SAML2/' appended to your SmartSimple instance URL, e.g. \nhttps://alias.smartsimple.com/SAML2/\n.\n Service Provider's Entity ID - this can be the URL to your SmartSimple system, e.g. \nhttps://alias.smartsimple.com/\n.\n Service Provider metadata XML - the following is an example service provider metadata that can be used, however you must first replace every instance of 'alias.smartsimple.com' instead with the URL to your SmartSimple system.\n<?xml version=\"1.0\"?>\n<md:EntityDescriptor xmlns:md=\"urn:oasis:names:tc:SAML:2.0:metadata\" xmlns:ds=\"http://www.w3.org/2000/09/xmldsig#\" entityID=\"https://alias.smartsimple.com/\">\n <md:SPSSODescriptor AuthnRequestsSigned=\"false\" WantAssertionsSigned=\"true\" protocolSupportEnumeration=\"urn:oasis:names:tc:SAML:2.0:protocol\">\n <md:NameIDFormat>urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified</md:NameIDFormat>\n <md:AssertionConsumerService Binding=\"urn:oasis:names:tc:SAML:2.0:bindings:HTTP-POST\" Location=\"https://alias.smartsimple.com/SAML2/\" index=\"1\"/>\n </md:SPSSODescriptor>\n <md:ContactPerson contactType=\"technical\">\n <md:GivenName>SmartSimple Support</md:GivenName>\n <md:EmailAddress>support@smartsimple.com</md:EmailAddress>\n </md:ContactPerson>\n <md:ContactPerson contactType=\"support\">\n <md:GivenName>SmartSimple Support</md:GivenName>\n <md:EmailAddress>support@smartsimple.com</md:EmailAddress>\n </md:ContactPerson>\n</md:EntityDescriptor>\nThe following steps are a high-level approximation and example of how one may setup minimal SSO functionality.\nAdditional steps may be needed for your Identity Provider.\nThese do may constitute recommended best practices, and we recommend you consult the documentation offered by your Identity Provider.\nActive Directory Federation Services (ADFS)\nIf using ADFS refer to the below steps as related to SmartSimple for setup. Some steps unrelated to your SmartSimple configuration have been omitted.\n Add a new \"Relying Party Trust\".\n \"Select Data Source\" - Import the Service Provider metadata XML file obtained from SmartSimple.\n \"Display Name\" - Give the trust a display name, e.g. 'SmartSimple'.\n Finish the setup, and then return to the \"Claim Rules\" editor, and select the \"Issuance Transform Rules\" tab and add a new rule. Set the \"Rule Type\" to use the 'Send LDAP Attributes as Claims' template and configure the mapping to the agreed upon user identifier (e.g. LDAP attribute 'E-Mail-Addresses' to Outgoing Claim Type 'NameID'). Depending on your ADFS version and setup you may instead need to create two rules, one to map the attributes E-mail to E-mail, and then a second rule to transform the E-mail to the outgoing NameID.\n To test or use this connection use your internal ADFS URL and specify the loginToRp parameter as the SmartSimple SAML entity ID, e.g. \nhttps://adfs.yourlocaldomain.com/adfs/ls/idpinitiatedsignon.aspx?loginToRp=https://alias.smartsimple.com/\n.\n If you aren't automatically redirected into SmartSimple you may need to have RelayState enabled in ADFS, and then use a RelayState parameter to achieve this, e.g. \nhttps://adfs.yourlocaldomain.com/adfs/ls/idpinitiatedsignon.aspx?RelayState=https://alias.smartsimple.com/\n.\nAzure Identity Provider\nConfiguration items listed are specifics SSO to work in SmartSimple:\n Log into Azure as admin\n Go to Azure Active Directory → Enterprise Application → Create a new application\n Select Non-Gallery Application and then add your new application, enter the name of your application i.e. \"SmartSimple SSO\" and then press ADD\n Select Single Sign-ON and then select SAML\n \nBasic SAML Configuration:\n \nIdentifier (Entity ID)\n: \nhttps://alias.smartsimple.com\n \n \nReply URL (Assertion Consumer Service URL)\n: \nhttps://alias.smartsimple.com/SAML2/\n User Attributes & Claims\n 1. Required claim\n \nUnique User Identifier (Name ID)\n: this can be the user.mail or user.employeeid or any unique identifier in the user profile fields\n 2. Additional claims - additional attributes are needed when user will be created on the fly\n \nFirst name\n: user.givenname\n \nLast name\n: user.lastname\n \nEmail\n: user.mail\n \nDepartment\n: user.department\n \nRoles\n: user.assignedroles\n \nSSOModule\n: constant value that is going to be used in the SmartSimple configuration \"SSO Alias\"\n Note that all attribute names are case sensitive and should be named as indicated above.  First name, Last name and Email are mandatory to create a new user. \n To test, go to \nSingle sign-on\n, click on \nTest this application\n from the tab header. Select \"\nSign in as current user\n\" and click on the \nTest sign in\n button. Please make sure that the current user is existing in the SmartSimple instance to have a successful SSO login.\nAfter configuration has been completed, provide the following to SmartSimple:\n x509 certificate - download the \nFederation Metadata XML (\nFound under \nSingle Sign-on\n  →  \nSAML Certificates\n)\n Value used for the NameID - this will be used as the identifier between SP and IdP\n URL Redirect\n \"User Access URL\" for IdP-initiated SSO (Found under \"\nProperties\n\")\n \"Login URL\" for SP-initiated SSO (Found under \nSingle Sign-on\n  →  \nSet up 'Application Name')\nOKTA\n Log in to OKTA admin account\n Click on the \nApplication\n tab and select Applications.\n Click on the \nAdd Application\n button and click on\n Create New App\n to create a new application for SmartSimple.\n Set the \nPlatform\n as \nWeb\n, the \nSign on method\n as \nSAML 2.0\n and Create a new application.\n In the \nGeneral Settings\n page, provide a name for the application i.e. SmartSimple SSO\n In the \nConfigure SAML\n tab, under SAML Settings, \n \nSingle sign-on URL\n:     \nhttps://alias.smartsimple.com/SAML2/\n check on the tick box: Use this for Recipient URL and Destination URL\n \nRecipient URL\n:     \nhttps://alias.smartsimple.com/SAML2/\n \nDestination URL\n:     \nhttps://alias.smartsimple.com/SAML2/\n     \n \nAudience URI  (SP Entity ID)\n:     \nhttps://alias.smartsimple.com/SAML2/\n \nDefault RelayState\n: \n \nName ID format\n: EmailAddress\n \nApplication username\n: Email\n Configuration Settings below have default value: \n \nUpdate application username on\n: Create and update\n \nResponse\n:     SIgned\n \nAssertion Signature\n:     Signed\n \nSignature Algorithm\n  RSA-SHA256\n \nDigest Algorithm\n:    SHA256\n \nAssertion Encryption\n:     Unencrypted\n \nAttribute Statements\n \nFirst name\n:  user.firstName\n \nLast name\n:   user.lastName\n \nEmail\n:  user.email\n \nDepartment\n \nRoles\n \nSSOModule\nNote that all attribute names are case sensitive and should be named as indicated above. First name, Last name and Email are mandatory to create a new user.\nAfter configuration in OKTA has been completed, provide the following to SmartSimple:\n x509 certificate - found under \nSign On\n tab, SAML Set up \"\nView SAML set up instructions\n\"\n Value used for the NameID - this will be used as the identifier between SP and IdP\n URL Redirect - \"Embed Link\" for IdP-initiated SSO (Found under \"\nGeneral\n\" tab in the \"\nApp Embed Link\n\" Section)\nSAML Assertion Example\nThe following is an example of a SAML Assertion :\n<?xmlversion=\"1.0\" encoding=\"UTF-8\"?>\n<samlp:Response xmlns:samlp=\"urn:oasis:names:tc:SAML:2.0:protocol\" Destination=\"https://alias.smartsimple.com/SAML2/\" IssueInstant=\"2014-07-12T14:17:03.063Z\" ID=\"BYavZkuNtRHC5rEPhIAEQrys1Wb\" Version=\"2.0\">\n <saml:Issuer xmlns:saml=\"urn:oasis:names:tc:SAML:2.0:assertion\">sso:saml2:alias:stage:SmartSimple:idp</saml:Issuer>\n <ds:Signature xmlns:ds=\"http://www.w3.org/2000/09/xmldsig#\">\n <ds:SignedInfo>\n <ds:CanonicalizationMethod Algorithm=\"http://www.w3.org/2001/10/xml-exc-c14n#\"/>\n <ds:SignatureMethod Algorithm=\"http://www.w3.org/2000/09/xmldsig#rsa-sha1\"/>\n <ds:Reference URI=\"#BYavZkuNtRHC5rEPhIAEQrys1Wb\">\n <ds:Transforms>\n <ds:Transform Algorithm=\"http://www.w3.org/2000/09/xmldsig#enveloped-signature\"/>\n <ds:Transform Algorithm=\"http://www.w3.org/2001/10/xml-exc-c14n#\"/>\n </ds:Transforms>\n <ds:DigestMethod Algorithm=\"http://www.w3.org/2000/09/xmldsig#sha1\"/>\n <ds:DigestValue>+2uvXQh+d65mNWs0G6FBf4igIxU=</ds:DigestValue>\n </ds:Reference>\n </ds:SignedInfo>\n <ds:SignatureValue>LEOCPec/eNBMqBV7A99...</ds:SignatureValue>\n </ds:Signature>\n <samlp:Status>\n <samlp:StatusCodeValue=\"urn:oasis:names:tc:SAML:2.0:status:Success\"/>\n </samlp:Status>\n <saml:Assertion xmlns:saml=\"urn:oasis:names:tc:SAML:2.0:assertion\" Version=\"2.0\" IssueInstant=\"2014-07-12T14:17:03.246Z\" ID=\"X14MvZtPaqyUjfFCbehto32uDTG\">\n <saml:Issuer>sso:saml2:alias:stage:SmartSimple:idp</saml:Issuer>\n <saml:Subject>\n <saml:NameID Format=\"urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified\">T5014CD</saml:NameID>\n <saml:SubjectConfirmation Method=\"urn:oasis:names:tc:SAML:2.0:cm:bearer\">\n <saml:SubjectConfirmationData NotOnOrAfter=\"2014-07-12T14:22:03.246Z\" Recipient=\"https://alias.smartsimple.com/SAML2/\"/>\n </saml:SubjectConfirmation>\n </saml:Subject>\n <saml:Conditions NotOnOrAfter=\"2014-07-12T14:22:03.246Z\" NotBefore=\"2014-07-12T14:12:03.246Z\">\n <saml:AudienceRestriction>\n <saml:Audience>sso:saml2:alias:stage:SmartSimple:sp</saml:Audience>\n </saml:AudienceRestriction>\n </saml:Conditions>\n <saml:AuthnStatement AuthnInstant=\"2014-07-12T14:17:03.246Z\" SessionIndex=\"X14MvZtPaqyUjfFCbehto32uDTG\">\n <saml:AuthnContext>\n <saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:unspecified</saml:AuthnContextClassRef>\n </saml:AuthnContext>\n </saml:AuthnStatement>\n <saml:AttributeStatement xmlns:xs=\"http://www.w3.org/2001/XMLSchema\">\n <saml:Attribute NameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\" Name=\"Email\">\n <saml:AttributeValue xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:type=\"xs:string\">david@email.com</saml:AttributeValue>\n </saml:Attribute>\n <saml:Attribute NameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\" Name=\"First name\">\n <saml:AttributeValue xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:type=\"xs:string\">David</saml:AttributeValue>\n </saml:Attribute>\n <saml:Attribute NameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\" Name=\"Last name\">\n <saml:AttributeValue xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:type=\"xs:string\">Smith</saml:AttributeValue>\n </saml:Attribute>\n <saml:Attribute NameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\" Name=\"Department\">\n <saml:AttributeValue xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:type=\"xs:string\">Shipping</saml:AttributeValue>\n </saml:Attribute>\n <saml:Attribute NameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\" Name=\"Roles\">\n <saml:AttributeValue xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:type=\"xs:string\">Clerk</saml:AttributeValue>\n </saml:Attribute>\n </saml:AttributeStatement>\n </saml:Assertion>\n</samlp:Response>\nSAML Authorization Request Example\nExample below is sent by the Service Provider (SmartSimple) to the Identity Provider in the SP-SSO initiated flow.\n \n <?xml version=\"1.0\" encoding=\"UTF-8\"?>\n <samlp:AuthnRequest xmlns:samlp=\"urn:oasis:names:tc:SAML:2.0:protocol\" xmlns:saml=\"urn:oasis:names:tc:SAML:2.0:assertion\" AssertionConsumerServiceURL=\"https://alias.smartsimpleqa.com/SAML2/\" Destination=\"https://adfs.yourlocaldomain.com/adfs/ls/spinitiatedsignon\" ID=\"alias.smartsimple.com_QADEV_6CD95AEAD41525F565318B82A46B022E\" IssueInstant=\"2023-01-05T13:56:36Z\" ProtocolBinding=\"urn:oasis:names:tc:SAML:2.0:bindings:HTTP-POST\" ProviderName=\"aliasname\" Version=\"2.0\">\n <saml:Issuer>https://alias.smartsimple.com</saml:Issuer>\n <samlp:NameIDPolicy AllowCreate=\"true\" Format=\"urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified\"/>\n <samlp:RequestedAuthnContext Comparison=\"exact\">\n <saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml:AuthnContextClassRef>\n </samlp:RequestedAuthnContext>\n</samlp:AuthnRequest>\nAdding URL Redirect in the Login Page\nFrom the \nLogin Page\n, the SSO URL redirect can be added to redirect internal users to the client's Identity Provider login page.\nTo configure, go to \n1. Waffle → Global Settings → Branding → Login Pages\n2. From the Login Pages listview, select the default login page to add the SSO URL redirect to.\n3. Go to the Singe Sign-On section, select the MES Group Identifier and add the Link Label i.e. Employee Login\n4. Click Save\nVariables to use in a custom page layout:\n  @ssodisplaylink@    -   the variable to use to add the Link Label and hyperlink in the login template \n @ssotargetlink@   -   the variable to use to retrieve the SSO login URL\n \n \nTroubleshooting\nIn order to retrieve information about why SSO is failing, first toggle the \"Debug Mode\" option within the SSO configuration in SmartSimple, and then test the SSO in order to generate log data within the Configuration Error Log.\n \nSAML failed. No user account found\n This means that a corresponding active user was not found in the SmartSimple instance. Check the [Unique Identifier Field] that is configured in the SSO setting, and then compare the value of the \"NameID\" node sent within the SAML assertion to see if a user with that field value exists in SmartSimple. Check that the user is activated and allows login.\n \nSAML failed. Login session is null  /  Invalid SAML Response\n Check that a matching user account exist\n Check x509 certificate\n Verify that the endpoint in the SSO assertion is correct. There should be a Response node with a parameter like Destination=\"\nhttps://alias.smartsimple.com/SAML2/\n\"\n \nSAML signature validation failed\n This means that the x509 certificate does not match between the SAML Assertion and the value configured in the instance SSO settings.\n \nSAML response expired\n Check the datetime value of the parameter named \nNotAfter\n and \nNotBefore\n within the SAML Assertion and compare these with the expected datetime that the assertion was sent. It is possible to adjust the \nTimestamp Time Zone\n dropdown settings.\n \nInvalid response format. Unparseable date\n.\n Check that the SAML Assertion contains both parameters: \nNotAfter\n and \nNotBefore\n \nSAML processing error\n Check that the value for the \nSSO Alias\n is \"SAML2\" for SSO in production instance\n If it is for a Multi Environment, value in the \nSSO Alias\n should be the value in the attribute \nSSOModule\n \nNo log file is found in SmartSimple\n Verify the parameter: Destination=\"\nhttps://alias.smartsimple.com/SAML2/\n\" from the SSO Assertion.\n Check that the value for the \nSSO Alias\n is \"SAML2\" for SSO in production instance.\n If it is for a Multi Environment, value in the \nSSO Alias\n should be the value in the attribute \nSSOModule\n \nAfter logging thru SSO, you are redirected to \"mesagetype=30\"\n Verify that the alias of the instance is correct. To verify the alias, go to \nWaffle\n → \nGlobal Settings\n → \nBranding\n → \nWeb Alias\n. Make sure that the Web Alias value is the same as the domain alias.\n \nSAML InReponseTo does not match any of the possible Request IDs\n Verify the alias of the instance is correct.\n Verify that the SSO configuration for multiple environment do not have duplicate MES Environment Identifier.\nExpected Behaviour for Role Mapping\n \nRole Mapping\n set to \nDisabled\n / \nCreate New User on No Match\n is \nOFF\n User will not be created if user does not exist in the SmartSimple instance\n Only existing users in the SmartSimple instance will be able to login and no role/status updates for existing users\n \nRole Mapping \nset to \nDisabled\n / \nCreate New User on No Match\n is \nON\n  \n \nDefine User Roles Through Custom Attribute \nis\n OFF\n User will be created with default new user role / default new user status settings if user does not exist in the SmartSimple instance\n \nDefine User Roles Through Custom Attribute \nis\n ON\n User will be created with the roles listed in SSO assertion 'Roles' if users does not exist in the SmartSimple instance  (role names should align with system role names in instance)\n No role/status updates for existing users\n \nRole Mapping\n set to \nEnabled\n / \nCreate New User on No Match\n is \nOFF\n \nCreate New User\n on \nNo Match\n is \nOFF\n User should not be created on the system if not already created when using SSO to access system\n \nCreate New User\n on \nNo Match\n is \nON\n User will be created with default new user role / default new user status settings if user does not exist in the SmartSimple instance\n Existing users: no change for existing roles that are \nNOT\n within the list of \"\nRoles to be Monitored\n\"\n Existing users: roles that are in the list of \"\nRoles to be Monitored\n\" will be updated, based on Role Mapping, the user will be provisioned with all the roles as defined by the assertion attributes, and will be stripped of any roles that they may currently possess that are listed in this setting but were not defined in the assertion attributes.\nExample of SSO configuration in SmartSimple\nConfiguration for SSO in production instance\nSmartSimple SSO Configuration as the Service Provider in the client's SmartSimple production instance.\nA. SSO Configuration\n1. Navigate to \nGlobal Settings\n → \nIntegrations\n tab → \nSingle Sign-On\n section\n2. Click on the “\n+\n” icon to create a new SSO configuration on the instance\n3. Fill out the mandatory fields:\n \nSSO Alias\n: \nSAML2\n (default alias for production instance)\n \nSigning Certificate (X.509)\n: cut and paste the x509 certificate after configuration of the client's Identity Provider\n \nTimestamp Time Zone\n: \n--UTC/GMT--\n (default from the dropdown)\n \nMES Group Identifier\n: \nSSOProd\n (open text field)\n \nMES Environment Identifier\n: \nalias.smartsimple.com\n (client's url production instance)\n \nMethod\n: \nIdentity Provider-initiated\n (default setting)\n \nIdentity Provider Service Endpoint\n: this is the url login redirect.\n For Azure, the value in \nUser Access URL\n (Found under \nProperties\n)\n For OKTA, the value in \nEmbed Link\n (Found under \nGeneral\n tab in the \nApp Embed Link\n Section)\n For ADFS, the redirect is \nhttps://adfs.yourlocaldomain.com/adfs/ls/idpinitiatedsignon.aspx?loginToRp=https://alias.smartsimple.com/\n \nUnique Identifier FIeld (UID)\n: from the dropdown, select \n*E-Mail\n (Default value but it can also be the Employee ID or any unique identifier in the user profile)\n \nBypass Multi-Factor Authentication (MFA)\n: enabled\n4. Click Save\nB. Login Page Configuration\n1. Navigate to \nGlobal Settings\n → \nBranding\n tab → \nLogin Pages\n section\n2. From the \nPrimary\n tab, click on the pencil icon for the first item on the list view - the default Login Page\n3. From the \nGeneral\n tab, go to the \nSingle Sign-On\n section and complete fields:\n \nMES Group Identifier\n: from the dropdown, select \nSSOProd\n \nLink Label\n: \nEmployee Login\n (open text field)\n4. Click Save\nUpon logout, the SSO button will be visible below the the username/password.\n \nSSO User Creation Settings.\nConfiguration for multi-environment SSO\nIf client has 4 environments (Prod, Backup, Dev, Test), settings above will be created one for each environment.\nNote that these settings will need to be copied over to different instances so as when T2P occurs, all settings are existing and copied over and no editing is necessary after T2P.\n \nSSO Alias\nDescription\nMES Group Identifier\nMES Environment Identifier\n1\nSAML2\nThis is used for production instance\nSSOID1\nalias.smartsimple.com\n2\nBKSSO\nSSO for backup instance\nSSOID1\nalias.smartsimplebk.com\n3\nDevSSO\nSSO for DEV instance\nSSOID1\nalias-dev.smartsimple.com\n4\nTestSSO\nSSO for TEST instance\nSSOID1\nalias-test.smartsimple.com\nNotes:\n1. All columns above are open text fields and can be renamed as desired.  Item 1's alias name is the only default/required value for prod.\n2. For items 2 to 4, the attribute name \"\nSSOModule\n\"  with the  \nSSO Alias\n value should be included in the Identity Provider configuration. Note that the SSO Alias is case sensitive and should be labelled exactly.\n3. From the Login Page, the MES Group Identifier will be the same as shown \"\nSSOID1\n\". It will redirect to the correct Redirect URL Endpoint as it will recognize what instance the user is trying to use the SSO in.\nConfiguration for two IdP within production instance\nExample configuration below is when a client has two existing Identity Provider Services.\nAll SSO configuration below are used for client's production instance:\n \nSSO Alias\nDescription\nMES Group Identifier\nMES Environment Identifier\n1\nSAML2\nIdP Service 1\nSSOID1\nalias.smartsimple.com\n2\nSSOProd2\nIdP Service 2\nSSOID2\nalias.smartsimple.com\nNotes:\n1. Item 1 is for client's first Identity Provider Service.\n2.Item 2 is the second configuration for the client's second Identity Provider Service. The attribute name \"\nSSOModule\n\"  with the  \nSSO Alias\n value should be included in the Identity Provider configuration. Note that the SSO Alias is case sensitive and should be labelled exactly.\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Single_Sign-On&oldid=43542\n’ \nCategories\n: \nIntegration\nSystem Integration\nIdentity and Access Management\nSecurity",
  "links": [
    "https://wiki.smartsimple.com/wiki/Single_Sign-On#SAML_2.0",
    "https://wiki.smartsimple.com/wiki/How_the_SmartSimple_Support_Desk_Works",
    "https://wiki.smartsimple.com/wiki/Login_Page",
    "https://wiki.smartsimple.com/wiki/Multi-Factor_Authentication",
    "https://wiki.smartsimple.com/wiki/Configuration_Error_Log",
    "https://wiki.smartsimple.com/wiki/Login_Page"
  ],
  "images": [
    "https://wiki.smartsimple.com/images/5/54/Sso-001.png",
    "https://wiki.smartsimple.com/images/7/7e/Sso-002.png",
    "https://wiki.smartsimple.com/images/e/e3/SSO_UserCreation.png",
    "https://wiki.smartsimple.com/images/1/11/SSO_Login.png"
  ]
}