{
  "url": "https://wiki.smartsimple.com/wiki/Tab_Bar",
  "title": "Tab Bar",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguration—Essentials\n2.1\n \nGiving Roles Access to the Tab Bar Feature\n2.2\n \nEnabling/Disabling the Tab Bar Feature\n3\n \nSettings Explained\nOverview\nSmartSimple’s Tab Bar functionality allows a user to manage multiple tabs within the same instance of SmartSimple. \nIn many use-cases, such as configuration, it is useful to create multiple tabs within a SmartSimple instance to simplify tasks. The tab bar feature allows you to run multiple tabs of a SmartSimple instance simultaneously within a single browser tab. In this way, the feature helps to improve productivity and user experience in SmartSimple.  You will also have the option to enable multitasking, which builds upon the previous split screen features, and allows one to display two tabs of SmartSimple within the same browser window, facilitating effortless side-by-side comparison. \nThis article will show you how to setup and utilize SmartSimple’s Tab Bar functionality within your system.\nNote:\n You will need \nGlobal Administrator\n access to enable the Tab Bar feature.\nConfiguration—Essentials\nGiving Roles Access to the Tab Bar Feature\nTo enable Tab Bar Access for users of your system based on their roles, you must be a Global Administrator. Consider which roles in your system should have access to the Tab Bar feature. In most cases, internal users such as staff or reviewers should be given Tab Bar access, while external users, such as applicants, don’t typically need to access this feature. \n Signed in as Global Administrator – Click on the Menu Icon (9 square grid button). \n \nMenu Icon\n \n Under the \nConfiguration\n sub-section, select \nGlobal Settings\n. \n \nGlobal Settings\n Go to the \nSecurity\n Tab. Then to \nSystem Feature Permissions\n. \n \nSecurity Tab\n \n \nSystem Feature Permissions\n Navigate to the \nFeature Permission\n Tab, and scroll down to \nEnable Tab Bar Access\n. Add the desired roles and click \nSave\n. \n \nFeature Permission Tab\n \n \nEnable Tab Bar Access\n Users must reload their page in their browser before they will see the Tab Bar option in their user menu. Alternately they can logout and log back in. You can reload the page by holding the control (CTRL) key (or the command key⌘ on Mac OS X) and pressing the F5 key on your keyboard.\nEnabling/Disabling the Tab Bar Feature\nIf your role has been given access to use the Tab Bar Feature you can toggle this feature on or off. Utilizing Tab Bar functionality is beneficial if you wish to easily compare two separate records in your instance, or if you wish to configure settings and quickly view the results of your recent changes. If Tab Bar Access has previously been enabled for your role by your Global Administrator, then follow these steps to enable the tab bar functionality. If Tab Bar Access has not been previously enabled on your instance by your Global Administrator, follow the steps in the previous section.\nTo Enable:\n Go to the User Menu and under the \nActions\n select \nEnable Tab Bar\n. (If you do not see this option, a Global Administrator will need to Enable Tab Bar access within your instance as outlined in the previous section. Contact your Global Administrator for assistance.) \n \nEnable Tab Bar User Menu\n You can now add new tabs by pressing the \nNew Tab Button\n (signified by a plus sign) towards the bottom left corner of the browser window, and can close each tab with the \nx\n located on the right side of the tab.\n You can now have multiple tabs of SmartSimple open on a single instance, within a single browser tab. \n \nTab Bar Active\nTo Disable:\n Go to the User Menu and select \nDisable Tab Bar\n.\nHow to use:\n Once the feature is enabled, you can now add new tabs by pressing the \nNew Tab Button\n (signified by a plus sign) towards the bottom left corner of the browser window.\n Select a tab to open the page from that tab. You can navigate SmartSimple within a given tab, change tabs and the tab will remain on the same page.\n You can also close each tab with the \nx\n located on the right side of the tab. This will return you to the previous tab that you had selected. If there is only one tab remaining, you will not be able to close this final tab but you can disable the Tab Bar feature. If this is the case, go to the User Menu and select \nDisable Tab Bar\n.\n The Tab Bar’s \nMultitask Button\n is ideal for comparing to records in your instance simultaneously, in split-screen view. This is ideal for users such as reviewers, who complete review forms while evaluating applications or if you want to see a user and their organization details side by side. You can access the \nMultitask Button\n while the Tab Bar is enabled, it is located on the right side of the tab bar. The two tabs shown in this mode will be the previous two tabs selected. You can select any tab to shift what is displayed side by side. You can also use the arrows to move between tabs when you are in multitask mode. Select this button to toggle the functionality on and off.\nSettings Explained\nSetting\nDescription                \nExample\nNew Tab Button\nThis button is used to create a new tab. Upon pressing this button, a new tab will open, which can be found in the tab bar at the bottom of the screen.\n \nThe New Tab Button\nTabs\nSelect a tab to open the page from that tab. Tabs can be reordered by dragging and dropping the desired tab from left to right, or vice versa. \n \nThe Tab Bar\nMultitask Button\nThe Multitask Button is used to allow for split-screen viewing of two tabs at a time. The two tabs shown in this mode will be the last two tabs selected. Select this button to toggle the functionality on and off. \n \nThe Multitask Button\nClose Tab Button\nThe Close Tab Button is used to close a tab from the tab bar which you do not wish to use anymore. Upon selecting, the selected tab will close, and you will be returned to the previous tab which you were viewing.\n \nThe Close Tab Button\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=Tab_Bar&oldid=37898\n’ \nCategories\n: \nTools\nInterface",
  "links": [],
  "images": [
    "https://wiki.smartsimple.com/images/7/76/Menu_Icon.png",
    "https://wiki.smartsimple.com/images/1/11/Global_Settings.png",
    "https://wiki.smartsimple.com/images/5/5b/Security_Tab.png",
    "https://wiki.smartsimple.com/images/6/63/System_Feature_Permissions.png",
    "https://wiki.smartsimple.com/images/8/86/Feature_Permission_Tab.png",
    "https://wiki.smartsimple.com/images/1/14/Enable_Tab_Bar_Access.png",
    "https://wiki.smartsimple.com/images/1/1b/Enable_Tab_Bar_User_Menu.png",
    "https://wiki.smartsimple.com/images/7/75/Tab_Bar_Active.png",
    "https://wiki.smartsimple.com/images/d/d8/New_Tab_Resized.png",
    "https://wiki.smartsimple.com/images/e/e3/Tab_Bar_Resized.png",
    "https://wiki.smartsimple.com/images/a/a3/Multitask_Button.png",
    "https://wiki.smartsimple.com/images/a/a8/Close_Tab_Button.png"
  ]
}