{
  "url": "https://wiki.smartsimple.com/wiki/User_Delegation",
  "title": "User Delegation",
  "content": "From SmartWiki\n Jump to: \nnavigation\n, \nsearch\nContents\n1\n \nOverview\n2\n \nConfiguration—Essentials\n2.1\n \nIdentifying which users can delegate to other users and users that can be delegated to\n2.2\n \nSetting up the delegation\n3\n \nDelegate Notification and Emulation\n4\n \nOther considerations\nOverview\nThe delegation feature in SmartSimple Cloud allows users to assign delegates who can act on their behalf within the system for a specified period. This is particularly useful during periods when a user will be out of the office, such as for vacation, maternity leave, or other temporary absences. Users can choose a delegate, such as a manager, co-worker, or colleague, to perform their tasks during their absence.\nThis feature eliminates the need to temporarily modify role permissions or assign other users to specific records. Additionally, this functionality is applicable to all internal or external users as it is enabled by role.\nThis article will guide you through setting up and utilizing SmartSimple Cloud's user delegation functionality within your system.\nConfiguration—Essentials\nIdentifying which users can delegate to other users and users that can be delegated to\nTo enable delegation for users of your system based on their roles, you must be a Global Administrator. Consider which roles in your system should have access to the User Delegation feature.\n Sign in as a global administrator and go to the \nGlobal Settings\n.\n Navigate to the \nSecurity\n tab and select \nSystem Feature Permissions\n.\n Go to the \nFeatures\n tab to find \nDelegation\n settings.\n Configure\n Delegation - Roles That Can Delegate\n and \nDelegation - Roles to Delegate to\n.\nNote that global administrators can only delegate to other global administrators, and internal users can only delegate to other internal users. Additionally, this feature is not limited to internal users. External users, e.g. applicants, reviewers. Once a user is delegated, they will receive an email notification that they have been selected as a delegate. Once they login, the user will see a new icon in the global header that allows them to temporarily emulate another user.\nSetting up the delegation\nAs an example, as a staff member going out of the office, you can delegate another user by following these steps:\n Select the user menu in the top right corner and select \nDelegation\n.\n Select the user to delegate to by typing their email and selecting from the autocomplete options.\n Set the delegation period start and end dates.\n Optionally enter a sample message to notify others of your out-of-office status.\n Click \nSave\n button to send the email notification and enable delegation.\n \nUsers with permission may delegate to another user while they are out of office.\nThe delegate can then log in and see the delegation button, which allows them to emulate the user and perform tasks on their behalf. All actions taken by the delegate will be recorded in the audit logs.\nDelegate Notification and Emulation\nOnce a user is delegated, the delegate will receive an email notification. Upon logging in, the delegate will see an icon in the global header to temporarily emulate the user. Below is an example of how this feature works:\n \nIf you have permission to temporarily emulate a specific user, you will see a new \nDelegation\n icon in the header. Select the specific user you would like to emulate.\n \nUsers may optionally enter an out of office message that will show up on their profile.\nOther considerations\n Please note that the delegation functionality cannot be set or used while in emulation mode.\n \n Retrieved from ‘\nhttps://wiki.smartsimple.com/index.php?title=User_Delegation&oldid=42879\n’ \nCategories\n: \nSecurity\nExpert Tips and Tricks\nGlobal Settings",
  "links": [],
  "images": [
    "https://wiki.smartsimple.com/images/7/7f/Delegation-user-2024.png",
    "https://wiki.smartsimple.com/images/a/ae/2023-07-ticket-143373-3.png",
    "https://wiki.smartsimple.com/images/5/5c/2023-07-ticket-143373-2.png"
  ]
}